
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	РазделПроекта = Параметры.РазделПроекта;
	УстановитьПараметрРаздел(Список, РазделПроекта);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Настройки.Получить("Ответственный")<>Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ответственный", Ответственный, ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(Ответственный));
	КонецЕсли;
	
	Если Настройки.Получить("Зарегистрировал")<>Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Зарегистрировал", Зарегистрировал, ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(Зарегистрировал));
	КонецЕсли;
	
	Если Настройки.Получить("Статус")<>Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Статус", Статус, ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(Статус));
	КонецЕсли;
	
	Если Настройки.Получить("Важность")<>Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Важность", Важность, ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(Важность));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.РазделПроекта) Тогда
		РазделПроекта = Параметры.РазделПроекта;
	Иначе
		Если Настройки.Получить("РазделПроекта")<>Неопределено Тогда
			УстановитьПараметрРаздел(Список, РазделПроекта);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененТекущийПроект" Тогда
		Проекты.УстановитьОтборВСпискеПоПроекту(Список);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборРазделПроектаПриИзменении(Элемент)
	
	УстановитьПараметрРаздел(Список, РазделПроекта);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтветственныйПриИзменении(Элемент)
	
	ИзменитьОтбор("Ответственный", Ответственный);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЗарегистрировалПриИзменении(Элемент)
	
	ИзменитьОтбор("Зарегистрировал", Зарегистрировал);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусПриИзменении(Элемент)
	
	ИзменитьОтбор("Статус", Статус);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВажностьПриИзменении(Элемент)
	
	ИзменитьОтбор("Важность", Важность);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметрРаздел(Список, РазделПроекта)

	Список.Параметры.УстановитьЗначениеПараметра("Раздел", РазделПроекта);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьОтбор(ИмяЭлементаОтбора, ЗначениеОтбора)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, ИмяЭлементаОтбора, ЗначениеОтбора, ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(ЗначениеОтбора));
	
КонецПроцедуры

#КонецОбласти
