
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СписокОбъектовМетаданных = Новый СписокЗначений();
	
	Для Каждого ОбъектМетаданных из ПараметрКоманды Цикл
		СписокОбъектовМетаданных.Добавить(ОбъектМетаданных);
	КонецЦикла;
	
	ОткрытьФорму(
		"Отчет.СравнениеРеквизитовОбъектовМетаданных.Форма",
		Новый Структура("Отбор,СформироватьПриОткрытии", Новый Структура("ОбъектМетаданных", СписокОбъектовМетаданных), Ложь),
		,
		"Объект метаданных=" + ПараметрКоманды,
		ПараметрыВыполненияКоманды.Окно
	);
	
КонецПроцедуры
