
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура();
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ЗадачиПроцесса") Тогда
		ПараметрыФормы.Вставить("ИспользуетсяДляЗадач", Истина);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Ошибки") Тогда
		ПараметрыФормы.Вставить("ИспользуетсяДляОшибок", Истина);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ОбъектыМетаданных") Тогда
		ПараметрыФормы.Вставить("ИспользуетсяДляОбъектовМетаданных", Истина);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ПрофилиПользователей") Тогда
		ПараметрыФормы.Вставить("ИспользуетсяДляПрофилейПользователей", Истина);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Процессы") Тогда
		ПараметрыФормы.Вставить("ИспользуетсяДляПроцессов", Истина);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ТехническиеПроекты") Тогда
		ПараметрыФормы.Вставить("ИспользуетсяДляТехническихПроектов", Истина);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Идеи") Тогда
		ПараметрыФормы.Вставить("ИспользуетсяДляИдей", Истина);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ФункцииСистемы") Тогда
		ПараметрыФормы.Вставить("ИспользуетсяДляФункций", Истина);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Проекты") Тогда
		ПараметрыФормы.Вставить("ИспользуетсяДляПроектов", Истина);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Регламенты.ФормаСписка",
				 ПараметрыФормы,
				 ПараметрыВыполненияКоманды.Источник,
				 ПараметрыВыполненияКоманды.Уникальность,
				 ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
