#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Обработчик = Параметры.Обработчик;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КонфликтыСЧитателями,
																		"ОбработчикПисатель",
																		Обработчик,
																		ВидСравненияКомпоновкиДанных.Равно,
																		,
																		ЗначениеЗаполнено(Обработчик));
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КонфликтыСПисателями,
																		"ОбработчикЧитательИлиПисатель",
																		Обработчик,
																		ВидСравненияКомпоновкиДанных.Равно,
																		,
																		ЗначениеЗаполнено(Обработчик));


	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КонфликтыСПисателями,
																		"КонфликтЧтенияЗаписи",
																		Истина,
																		ВидСравненияКомпоновкиДанных.Равно,
																		,
																		Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиТаблицыФормыКонфликтыСЧитателями

&НаКлиенте
Процедура КонфликтыСЧитателямиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КонфликтыСЧитателямиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиТаблицыФормыКонфликтыСЧитателями

&НаКлиенте
Процедура КонфликтыСПисателямиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КонфликтыСПисателямиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти