
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьПереданныеПараметры();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьПереданныеПараметры()

	Если ЭтоАдресВременногоХранилища(Параметры.АдресТаблицыНастройкиПланирования) Тогда
		
		ТаблицаНастроек = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыНастройкиПланирования);
		Для Каждого СтрокаТаблицы Из ТаблицаНастроек Цикл
			
			НоваяСтрока = НастройкиПланирования.Добавить();
			НоваяСтрока.КоличествоПериодов   = СтрокаТаблицы.КоличествоПериодов;
			НоваяСтрока.ПредставлениеПериода = СтрШаблон(НСтр("ru = '%1 - %2'"), 
			                                             Формат(СтрокаТаблицы.НачалоДействия, "ДЛФ=D"),
			                                             Формат(СтрокаТаблицы.КонецДействия, "ДЛФ=D"));
			НоваяСтрока.Периодичность        =
				ПланированиеКлиентСервер.ПредставлениеПеридичностиВЗависимостиОтКоличестваПериодов(СтрокаТаблицы.Периодичность,
				                                                                                   СтрокаТаблицы.КоличествоПериодов);
			
		КонецЦикла;
	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти