#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Библиотека = Ложь;
	
	Если Параметры.Свойство("Библиотека") Тогда
		Библиотека = Параметры.Библиотека;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Библиотека Тогда
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.Добавить(Перечисления.СтатусыСборокВерсииПроекта.НеДляВстраивания);
		СписокВыбора.Добавить(Перечисления.СтатусыСборокВерсииПроекта.ДляПредварительногоВстраивания);
		СписокВыбора.Добавить(Перечисления.СтатусыСборокВерсииПроекта.Финальная);
	Иначе
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.Добавить(Перечисления.СтатусыСборокВерсииПроекта.Ознакомительная);
		СписокВыбора.Добавить(Перечисления.СтатусыСборокВерсииПроекта.Тестовая);
		СписокВыбора.Добавить(Перечисления.СтатусыСборокВерсииПроекта.Финальная);
	КонецЕсли;
	
	ДанныеВыбора = СписокВыбора;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
