#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыСценария = Параметры.ПараметрыСценария;
	СписокКолонок.Очистить();
	
	Для Каждого ТекПарам Из ПараметрыСценария Цикл
		СписокКолонок.Добавить(ТекПарам,,Истина);
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПометитьВсе(Команда)
	
	Для Каждого Элем Из СписокКолонок Цикл
		Элем.Пометка = Истина;
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для Каждого Элем Из СписокКолонок Цикл
		Элем.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Результат = Новый Массив;
	Для Каждого Элем Из СписокКолонок Цикл
		Если НЕ Элем.Пометка Тогда
			Продолжить;
		КонецЕсли;	
		Результат.Добавить(Элем.Значение);
	КонецЦикла;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяСобытия", "ВыборПараметровСценария");
	ДопПараметры.Вставить("ПараметрыСценария", Результат);
	ОповеститьОВыборе(ДопПараметры);
	
КонецПроцедуры

#КонецОбласти