
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТолькоСценарииСФлагомИспользоватьВПроцессах") Тогда
		ОтборПоФлагу                = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоФлагу.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("РазрешеноИспользоватьВПроцессах");
		ОтборПоФлагу.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ОтборПоФлагу.ПравоеЗначение = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

