
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтруктураОтбора = Новый Структура;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючВарианта", "ЗатратыВремени");
	ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Ложь);
	ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов", Истина);

	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		
		СписокЗначений = Новый СписокЗначений;
		СписокЗначений.ЗагрузитьЗначения(ПараметрКоманды);
			
		Если ПараметрКоманды.Количество()>0 Тогда
			ДанныеПараметра = ПараметрКоманды[0];
		Иначе
			ДанныеПараметра = Неопределено;
		КонецЕсли;
		
		Если ТипЗнч(ДанныеПараметра) = Тип("СправочникСсылка.ЗадачиПроцесса") Тогда
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Задача", ПараметрКоманды);
			
			ЭлементОтбора = Новый Структура;
			ЭлементОтбора.Вставить("ВидСравнения", ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии);
			ЭлементОтбора.Вставить("ПравоеЗначение", СписокЗначений);
			
			СтруктураОтбора.Вставить("Задача", ЭлементОтбора);
			
			ПараметрыФормы.Вставить("КлючВарианта", "ЗатратыВремениПоЗадаче");
			ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
			ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
			
		ИначеЕсли ТипЗнч(ДанныеПараметра) = Тип("СправочникСсылка.Ошибки") Тогда
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Ошибка", СписокЗначений);
			
			ПараметрыФормы.Вставить("КлючВарианта", "ЗатратыВремениПоОшибке");
			ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
			ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
			
		ИначеЕсли ТипЗнч(ДанныеПараметра) = Тип("ДокументСсылка.УчетВремени") Тогда
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Регистратор", СписокЗначений);
			
			ПараметрыФормы.Вставить("КлючВарианта", "ЗатратыВремениПоРегистратору");
			ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
			ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
			
		КонецЕсли;
		
	КонецЕсли;
		
	ОткрытьФорму("Отчет.ЗатратыВремени.Форма", ПараметрыФормы,, Истина, ПараметрыВыполненияКоманды.Окно);
		
КонецПроцедуры

#КонецОбласти