
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыСборки = ПараметрыСборки(ПараметрКоманды);
	
	ПараметрыФормы = Новый Структура("КлючВарианта, Отбор, СформироватьПриОткрытии, ВидимостьКомандВариантовОтчетов", 
		"ОшибкиИсправленныеВВерсииКонтекстный",
		ПараметрыСборки, 
		Истина,
		Ложь);
		
	ОткрытьФорму(
		"Отчет.ОшибкиИсправленныеВВерсии.Форма",
		ПараметрыФормы, ,
		Истина,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыСборки(Сборка)
	
    Возврат Справочники.СборкиВерсии.ПараметрыСборки(Сборка);
	
КонецФункции