#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Текст = Параметры.ТекстСценария;
	
	Проект = Неопределено;
	Параметры.Свойство("Проект",Проект);
	
	Если Параметры.Свойство("ДопПараметры") Тогда
		ДополнительныеПараметры = ОбщегоНазначения.СкопироватьРекурсивно(Параметры.ДопПараметры);
	Иначе	
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;	 
	
	ДополнительныеПараметры.Вставить("ДелатьРаскраску",Истина);
	ДополнительныеПараметры.Вставить("ИсключитьСлужебныеСловаИзТекстаСценария",Ложь);
	ДополнительныеПараметры.Вставить("ЧтениеИзТекста",Ложь);
	ДополнительныеПараметры.Вставить("ОбрабатыватьЭкранированныеСпецсимволы",Истина);
	
	ТестированиеГрафическиеСхемыСервер.ТекстФорматированныйТекстСценарияИзОбычногоТекста(Текст,ПолеТекстСценариевФД,
	                                    Проект,Параметры.Сценарий,ДополнительныеПараметры);
										
	ПолеТекстСценариев.ДобавитьСтроку(ТестированиеГрафическиеСхемыСервер.ОбычныйТекстСценарияИзФорматированногоДокумента(
	      ПолеТекстСценариевФД,ДополнительныеПараметры));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьТекстДокумента(Команда)
	Текст = ПолеТекстСценариевФД.ПолучитьТекст();
	
	ТД = Новый ТекстовыйДокумент;
	ТД.ДобавитьСтроку(Текст);
	ТД.Показать();
	
	ТекстHTML = ПолучитьТекстHTML();
	ТД = Новый ТекстовыйДокумент;
	ТД.ДобавитьСтроку(ТекстHTML);
	ТД.Показать();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьТекстHTML()
	ТекстHTML = "";
	Вложения = Новый Структура;
	ПолеТекстСценариевФД.ПолучитьHTML(ТекстHTML,Вложения);
	
	Возврат ТекстHTML;
КонецФункции	

#КонецОбласти