#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Наименование = СокрЛП(Владелец) + "." + Имя;

	ТекОписаниеТиповФормы = "";

	Для Каждого СтрокаТипа Из ТипыФормы Цикл
		ТекОписаниеТиповФормы = ТекОписаниеТиповФормы + СтрокаТипа.ТипФормы + ", ";
	КонецЦикла;

	Если Не ПустаяСтрока(ТекОписаниеТиповФормы) Тогда
		ТекОписаниеТиповФормы = Лев(ТекОписаниеТиповФормы, СтрДлина(ТекОписаниеТиповФормы) - 2);
	КонецЕсли;

	ОписаниеТиповФормы = ТекОписаниеТиповФормы;

КонецПроцедуры

#КонецОбласти

#КонецЕсли