////////////////////////////////////////////////////////////////////////////////
//  Серверные процедуры и функции подсистемы "Приоритеты и очереди работ", доступные для вызова с клиента
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Выполняет изменение приоритета работы
//
// Параметры:
//  ПараметрыПостановки - Структура - см. ПриоритетыОчередиРаботыКлиентСервер.НовыйДанныеПриоритета.
//
Функция РезультатИзмененияПриоритетаРаботы(ПараметрыИзмененияПриоритета) Экспорт
	
	Возврат ПриоритетыОчередиРабот.РезультатИзмененияПриоритетаРаботы(ПараметрыИзмененияПриоритета);
	
КонецФункции

// Выполняет обработку команды изменения приоритетов у нескольких работ
//
// Параметры:
//  ПараметрыПостановки - Массив - состоит из структур, см. ПриоритетыОчередиРаботыКлиентСервер.НовыйДанныеПриоритета
//
// Возвращаемое значение:
//   Структура   - результат постановки, содержит:
//    * ВсегоОбъектов          - Число - количество объектов, для которых требовалось изменить приоритет.
//    * ИзмененПриоритет       - Число - количество объектов, для которых был изменен приоритет.
//    * НеПоставленоНаКонтроль - Число - количество объектов, для которых не был изменен приоритет.
//    * СообщенияПользователю  - Массив - сообщения о неудачном изменении приоритета, которые требуется показать пользователю.
//
Функция РезультатИзмененияПриоритетаМассиваРабот(ПараметрыИзменения) Экспорт
	
	Возврат ПриоритетыОчередиРабот.РезультатИзмененияПриоритетаМассиваРабот(ПараметрыИзменения);
	
КонецФункции

// Устанавливает новый текст подсказки команды постановки на контроль
//
// Параметры:
//  КомандаФормы   - Команда - команда, для которой изменяет подсказка.
//  ТекстПодсказки - Строка - устанавливаемый текст подсказки.
//
Процедура ИзменитьТекстПодсказкиКомандыФормы(КомандаФормы, ТекстПодсказки) Экспорт
	
	КомандаФормы.Подсказка = ТекстПодсказки;
	
КонецПроцедуры

// Получает данные объектов, которые пользователь хочет поставить на контроль
//
// Параметры:
//  ОбъектыКонтроля - Массив - массив объектов контроля.
//  СписокКонтроля  - СправочникСсылка.СпискиКонтроля - список контроля, для которого выполняется постановка.
//
// Возвращаемое значение:
//   Массив Из Структура - содержит:
//    * ОбъектКонтроля        - СправочникСсылка - объект, который ставится на контроль.
//    * СтатусКонтроля        - Строка - текущий статус контроля.
//    * ПлановаяДатаОкончания - Дата - плановая дата завершения работ.
//    * Ответственный         - СправочникСсылка.Пользователи - ответственный за объект.
//    * ТехническийПроект     - СправочникСсылка.ТехническийПроект - технический проект объекта контроля.
//
Функция ДанныеОбъектовКонтроляДляПостановкиНаКонтроль(ОбъектыКонтроля, СписокКонтроля) Экспорт
	
	Возврат ОбъектыНаКонтроле.ДанныеОбъектовКонтроляДляПостановкиНаКонтроль(ОбъектыКонтроля, СписокКонтроля);
	
КонецФункции

#КонецОбласти
