
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = ПланированиеКлиентСервер.НовыйПараметрыФормированияОтчетаКонтрольПланирования();
	
	ПараметрыОткрытия.ВариантГруппировки          = "ОтТехПроектов"; 
	ПараметрыОткрытия.КлючНазначенияИспользования = "ПоТехническимПроектамИзСписка";
	ПараметрыОткрытия.СформироватьПриОткрытии     = Истина;
	ОтборПоТехническимПроектам                    = Новый СписокЗначений;
	ОтборПоТехническимПроектам.ЗагрузитьЗначения(ПараметрКоманды);
	ПараметрыОткрытия.ОтборПоТехническимПроектам  = ОтборПоТехническимПроектам;
	
	ОткрытьФорму("Отчет.КонтрольПланирования.Форма.ФормаОтчета", ПараметрыОткрытия);
	
КонецПроцедуры
