#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	НовоеЧислоСтрок = СтрЧислоСтрок(Текст);
	
	Если ЧислоСтрок = НовоеЧислоСтрок Тогда
		Закрыть(Текст);
	Иначе
		ТекстСообщения = НСтр(
			"ru = 'Число строк текста до редактирования (%1) должно равняться числу строк после редактирования (%2).
			|Если вы сбились, лучше закрыть редактор без изменений, открыть заново и внести изменения еще раз.'");
		ПоказатьПредупреждение(, СтрШаблон(ТекстСообщения, ЧислоСтрок, НовоеЧислоСтрок));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Текст = Параметры.Текст;
	ЧислоСтрок = СтрЧислоСтрок(Текст);
	
КонецПроцедуры

#КонецОбласти
