////////////////////////////////////////////////////////////////////////////////
//  Серверные процедуры и функции подсистемы "Объекты на контроле", доступные для вызова с клиента
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Выполняет постановку объекта на контроль
//
// Параметры:
//  ПараметрыПостановки - Структура - см. ОбъектыНаКонтролеКлиентСервер.НовыйПараметрыПостановкиНаКонтроль.
//
Процедура ПоставитьОбъектНаКонтроль(ПараметрыПостановки) Экспорт
	
	ОбъектыНаКонтроле.ПоставитьОбъектНаКонтроль(ПараметрыПостановки);
	
КонецПроцедуры

// Выполняет постановку массива объектов на контроль на контроль
//
// Параметры:
//  ПараметрыПостановки - Массив - состоит из структур, см. ОбъектыНаКонтролеКлиентСервер.НовыйПараметрыПостановкиНаКонтроль
//
// Возвращаемое значение:
//   Структура   - результат постановки, содержит:
//    * ВсегоОбъектов          - Число - количество объектов, которые требовалось поставить на контроль.
//    * ПоставленоНаКонтроль   - Число - количество объектов, которые были поставлены на контроль.
//    * НеПоставленоНаКонтроль - Число - количество объектов, которые не были поставлены на контроль.
//    * СообщенияПользователю  - Массив - сообщения о неудачной постановке на контроль, которые требуется показать пользователю.
//
Функция РезультатПостановкиМассиваОбъектовНаКонтроль(ПараметрыПостановки) Экспорт
	
	Возврат ОбъектыНаКонтроле.РезультатПостановкиМассиваОбъектовНаКонтроль(ПараметрыПостановки);
	
КонецФункции

// Устанавливает новый текст подсказки команды постановки на контроль
//
// Параметры:
//  КомандаФормы   - Команда - команда, для которой изменяет подсказка.
//  ТекстПодсказки - Строка - устанавливаемый текст подсказки.
//
Процедура ИзменитьТекстПодсказкиКомандыФормы(КомандаФормы, ТекстПодсказки) Экспорт
	
	КомандаФормы.Подсказка = ТекстПодсказки;
	
КонецПроцедуры

// Получает данные объектов, которые пользователь хочет поставить на контроль
//
// Параметры:
//  ОбъектыКонтроля - Массив - массив объектов контроля.
//  СписокКонтроля  - СправочникСсылка.СпискиКонтроля - список контроля, для которого выполняется постановка.
//
// Возвращаемое значение:
//   Массив Из Структура - содержит:
//    * ОбъектКонтроля        - СправочникСсылка - объект, который ставится на контроль.
//    * СтатусКонтроля        - Строка - текущий статус контроля.
//    * ПлановаяДатаОкончания - Дата - плановая дата завершения работ.
//    * Ответственный         - СправочникСсылка.Пользователи - ответственный за объект.
//    * ТехническийПроект     - СправочникСсылка.ТехническийПроект - технический проект объекта контроля.
//
Функция ДанныеОбъектовКонтроляДляПостановкиНаКонтроль(ОбъектыКонтроля, СписокКонтроля) Экспорт
	
	Возврат ОбъектыНаКонтроле.ДанныеОбъектовКонтроляДляПостановкиНаКонтроль(ОбъектыКонтроля, СписокКонтроля);
	
КонецФункции

#КонецОбласти
