#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("ОбщаяЗадача", ПараметрКоманды);
	
	ОткрытьФорму("РегистрСведений.ВыполнениеОбщихЗадач.Форма.ИсторияПланированияВыполненияЗадачи",
					ПараметрыФормы,
					ПараметрыВыполненияКоманды.Источник,
					ПараметрыВыполненияКоманды.Уникальность,
					ПараметрыВыполненияКоманды.Окно,
					ПараметрыВыполненияКоманды.НавигационнаяСсылка);
					
КонецПроцедуры

#КонецОбласти