#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоступноИзменениеОшибок = РольДоступна("ДобавлениеИзменениеОшибок")
	                          ИЛИ РольДоступна("ПолныеПрава");
							  
	ДоступноПланированиеОтработки = РольДоступна("ПланированиеОтработкиОшибок")
	                          ИЛИ РольДоступна("ПолныеПрава");
	
	Если Параметры.КлючНазначенияИспользования = "ПодборДляТехническихПроектов" 
		ИЛИ Параметры.Свойство("РежимВыбора") И Параметры.РежимВыбора Тогда
		Элементы.Список.РежимВыбора = Истина;
	Иначе
		Проект = ПараметрыСеанса.ТекущийПроект;
		
		УстановитьПараметрыВыбораСпискаВерсийИсправленияСпискаОшибок(Проект);
		УстановитьПараметрыВыбораСпискаРелизныхВетокСпискаОшибокВВетках(Проект);
		
		Проекты.УстановитьОтборВСпискеПоПроекту(Список, Проект);
		Проекты.УстановитьОтборВСпискеПоПроекту(СписокОшибокВВетках, Проект);
	КонецЕсли;
	
	УстановитьДоступностьЭлементов();
	УстановитьДоступностьЭлементовОтбораСпискаОшибокПоСтатусу();
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтаФорма, Элементы.СписокКомандыФормы);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ОбъектыНаКонтроле
	СпискиДляВыводаКомандКонтроля = Новый Массив;
	СпискиДляВыводаКомандКонтроля.Добавить(
		ОбъектыНаКонтроле.ДанныеСпискаДляВыводаКомандКонтроля(
		"Список", "СписокГруппаКонтроль", "СписокКонтекстноеМенюГруппаКонтроль"));
	ОбъектыНаКонтроле.НастроитьЭлементыПоставитьНаКонтрольВФормеСписка(ЭтотОбъект, СпискиДляВыводаКомандКонтроля);
	// Конец ОбъектыНаКонтроле
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Отборы списка ошибок
	ПриИзмененииВариантаОтбораСпискаОшибокПоСтатусу();
	УстановитьОтборСпискаОшибокПоСрочностиИсправления();
	УстановитьОтборСпискаОшибокПоВерсииИсправления();
	УстановитьОтборСпискаОшибокПоКомуНаправленаПользователь();
	УстановитьОтборСпискаОшибокПоКомуНаправленаПодразделение();
	УстановитьОтборСпискаОшибокПоМестуОбнаружения();
	УстановитьОтборСпискаОшибокПоИсточнику();
	УстановитьОтборСпискаОшибокПоОтработал(ОтработалПодразделениеСпискаОшибок, "Подразделение");
	УстановитьОтборСпискаОшибокПоОтработал(ОтработалПользовательСпискаОшибок);
	
	// Отборы списка ошибок в ветках
	ПриИзмененииВариантаОтбораСпискаОшибокВВеткахПоСтатусу();
	УстановитьОтборСпискаОшибокВВеткахПоСрочностиИсправления();
	УстановитьОтборСпискаОшибокВВеткахПоРелизнымВеткам();
	УстановитьОтборСпискаОшибокВВеткахПоСтатусуВеткиИсправления();
	УстановитьОтборСпискаОшибокПоСостояниюИсправления();
	УстановитьОтборСпискаОшибокВВеткахПоПодразделениюОтветственномуЗаВеткуИсправления();
	УстановитьОтборСпискаОшибокВВеткахПоОтветственномуЗаВеткуИсправления();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененТекущийПроект" Тогда
		УстановитьОтборПоПроектуСервер();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантОтбораПоСтатусуСпискаОшибокПриИзменении(Элемент)
	
	ПриИзмененииВариантаОтбораСпискаОшибокПоСтатусу();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСтатусовДляСпискаОшибокПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокПоСтатусу();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСтатусовДляСпискаОшибокНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = Новый Структура("СписокВыбора", СписокОтбораПоСтатусамСпискаОшибок);
	
	ОткрытьФорму("Перечисление.СтатусыОшибок.Форма.ВыборСпискаСтатусов", СтруктураПараметров, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСтатусовДляСпискаОшибокОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СписокОтбораПоСтатусамСпискаОшибок = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура СрочностьНемедленноДляСпискаОшибокПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокПоСрочностиИсправления();
	
КонецПроцедуры

&НаКлиенте
Процедура СрочностьЖелательноБыстрееДляСпискаОшибокПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокПоСрочностиИсправления();
	
КонецПроцедуры

&НаКлиенте
Процедура СрочностьВПлановомПорядкеДляСпискаОшибокПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокПоСрочностиИсправления();
	
КонецПроцедуры

&НаКлиенте
Процедура НаправленаПодразделениеСпискаОшибокПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокПоКомуНаправленаПодразделение();
	
КонецПроцедуры

&НаКлиенте
Процедура НаправленаПользовательСпискаОшибокПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокПоКомуНаправленаПользователь();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбнаруженаВСборкахДляСпискаОшибокПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокПоМестуОбнаружения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбнаруженаВОсновнойВеткеДляСпискаОшибокПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокПоМестуОбнаружения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбнаруженаВВеткахВерсийДляСпискаОшибокПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокПоМестуОбнаружения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбнаруженаВПрочихВеткахДляСпискаОшибокПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокПоМестуОбнаружения();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникВнешнийСпискаОшибокПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокПоИсточнику();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникРучноеТестированиеСпискаОшибокПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокПоИсточнику();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникАвтотестыСпискаОшибокПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокПоИсточнику();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтработалПодразделениеСпискаОшибокПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокПоОтработал(ОтработалПодразделениеСпискаОшибок, "Подразделение");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтработалПользовательСпискаОшибокПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокПоОтработал(ОтработалПользовательСпискаОшибок);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтбораОтработалСпискаОшибокПриИзменении(Элемент)
	
	ПриИзмененнииОтбораСпискаОшибокОтработал();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтбораОтработалСпискаОшибокНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = Новый Структура("СписокВыбора", СписокОтбораОтработалСпискаОшибок);
	
	ОткрытьФорму("Справочник.Ошибки.Форма.ВыборЗначенийОтработал", СтруктураПараметров, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтбораОтработалСпискаОшибокОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СписокОтбораОтработалСпискаОшибок = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтбораПоСтатусуСпискаОшибокВВеткахПриИзменении(Элемент)
	
	ПриИзмененииВариантаОтбораСпискаОшибокВВеткахПоСтатусу();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтбораПоСтатусамСпискаОшибокВВеткахПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокВВеткахПоСтатусу();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтбораПоСтатусамСпискаОшибокВВеткахНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = Новый Структура("СписокВыбора", СписокОтбораПоСтатусамСпискаОшибокВВетках);
	
	ОткрытьФорму("Перечисление.СтатусыОшибок.Форма.ВыборСпискаСтатусов", СтруктураПараметров, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтбораПоСтатусамСпискаОшибокВВеткахОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СписокОтбораПоСтатусамСпискаОшибокВВетках = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура СрочностьНемедленноДляСпискаОшибокВВеткахПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокВВеткахПоСрочностиИсправления();
	
КонецПроцедуры

&НаКлиенте
Процедура СрочностьЖелательноБыстрееДляСпискаОшибокВВеткахПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокВВеткахПоСрочностиИсправления();
	
КонецПроцедуры

&НаКлиенте
Процедура СрочностьВПлановомПорядкеДляСпискаОшибокВВеткахПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокВВеткахПоСрочностиИсправления();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсправительнаяВеткаСпискаОшибокВВеткахРазрабатываетсяПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокВВеткахПоСтатусуВеткиИсправления();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсправительнаяВеткаСпискаОшибокВВеткахТестируетсяПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокВВеткахПоСтатусуВеткиИсправления();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсправительнаяВеткаСпискаОшибокВВеткахЗамороженаПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокВВеткахПоСтатусуВеткиИсправления();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсправительнаяВеткаСпискаОшибокВВеткахПомещенаПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокВВеткахПоСтатусуВеткиИсправления();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсправительнаяВеткаСпискаОшибокВВеткахНеУказанаПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокВВеткахПоСтатусуВеткиИсправления();
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеВВеткеТребуетсяИсправлениеПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокПоСостояниюИсправления();
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеВВеткеИсправленаПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокПоСостояниюИсправления();
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеВВеткеНеПланируетсяИсправлятьПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокПоСостояниюИсправления();
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеВВеткеОшибкиНеБылоВЭтойВеткеПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокПоСостояниюИсправления();
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеВВеткеИсправляетсяВОтдельнойОшибкеПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокПоСостояниюИсправления();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПодразделениеСпискаОшибокВВеткахПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокВВеткахПоПодразделениюОтветственномуЗаВеткуИсправления();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПользовательСпискаОшибокВВеткахПриИзменении(Элемент)
	
	УстановитьОтборСпискаОшибокВВеткахПоОтветственномуЗаВеткуИсправления();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыСписокВерсийИсправленияДляСпискаОшибок

&НаКлиенте
Процедура СписокВерсийИсправленияДляСпискаОшибокПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока И Не ОтменаРедактирования Тогда
		
		СтрокаТаблицы = СписокВерсийИсправленияДляСпискаОшибок.НайтиПоИдентификатору(Элемент.ТекущаяСтрока);
		Если СтрокаТаблицы <> Неопределено Тогда
			СтрокаТаблицы.Пометка = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьОтборСпискаОшибокПоВерсииИсправления();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВерсийИсправленияДляСпискаОшибокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		СтандартнаяОбработка = Ложь;
		
		Для Каждого ЭлементМассива из ВыбранноеЗначение Цикл
			НоваяСтрока = СписокВерсийИсправленияДляСпискаОшибок.Добавить();
			НоваяСтрока.Значение = ЭлементМассива;
			НоваяСтрока.Пометка = Истина;
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьОтборСпискаОшибокПоВерсииИсправления();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВерсийИсправленияДляСпискаОшибокПослеУдаления(Элемент)
	
	УстановитьОтборСпискаОшибокПоВерсииИсправления();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыСписокОтбораПоРелизнымВеткамСпискаОшибокВВетках

&НаКлиенте
Процедура СписокОтбораПоРелизнымВеткамСпискаОшибокВВеткахПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока И Не ОтменаРедактирования Тогда
		
		СтрокаТаблицы = СписокОтбораПоРелизнымВеткамСпискаОшибокВВетках.НайтиПоИдентификатору(Элемент.ТекущаяСтрока);
		Если СтрокаТаблицы <> Неопределено Тогда
			СтрокаТаблицы.Пометка = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьОтборСпискаОшибокВВеткахПоРелизнымВеткам();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтбораПоРелизнымВеткамСпискаОшибокВВеткахОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		СтандартнаяОбработка = Ложь;
		
		Для Каждого ЭлементМассива из ВыбранноеЗначение Цикл
			НоваяСтрока = СписокОтбораПоРелизнымВеткамСпискаОшибокВВетках.Добавить();
			НоваяСтрока.Значение = ЭлементМассива;
			НоваяСтрока.Пометка = Истина;
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьОтборСпискаОшибокВВеткахПоРелизнымВеткам();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтбораПоРелизнымВеткамСпискаОшибокВВеткахПослеУдаления(Элемент)
	
	УстановитьОтборСпискаОшибокВВеткахПоРелизнымВеткам();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ДействияСОшибкой" Тогда
		
		Если ВыбраннаяСтрока<>Неопределено Тогда
			
			ДанныеСтроки = Элемент.ДанныеСтроки(ВыбраннаяСтрока);
		    СтандартнаяОбработка = Ложь;
		
			ОбработатьДействиеСОшибкой(ДанныеСтроки.ДействияСОшибкой, ДанныеСтроки.Ссылка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыСписокОшибокВВетках

&НаКлиенте
Процедура СписокОшибокВВеткахВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", Элементы.СписокОшибокВВетках.ТекущиеДанные.Ссылка);
	ОткрытьФорму("Справочник.Ошибки.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура Зарегистрировать(Команда)
	
	ОткрытьФорму("Справочник.Ошибки.ФормаОбъекта", Новый Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура Вернуть(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		Если ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.СтатусыОшибок.НеЗарегистрирована") Тогда
			ТекстСообщения = НСтр("ru='Незарегистрированная ошибка не может быть возвращена'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		Ссылка = ТекущиеДанные.Ссылка;
		
		Структура = Новый Структура("Ссылка", Ссылка);
		ОписаниеОповещения = Новый ОписаниеОповещения("ВернутьЗавершение", ЭтотОбъект, Структура);
		ОткрытьФорму("Справочник.Ошибки.Форма.ВозвратОшибки", Структура, ЭтаФорма,,,, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьЗавершение(РезультатДействия, ДополнительныеПараметры) Экспорт
    
    Ссылка = ДополнительныеПараметры.Ссылка;
    
    Результат = РезультатДействия;
    
    Если ТипЗнч(Результат) = Тип("Структура") Тогда
        
        ВернутьСервер(Ссылка, Результат.КомуНаправлена, Результат.Комментарий);
        
        ТекстОповещения = НСтр("ru='Ошибка возвращена'");
        ПоказатьОповещениеПользователя(ТекстОповещения, ПолучитьНавигационнуюСсылку(Ссылка), Ссылка, БиблиотекаКартинок.Информация32);
        ИсторияРаботыПользователя.Добавить(Ссылка);
        
        Оповестить("ОшибкаВозвращена", Ссылка);
        ОповеститьОбИзменении(Тип("СправочникСсылка.Ошибки"));
        
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Перенаправить(Команда)
	
	Если Элементы.Список.ВыделенныеСтроки.Количество()>0 Тогда
		
		МассивСсылок = Новый Массив;
		
		Для Каждого Строка из Элементы.Список.ВыделенныеСтроки Цикл
			
			ДанныеСтроки = Элементы.Список.ДанныеСтроки(Строка);
			
			Если ДанныеСтроки.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыОшибок.НеЗарегистрирована")
				И ДанныеСтроки.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыОшибок.Отозвана") Тогда
				
				МассивСсылок.Добавить(Строка);
			КонецЕсли;
		КонецЦикла;
		
		Если МассивСсылок.Количество()=0 Тогда
			Возврат;
		КонецЕсли;
		
		Структура = Новый Структура("МассивСсылок", МассивСсылок);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПеренаправитьЗавершение", ЭтотОбъект, Структура);
		ОткрытьФорму("Справочник.Ошибки.Форма.ПеренаправлениеОшибки",, ЭтаФорма,,,, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренаправитьЗавершение(РезультатДействия, ДополнительныеПараметры) Экспорт
    
    МассивСсылок = ДополнительныеПараметры.МассивСсылок;
    
    Результат = РезультатДействия;
    
    Если ТипЗнч(Результат) = Тип("Структура") Тогда
        
        КоличествоОбработанных = 0;
        ПеренаправитьСервер(МассивСсылок, Результат.КомуНаправлена, Результат.Комментарий, КоличествоОбработанных);
        Элементы.Список.Обновить();
        
        ТекстОповещения = НСтр("ru='Перенаправлено ошибок: %Количество%'");
        ТекстОповещения = СтрЗаменить(ТекстОповещения, "%Количество%", КоличествоОбработанных);
        ПоказатьОповещениеПользователя(НСтр("ru='Перенаправление ошибок'"),,ТекстОповещения, БиблиотекаКартинок.Информация32);
        
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Ознакомиться(Команда)
	
	Если Элементы.Список.ВыделенныеСтроки.Количество()>0 Тогда
		
		МассивСсылок = Новый Массив;
		
		Для Каждого Строка из Элементы.Список.ВыделенныеСтроки Цикл
			
			ДанныеСтроки = Элементы.Список.ДанныеСтроки(Строка);
			
			Если (ДанныеСтроки.Статус = ПредопределенноеЗначение("Перечисление.СтатусыОшибок.ПроверенаИсправлена")
				ИЛИ ДанныеСтроки.Статус = ПредопределенноеЗначение("Перечисление.СтатусыОшибок.Закрыта")
				ИЛИ ДанныеСтроки.Статус = ПредопределенноеЗначение("Перечисление.СтатусыОшибок.Отозвана")
				ИЛИ ДанныеСтроки.Статус = ПредопределенноеЗначение("Перечисление.СтатусыОшибок.НеПланируетсяИсправлять")
				ИЛИ ДанныеСтроки.Статус = ПредопределенноеЗначение("Перечисление.СтатусыОшибок.ОжидаетИсправленияПовторяемойОшибки"))
				И ЗначениеЗаполнено(ДанныеСтроки.КомуНаправлена) Тогда
				
				МассивСсылок.Добавить(Строка);
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивСсылок.Количество()=0 Тогда
			Возврат;
		КонецЕсли;
		
		КоличествоОбработанных = 0;
		ОзнакомитьсяСервер(МассивСсылок, КоличествоОбработанных);
		
		Элементы.Список.Обновить();
		
		ТекстОповещения = НСтр("ru='Обработано ошибок: %Количество%'");
		ТекстОповещения = СтрЗаменить(ТекстОповещения, "%Количество%", КоличествоОбработанных);
		ПоказатьОповещениеПользователя(НСтр("ru='Ознакомление с ошибками'"),,ТекстОповещения, БиблиотекаКартинок.Информация32);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПризнатьИсправитьПроверитьЗакрыть(Команда)
	
	Если Элементы.Список.ВыделенныеСтроки.Количество()>0 Тогда
		
		СписокСсылок = Новый Массив;
		СписокПроектов = Новый Массив;
		СписокВерсий = Новый Массив;
		
		Для Каждого Строка из Элементы.Список.ВыделенныеСтроки Цикл
			
			ДанныеСтроки = Элементы.Список.ДанныеСтроки(Строка);
			
			Если (ДанныеСтроки.Статус = ПредопределенноеЗначение("Перечисление.СтатусыОшибок.Зарегистрирована")
				ИЛИ ДанныеСтроки.Статус = ПредопределенноеЗначение("Перечисление.СтатусыОшибок.Признана")
				ИЛИ ДанныеСтроки.Статус = ПредопределенноеЗначение("Перечисление.СтатусыОшибок.Исправлена")
				ИЛИ ДанныеСтроки.Статус = ПредопределенноеЗначение("Перечисление.СтатусыОшибок.ПроверенаИсправлена"))
				И НЕ ДанныеСтроки.ПометкаУдаления Тогда
				
				СписокСсылок.Добавить(Строка);
				
				Если СписокПроектов.Найти(ДанныеСтроки.Владелец) = Неопределено Тогда
					СписокПроектов.Добавить(ДанныеСтроки.Владелец);
				КонецЕсли;
				
				Если СписокВерсий.Найти(ДанныеСтроки.ВерсияИсправления) = Неопределено Тогда
					СписокВерсий.Добавить(ДанныеСтроки.ВерсияИсправления);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		Если СписокСсылок.Количество()=0 Тогда
			Возврат;
		КонецЕсли;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("СписокСсылок", СписокСсылок);
		ДопПараметры.Вставить("СписокПроектов", СписокПроектов);
		ДопПараметры.Вставить("СписокВерсий", СписокВерсий);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПризнатьисправитьПроверитьЗакрытьЗавершение", ЭтотОбъект, ДопПараметры);
		ОткрытьФорму("Справочник.Ошибки.Форма.ПризнатьИсправитьПроверитьЗакрыть",, ЭтаФорма,,,, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПризнатьИсправитьПроверитьЗакрытьЗавершение(РезультатДействия, ДополнительныеПараметры) Экспорт
    
    СписокСсылок = ДополнительныеПараметры.СписокСсылок;
    СписокПроектов = ДополнительныеПараметры.СписокПроектов;
	СписокВерсий = ДополнительныеПараметры.СписокВерсий;
    
    Если ТипЗнч(РезультатДействия) = Тип("Структура") Тогда
        
        КоличествоОбработанных = 0;
        ПризнатьИсправитьПроверитьЗакрытьСервер(СписокСсылок, СписокПроектов, СписокВерсий, РезультатДействия, КоличествоОбработанных);
        Элементы.Список.Обновить();
        
        ТекстОповещения = НСтр("ru='Обработано ошибок: %Количество%'");
        ТекстОповещения = СтрЗаменить(ТекстОповещения, "%Количество%", КоличествоОбработанных);
        ПоказатьОповещениеПользователя(НСтр("ru='Признание, исправление, проверка, закрытие ошибок'"),,ТекстОповещения, БиблиотекаКартинок.Информация32);
        
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НеПризнаватьОтозватьЗакрыть(Команда)
	
	Если Элементы.Список.ВыделенныеСтроки.Количество()>0 Тогда
		
		СписокСсылок = Новый Массив;
		СписокПроектов = Новый Массив;
		
		Для Каждого Строка из Элементы.Список.ВыделенныеСтроки Цикл
			
			ДанныеСтроки = Элементы.Список.ДанныеСтроки(Строка);
			
			Если (ДанныеСтроки.Статус = ПредопределенноеЗначение("Перечисление.СтатусыОшибок.Зарегистрирована")
				ИЛИ ДанныеСтроки.Статус = ПредопределенноеЗначение("Перечисление.СтатусыОшибок.НеПризнана")
				ИЛИ ДанныеСтроки.Статус = ПредопределенноеЗначение("Перечисление.СтатусыОшибок.Отозвана"))
				И НЕ ДанныеСтроки.ПометкаУдаления Тогда
				
				СписокСсылок.Добавить(Строка);
				
				Если СписокПроектов.Найти(ДанныеСтроки.Владелец) = Неопределено Тогда
					СписокПроектов.Добавить(ДанныеСтроки.Владелец);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		Если СписокСсылок.Количество()=0 Тогда
			Возврат;
		КонецЕсли;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("СписокСсылок", СписокСсылок);
		ДопПараметры.Вставить("СписокПроектов", СписокПроектов);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("НеПризнаватьОтозватьЗакрытьЗавершение", ЭтотОбъект, ДопПараметры);
		ОткрытьФорму("Справочник.Ошибки.Форма.НеПризнаватьОтозватьЗакрыть",, ЭтаФорма,,,, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НеПланируетсяИсправлять(Команда)
	
	Если Элементы.Список.ВыделенныеСтроки.Количество()>0 Тогда
		
		МассивСсылок = Новый Массив;
		
		Для Каждого Строка из Элементы.Список.ВыделенныеСтроки Цикл
			
			ДанныеСтроки = Элементы.Список.ДанныеСтроки(Строка);
			
			Если ДанныеСтроки.Статус = ПредопределенноеЗначение("Перечисление.СтатусыОшибок.Признана") Тогда
				МассивСсылок.Добавить(Строка);
			КонецЕсли;
		КонецЦикла;
		
		Если МассивСсылок.Количество()=0 Тогда
			Возврат;
		КонецЕсли;
		
		Структура = Новый Структура("МассивСсылок", МассивСсылок);
		ОписаниеОповещения = Новый ОписаниеОповещения("НеПланируетсяИсправлятьЗавершение", ЭтотОбъект, Структура);
		ОткрытьФорму("Справочник.Ошибки.Форма.НеПланируетсяИсправлять",, ЭтаФорма,,,, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НеПланируетсяИсправлятьЗавершение(РезультатДействия, ДополнительныеПараметры) Экспорт
    
    МассивСсылок = ДополнительныеПараметры.МассивСсылок;
    
    Результат = РезультатДействия;
    
    Если ТипЗнч(Результат) = Тип("Структура") Тогда
        
        КоличествоОбработанных = 0;
        НеПланируетсяИсправлятьСервер(МассивСсылок, Результат.КомуНаправлена, Результат.Комментарий, КоличествоОбработанных);
        Элементы.Список.Обновить();
        
        ТекстОповещения = НСтр("ru='Не планируется исправлять ошибок: %Количество%'");
        ТекстОповещения = СтрЗаменить(ТекстОповещения, "%Количество%", КоличествоОбработанных);
        ПоказатьОповещениеПользователя(НСтр("ru='Не планируется исправление ошибок'"),,ТекстОповещения, БиблиотекаКартинок.Информация32);
        
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НеПризнаватьОтозватьЗакрытьЗавершение(РезультатДействия, ДополнительныеПараметры) Экспорт
    
    СписокСсылок = ДополнительныеПараметры.СписокСсылок;
	СписокПроектов = ДополнительныеПараметры.СписокПроектов;
    
    Если ТипЗнч(РезультатДействия) = Тип("Структура") Тогда
        
        КоличествоОбработанных = 0;
        НеПризнаватьОтозватьЗакрытьСервер(СписокСсылок, СписокПроектов, РезультатДействия, КоличествоОбработанных);
        Элементы.Список.Обновить();
        
        ТекстОповещения = НСтр("ru='Обработано ошибок: %Количество%'");
        ТекстОповещения = СтрЗаменить(ТекстОповещения, "%Количество%", КоличествоОбработанных);
        ПоказатьОповещениеПользователя(НСтр("ru='Непризнание, отзыв, закрытие ошибок'"),,ТекстОповещения, БиблиотекаКартинок.Информация32);
        
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НазначитьВерсиюИсправления(Команда)
	
	МассивСсылок = Новый Массив;
	
	Если Элементы.Список.ВыделенныеСтроки.Количество()>0 Тогда
		
		Для Каждого Строка из Элементы.Список.ВыделенныеСтроки Цикл
			МассивСсылок.Добавить(Строка);
		КонецЦикла;
		
	КонецЕсли;
		
	Если МассивСсылок.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	ПолеОтбораВладелец = Новый ПолеКомпоновкиДанных("Владелец");
	
	Проект = ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");
	
	Для Каждого ЭлементОтбора из Список.Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если ЭлементОтбора.ЛевоеЗначение = ПолеОтбораВладелец
				И ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				И ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СправочникСсылка.Проекты") Тогда
				
				Проект = ЭлементОтбора.ПравоеЗначение;
				
				Прервать;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ПометкаУдаления", Ложь);
	
	Если ЗначениеЗаполнено(Проект) Тогда
		СтруктураОтбора.Вставить("Владелец", Проект);
	КонецЕсли;
	
	ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
	
	Структура = Новый Структура("МассивСсылок", МассивСсылок);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НазначитьВерсиюИсправленияЗавершение", ЭтотОбъект, Структура);
	ОткрытьФорму("Справочник.ВерсииПроекта.ФормаВыбора",
				 ПараметрыФормы,
				 ЭтаФорма,
				 ,
				 ,
				 ,
				 ОписаниеОповещения,
				 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьВерсиюИсправленияЗавершение(РезультатДействия, ДополнительныеПараметры) Экспорт
	
	УказаннаяВерсияИсправления = РезультатДействия;
	
	МассивСсылок = ДополнительныеПараметры.МассивСсылок;
	
	Если ЗначениеЗаполнено(УказаннаяВерсияИсправления) Тогда
		
		КоличествоОбработанных = 0;
		НазначитьВерсиюИсправленияСервер(МассивСсылок, УказаннаяВерсияИсправления, КоличествоОбработанных);
		
		Элементы.Список.Обновить();
			
		ТекстОповещения = НСтр("ru='Назначена версия исправления для ошибок: %Количество%'");
		ТекстОповещения = СтрЗаменить(ТекстОповещения, "%Количество%", КоличествоОбработанных);
		ПоказатьОповещениеПользователя(НСтр("ru='Назначение версии исправления'"),,ТекстОповещения, БиблиотекаКартинок.Информация32);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОшибкуВВетке(Команда)
	
	ТекущиеДанные = Элементы.СписокОшибокВВетках.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", Элементы.СписокОшибокВВетках.ТекущиеДанные.Ссылка);
	ОткрытьФорму("Справочник.Ошибки.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВеткуДляИсправленияОшибок(Команда)
	
	ОчиститьСообщения();
	Результат = ПроверитьВозможностьУказанияОднойВеткиИсправления();
	Если Результат <> Неопределено И Результат.Ошибки.Количество() > 0 Тогда
		
		ПараметрыОповещения = Новый Структура("Ошибки", Результат.Ошибки);
		ОписаниеОповещения = Новый ОписаниеОповещения("УказатьВеткуИсправленияЗавершение", ЭтотОбъект, ПараметрыОповещения);

		ЗначениеЗаполнения = Новый Структура("РазрабатываемыйОбъект, Источник", Результат.Ошибки[0], Результат.Ветка);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения, РежимВыбора", ЗначениеЗаполнения, Истина);
		ОткрытьФорму(
			"Справочник.Ветки.ФормаОбъекта",
			ПараметрыФормы, 
			,
			Истина,,,ОписаниеОповещения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВеткуДляИсправленияОшибок(Команда)
	
	ОчиститьСообщения();
	Результат = ПроверитьВозможностьУказанияОднойВеткиИсправления();
	Если Результат <> Неопределено И Результат.Ошибки.Количество() > 0 Тогда
		
		ПараметрыОповещения = Новый Структура("Ошибки", Результат.Ошибки);
		ОписаниеОповещения = Новый ОписаниеОповещения("УказатьВеткуИсправленияЗавершение", ЭтотОбъект, ПараметрыОповещения);
	
		Отбор = Новый Структура("Владелец", Результат.Владелец);
		ПараметрыФормы = Новый Структура("РежимВыбора, ЗакрыватьПриВыборе, Отбор, ВеткаДляИсправления", 
										 Истина, Истина, Отбор, Результат.Ветка);

		ОткрытьФорму(
			"Справочник.Ветки.ФормаВыбора",
			ПараметрыФормы, 
			,
			Истина,,,ОписаниеОповещения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеОтметкиСпискаВерсийИсправленияДляСпискаОшибок(Команда)
	
	Для Каждого СтрокаТаблицы из СписокВерсийИсправленияДляСпискаОшибок Цикл
		СтрокаТаблицы.Пометка = Истина;
	КонецЦикла;
	
	УстановитьОтборСпискаОшибокПоВерсииИсправления();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметкиСпискаВерсийИсправленияДляСпискаОшибок(Команда)
	
	Для Каждого СтрокаТаблицы из СписокВерсийИсправленияДляСпискаОшибок Цикл
		СтрокаТаблицы.Пометка = Ложь;
	КонецЦикла;
	
	УстановитьОтборСпискаОшибокПоВерсииИсправления();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеОтметкиСпискаОтбораПоРелизнымВеткамСпискаОшибокВВетках(Команда)
	
	Для Каждого СтрокаТаблицы из СписокОтбораПоРелизнымВеткамСпискаОшибокВВетках Цикл
		СтрокаТаблицы.Пометка = Истина;
	КонецЦикла;
	
	УстановитьОтборСпискаОшибокВВеткахПоРелизнымВеткам();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметкиСпискаОтбораПоРелизнымВеткамСпискаОшибокВВетках(Команда)
	
	Для Каждого СтрокаТаблицы из СписокОтбораПоРелизнымВеткамСпискаОшибокВВетках Цикл
		СтрокаТаблицы.Пометка = Ложь;
	КонецЦикла;
	
	УстановитьОтборСпискаОшибокВВеткахПоРелизнымВеткам();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьАктуальныеВерсииИсправленияДляОтбораСпискаОшибок(Команда)
	
	Если ЗначениеЗаполнено(Проект) Тогда
		ВыбранныеПроекты = Новый Массив;
		ВыбранныеПроекты.Добавить(Проект);
		ПодобратьАктуальныеВерсииПроектовУстановитьОтборОшибокВВетках(ВыбранныеПроекты);
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодобратьАктуальныеВерсииИсправленияДляОтбораСпискаОшибокЗавершение", ЭтотОбъект);
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
		ПараметрыОткрытия.Вставить("МножественныйВыбор", Истина);
		
		ОткрытьФорму("Справочник.Проекты.ФормаВыбора", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьАктуальныеВеткиДляОтбораСпискаОшибокВВетках(Команда)
	
	Если ЗначениеЗаполнено(Проект) Тогда
		ВыбранныеПроекты = Новый Массив;
		ВыбранныеПроекты.Добавить(Проект);
		ПодобратьАктуальныеВеткиПроектовУстановитьОтборОшибокВВетках(ВыбранныеПроекты);
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодобратьАктуальныеВеткиДляОтбораСпискаОшибокВВеткахЗавершение", ЭтотОбъект);
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
		ПараметрыОткрытия.Вставить("МножественныйВыбор", Истина);
		
		ОткрытьФорму("Справочник.Проекты.ФормаВыбора", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтаФорма, Элементы.Список);
	
КонецПроцедуры
//Конец ИнтеграцияС1СДокументооборотом

// ОбъектыНаКонтроле
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПостановкиНаКонтроль(Команда)
	
	ОбъектыНаКонтролеКлиент.ВыполнитьКомандуПостановкиНаКонтрольИзФормыСписка(ЭтотОбъект, Команда);
	
КонецПроцедуры
// Конец ОбъектыНаКонтроле

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаДействийСОшибками

&НаКлиенте
Процедура ОбработатьДействиеСОшибкой(ДействияСОшибкой, Ссылка)
	
	Если ДействияСОшибкой = "Зарегистрировать" Тогда
		
		ПараметрыФормы = Новый Структура("Ключ", Ссылка);
		ПараметрыФормы.Вставить("ДействиеСОшибкой", "Регистрация");
		
		ОткрытьФорму("Справочник.Ошибки.Форма.ПомощникРегистрацииИОбработкиОшибки", ПараметрыФормы, ЭтаФорма);
		
	ИначеЕсли ДействияСОшибкой = "Признать" Тогда
		
		ПараметрыФормы = Новый Структура("Ключ", Ссылка);
		ПараметрыФормы.Вставить("ДействиеСОшибкой", "Признание");
		
		ОткрытьФорму("Справочник.Ошибки.Форма.ПомощникРегистрацииИОбработкиОшибки", ПараметрыФормы, ЭтаФорма);
		
	ИначеЕсли ДействияСОшибкой = "Исправить" Тогда
		
		ПараметрыФормы = Новый Структура("Ключ", Ссылка);
		ПараметрыФормы.Вставить("ДействиеСОшибкой", "Исправление");
		
		ОткрытьФорму("Справочник.Ошибки.Форма.ПомощникРегистрацииИОбработкиОшибки", ПараметрыФормы, ЭтаФорма);
		
	ИначеЕсли ДействияСОшибкой = "Отозвать" Тогда
		
		ПараметрыФормы = Новый Структура("Ошибка", Ссылка);
		ОткрытьФорму("Справочник.Ошибки.Форма.ОтзывОшибки", ПараметрыФормы, ЭтаФорма);
		
	ИначеЕсли ДействияСОшибкой = "Подтвердить исправление" Тогда
		
		ПараметрыФормы = Новый Структура("Ключ", Ссылка);
		ПараметрыФормы.Вставить("ДействиеСОшибкой", "ПодтверждениеИсправления");
		
		ОткрытьФорму("Справочник.Ошибки.Форма.ПомощникРегистрацииИОбработкиОшибки", ПараметрыФормы, ЭтаФорма);
		
	ИначеЕсли ДействияСОшибкой = "Закрыть" Тогда
		
		ПараметрыФормы = Новый Структура("Ключ", Ссылка);
		ПараметрыФормы.Вставить("ДействиеСОшибкой", "Закрытие");
		
		ОткрытьФорму("Справочник.Ошибки.Форма.ПомощникРегистрацииИОбработкиОшибки", ПараметрыФормы, ЭтаФорма);
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПеренаправитьСервер(МассивСсылок, КомуНаправлена, Комментарий, КоличествоОбработанных)
	
	Справочники.Ошибки.Перенаправить(МассивСсылок, КомуНаправлена, 
								Комментарий, КоличествоОбработанных);
	
КонецПроцедуры

&НаСервере
Процедура ВернутьСервер(Ошибка, КомуНаправлена, Комментарий)
				
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(Ошибка);
	
	Справочники.Ошибки.Вернуть(МассивСсылок, КомуНаправлена, Комментарий);
				
КонецПроцедуры

&НаСервере
Процедура ОзнакомитьсяСервер(МассивСсылок, КоличествоОбработанных)
	
	Справочники.Ошибки.Ознакомиться(МассивСсылок, КоличествоОбработанных);
	
КонецПроцедуры

&НаСервере
Процедура НеПланируетсяИсправлятьСервер(МассивСсылок, КомуНаправлена, Комментарий, КоличествоОбработанных)
	
	Справочники.Ошибки.НеПланируетсяИсправлять(МассивСсылок, КомуНаправлена, 
								Комментарий, КоличествоОбработанных);
	
КонецПроцедуры
							
&НаСервере
Процедура ПризнатьИсправитьПроверитьЗакрытьСервер(СписокСсылок, СписокПроектов, СписокВерсий, ДанныеИДействиядляОбработки, КоличествоОбработанных)
	
	Справочники.Ошибки.ПризнатьИсправитьПроверитьЗакрыть(СписокСсылок, СписокПроектов, СписокВерсий, ДанныеИДействиядляОбработки, КоличествоОбработанных);
	
КонецПроцедуры

&НаСервере
Процедура НеПризнаватьОтозватьЗакрытьСервер(СписокСсылок, СписокПроектов, ДанныеИДействиядляОбработки, КоличествоОбработанных)
	
	Справочники.Ошибки.НеПризнаватьОтозватьЗакрыть(СписокСсылок, СписокПроектов, ДанныеИДействиядляОбработки, КоличествоОбработанных);
	
КонецПроцедуры

&НаСервере
Процедура НазначитьВерсиюИсправленияСервер(МассивСсылок, ВерсияИсправления, КоличествоОбработанных)
	
	Справочники.Ошибки.НазначитьВерсиюИсправления(МассивСсылок, ВерсияИсправления, КоличествоОбработанных);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УстановитьОтборПоПроектуСервер()
	
	Проект = ПараметрыСеанса.ТекущийПроект;
	УстановитьПараметрыВыбораСпискаВерсийИсправленияСпискаОшибок(Проект);
	УстановитьПараметрыВыбораСпискаРелизныхВетокСпискаОшибокВВетках(Проект);
	
	Проекты.УстановитьОтборВСпискеПоПроекту(Список, Проект);
	Проекты.УстановитьОтборВСпискеПоПроекту(СписокОшибокВВетках, Проект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	Если Элементы.Найти("СписокКонтекстноеМенюПризнатьИсправитьПроверитьЗакрыть") <> Неопределено Тогда
		Элементы.СписокКонтекстноеМенюПризнатьИсправитьПроверитьЗакрыть.Видимость = ДоступноИзменениеОшибок;
	КонецЕсли;
	
	Если Элементы.Найти("СписокКонтекстноеМенюНеПризнаватьОтозватьЗакрыть") <> Неопределено Тогда
		Элементы.СписокКонтекстноеМенюНеПризнаватьОтозватьЗакрыть.Видимость = ДоступноИзменениеОшибок;
	КонецЕсли;

	Если Элементы.Найти("СписокКонтекстноеМенюНеПланируетсяИсправлять") <> Неопределено Тогда
		Элементы.СписокКонтекстноеМенюНеПланируетсяИсправлять.Видимость = ДоступноПланированиеОтработки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностьУказанияОднойВеткиИсправления()
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() < 0 Тогда
		Возврат Неопределено; 
	КонецЕсли;
	ВеткиВКоторыхТребуетсяИсправление = Новый Массив;
	Ошибки = Новый Массив;

	Для Каждого Строка из Элементы.Список.ВыделенныеСтроки Цикл
		Если Строка.Исправляется 
			= ПредопределенноеЗначение("Перечисление.ВариантыИсправленияОшибок.ВРазныхВетках") Тогда
			Для Каждого СтрокаИсправлениеВВетках Из Строка.ИсправлениеВВетках Цикл
				Если СтрокаИсправлениеВВетках.СостояниеИсправления = Перечисления.СостоянияИсправленияОшибок.ТребуетсяИсправление 
					И НЕ ЗначениеЗаполнено(СтрокаИсправлениеВВетках.ВеткаИсправления) Тогда
					Если ВеткиВКоторыхТребуетсяИсправление.Найти(СтрокаИсправлениеВВетках.Ветка) = Неопределено Тогда
						ВеткиВКоторыхТребуетсяИсправление.Добавить(СтрокаИсправлениеВВетках.Ветка);
					КонецЕсли;
					Если Ошибки.Найти(Строка) = Неопределено Тогда
						Ошибки.Добавить(Строка);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Если ВеткиВКоторыхТребуетсяИсправление.Количество() > 1 Тогда
		СтрокаСоСпискомВеток = СтрСоединить(ВеткиВКоторыхТребуетсяИсправление, "; ");
		ТекстСообщения = СтрШаблон(НСтр("ru='Нельзя указать одну ветку для исправления, в выделенных ошибках требуется исправление в нескольких ветках: %1.'"), 
								   СтрокаСоСпискомВеток);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;

	Если Ошибки.Количество() = 0 ИЛИ ВеткиВКоторыхТребуетсяИсправление.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Не найдено ни одной ошибки, где требуется указать ветку исправления (ветки уже заполнены или указано, что исправление не требуется).'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	Ветка = ВеткиВКоторыхТребуетсяИсправление[0];
	Результат = Новый Структура("Ошибки, Ветка, Владелец", Ошибки, Ветка, Ветка.Владелец);
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура УказатьВеткуИсправленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("СправочникСсылка.Ветки") Тогда
		КоличествоУспешных = 0;
		УказатьВеткуИсправленияСервер(ДополнительныеПараметры.Ошибки, Результат, КоличествоУспешных);
		
		ТекстОповещения = НСтр("ru='""%Ветка%"" указана у ошибок: %Количество%'");
		ТекстОповещения = СтрЗаменить(ТекстОповещения, "%Количество%", КоличествоУспешных);
		ТекстОповещения = СтрЗаменить(ТекстОповещения, "%Ветка%", Результат);
		ПоказатьОповещениеПользователя(НСтр("ru='Заполнение ветки исправления'"),,ТекстОповещения, БиблиотекаКартинок.Информация32);

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УказатьВеткуИсправленияСервер(Ошибки, Ветка, КоличествоУспешных)
	
	Для Каждого Ошибка Из Ошибки Цикл
		Попытка
			ОшибкаОбъект = Ошибка.ПолучитьОбъект();
			Для Каждого СтрокаИсправлениеВВетках Из ОшибкаОбъект.ИсправлениеВВетках Цикл
				Если СтрокаИсправлениеВВетках.СостояниеИсправления = Перечисления.СостоянияИсправленияОшибок.ТребуетсяИсправление 
					
					И НЕ ЗначениеЗаполнено(СтрокаИсправлениеВВетках.ВеткаИсправления) Тогда
					СтрокаИсправлениеВВетках.ВеткаИсправления = Ветка;
				КонецЕсли;
			КонецЦикла;
			ОшибкаОбъект.Записать();
			КоличествоУспешных = КоличествоУспешных + 1;
		Исключение
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru='Не удалось указать ветку исправления ""%1"" в ошибке %2.'"), Ветка, Ошибка.Код);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#Область ОтборыСпискаОшибок

&НаСервере
Процедура УстановитьОтборСпискаОшибокПоСтатусу()
	
	Если ВариантОтбораПоСтатусуСпискаОшибок = 0 Тогда
		// Все, т.е. без отбора
		ВсеСтатусы = Новый СписокЗначений;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"Статус",
																			ВсеСтатусы,
																			ВидСравненияКомпоновкиДанных.ВСписке,
																			,
																			Ложь);
																			
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"Исправлена",
																			Ложь,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			Ложь);
																			
	ИначеЕсли ВариантОтбораПоСтатусуСпискаОшибок = 1 Тогда
		// В работе
		СтатусыВРаботе = Новый СписокЗначений;
		СтатусыВРаботе.Добавить(Перечисления.СтатусыОшибок.НеЗарегистрирована);
		СтатусыВРаботе.Добавить(Перечисления.СтатусыОшибок.Зарегистрирована);
		СтатусыВРаботе.Добавить(Перечисления.СтатусыОшибок.Признана);
		СтатусыВРаботе.Добавить(Перечисления.СтатусыОшибок.НеПризнана);
		СтатусыВРаботе.Добавить(Перечисления.СтатусыОшибок.Исправлена);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"Статус",
																			СтатусыВРаботе,
																			ВидСравненияКомпоновкиДанных.ВСписке,
																			,
																			Истина);
																			
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"Исправлена",
																			Ложь,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			Ложь);
																			
	ИначеЕсли ВариантОтбораПоСтатусуСпискаОшибок = 2 Тогда
		// Исправленные
		СтатусыИсправлена = Новый СписокЗначений;
		СтатусыИсправлена.Добавить(Перечисления.СтатусыОшибок.Исправлена);
		СтатусыИсправлена.Добавить(Перечисления.СтатусыОшибок.ПроверенаИсправлена);
		СтатусыИсправлена.Добавить(Перечисления.СтатусыОшибок.Закрыта);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"Статус",
																			СтатусыИсправлена,
																			ВидСравненияКомпоновкиДанных.ВСписке,
																			,
																			Истина);
																			
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"Исправлена",
																			Истина,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			Истина);
	ИначеЕсли ВариантОтбораПоСтатусуСпискаОшибок = 3 Тогда
		// Иное
		ИспользоватьОтбор = СписокОтбораПоСтатусамСпискаОшибок.Количество()>0;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			    "Статус",
		                                                                        СписокОтбораПоСтатусамСпискаОшибок,
																				ВидСравненияКомпоновкиДанных.ВСписке,
																				,
																				ИспользоватьОтбор);
																				
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"Исправлена",
																			Ложь,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			Ложь);
																			
	КонецЕсли;
																		
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаОшибокПоСрочностиИсправления()
	
	СписокСрочностьИсправления = Новый СписокЗначений;
	
	Если СрочностьНемедленноДляСпискаОшибок Тогда
		СписокСрочностьИсправления.Добавить(Перечисления.СрочностьИсправленияОшибок.Немедленно);
	КонецЕсли;
	
	Если СрочностьЖелательноБыстрееДляСпискаОшибок Тогда
		СписокСрочностьИсправления.Добавить(Перечисления.СрочностьИсправленияОшибок.ЖелательноБыстрее);
	КонецЕсли;
	
	Если СрочностьВПлановомПорядкеДляСпискаОшибок Тогда
		СписокСрочностьИсправления.Добавить(Перечисления.СрочностьИсправленияОшибок.ВПлановомПорядке);
	КонецЕсли;
	
	ИспользоватьОтбор = СписокСрочностьИсправления.Количество()>0;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"СрочностьИсправления",
																			СписокСрочностьИсправления,
																			ВидСравненияКомпоновкиДанных.ВСписке,
																			,
																			ИспользоватьОтбор);
	
КонецПроцедуры
																		
&НаСервере
Процедура УстановитьОтборСпискаОшибокПоВерсииИсправления()
	
	СписокВерсий = Новый СписокЗначений;
	Для Каждого ЭлементСписка из СписокВерсийИсправленияДляСпискаОшибок Цикл
		Если ЭлементСписка.Пометка Тогда
			СписокВерсий.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"ВерсияИсправления",
																			СписокВерсий,
																			ВидСравненияКомпоновкиДанных.ВСписке,
																			,
																			СписокВерсий.Количество()>0);
	
КонецПроцедуры																		

&НаСервере
Процедура ПриИзмененииВариантаОтбораСпискаОшибокПоСтатусу()

	УстановитьДоступностьЭлементовОтбораСпискаОшибокПоСтатусу();
	УстановитьОтборСпискаОшибокПоСтатусу();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииВариантаОтбораСпискаОшибокПоСтатусуИное()

	УстановитьДоступностьЭлементовОтбораСпискаОшибокПоСтатусу();
	УстановитьОтборСпискаОшибокПоСтатусу();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаОшибокПоКомуНаправленаПользователь()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"КомуНаправлена",
																			НаправленаПользовательСпискаОшибок,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ЗначениеЗаполнено(НаправленаПользовательСпискаОшибок));
																			
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаОшибокПоКомуНаправленаПодразделение()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"ПодразделениеКомуНаправлена",
																			НаправленаПодразделениеСпискаОшибок,
																			ВидСравненияКомпоновкиДанных.ВИерархии,
																			,
																			ЗначениеЗаполнено(НаправленаПодразделениеСпискаОшибок));
																			
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаОшибокПоМестуОбнаружения()
	
	ГруппаИЛИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы,
																			НСтр("ru='Отбор по месту обнаружения'"),
																			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ);
																			
	ГруппаИЛИ.Использование = ОбнаруженаВСборкахДляСпискаОшибок
	                          ИЛИ ОбнаруженаВОсновнойВеткеДляСпискаОшибок
							  ИЛИ ОбнаруженаВВеткахВерсийДляСпискаОшибок
							  ИЛИ ОбнаруженаВПрочихВеткахДляСпискаОшибок;
																			
	СписокМестОбнаружения = Новый СписокЗначений;
	
	Если ОбнаруженаВСборкахДляСпискаОшибок Тогда
		СписокМестОбнаружения.Добавить(Перечисления.МестаОбнаруженияОшибок.ВСборке);
	КонецЕсли;
	
	Если ОбнаруженаВОсновнойВеткеДляСпискаОшибок
		ИЛИ ОбнаруженаВВеткахВерсийДляСпискаОшибок
		ИЛИ ОбнаруженаВПрочихВеткахДляСпискаОшибок Тогда
		СписокМестОбнаружения.Добавить(Перечисления.МестаОбнаруженияОшибок.ВВетке);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"МестоОбнаружения",
																			СписокМестОбнаружения,
																			ВидСравненияКомпоновкиДанных.ВСписке,
																			,
																			СписокМестОбнаружения.Количество()>0);
																			
	ТипыВетокОбнаружения = Новый СписокЗначений;
	
	Если ОбнаруженаВОсновнойВеткеДляСпискаОшибок Тогда
		ТипыВетокОбнаружения.Добавить(Перечисления.ТипыВеток.ОсновнаяВеткаПроекта);
	КонецЕсли;
	
	Если ОбнаруженаВВеткахВерсийДляСпискаОшибок Тогда
		ТипыВетокОбнаружения.Добавить(Перечисления.ТипыВеток.ВеткаВерсии);
	КонецЕсли;
	
	Если ОбнаруженаВПрочихВеткахДляСпискаОшибок Тогда
		ТипыВетокОбнаружения.Добавить(Перечисления.ТипыВеток.ВеткаДляИсправленияОшибок);
		ТипыВетокОбнаружения.Добавить(Перечисления.ТипыВеток.ВеткаТехническогоПроекта);
	КонецЕсли;
																			
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ,
	                                                       "МестоОбнаружения",
	                                                       ВидСравненияКомпоновкиДанных.Равно,
														   Перечисления.МестаОбнаруженияОшибок.ВСборке,
														   ,
														   ОбнаруженаВСборкахДляСпискаОшибок);
														   
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ,
	                                                       "ТипВеткиОбнаружения",
	                                                       ВидСравненияКомпоновкиДанных.ВСписке,
														   ТипыВетокОбнаружения,
														   ,
														   ТипыВетокОбнаружения.Количество()>0);
																			
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаОшибокПоИсточнику()
	
	ГруппаИЛИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы,
																			НСтр("ru='Отбор по источнику'"),
																			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ);
																			
	ГруппаИЛИ.Использование = ИсточникВнешнийСпискаОшибок
	                          ИЛИ ИсточникРучноеТестированиеСпискаОшибок
							  ИЛИ ИсточникАвтотестыСпискаОшибок;
							  
	ГруппаИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ГруппаИЛИ,
																		НСтр("ru='Отбор по методу выявления'"),
																		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
																			
	ГруппаИ.Использование = ИсточникРучноеТестированиеСпискаОшибок
							ИЛИ ИсточникАвтотестыСпискаОшибок;
							
	СписокМетодовВыявления = Новый СписокЗначений;
	
	Если ИсточникРучноеТестированиеСпискаОшибок Тогда
		СписокМетодовВыявления.Добавить(Перечисления.МетодыВыявленияОшибок.АудитКода);
		СписокМетодовВыявления.Добавить(Перечисления.МетодыВыявленияОшибок.РаботаСПрограммой);
	КонецЕсли;
	
	Если ИсточникАвтотестыСпискаОшибок Тогда
		СписокМетодовВыявления.Добавить(Перечисления.МетодыВыявленияОшибок.Автотесты);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИ,
	                                                       "МетодВыявленияОшибки",
	                                                       ВидСравненияКомпоновкиДанных.ВСписке,
														   СписокМетодовВыявления,
														   ,
														   СписокМетодовВыявления.Количество()>0);
														   
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИ,
	                                                       "ОшибкаЗарегистрированаПоИнформацииОтВнешнихИсточников",
	                                                       ВидСравненияКомпоновкиДанных.Равно,
														   Ложь,
														   ,
														   СписокМетодовВыявления.Количество()>0);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ,
	                                                       "ОшибкаЗарегистрированаПоИнформацииОтВнешнихИсточников",
	                                                       ВидСравненияКомпоновкиДанных.Равно,
														   Истина,
														   ,
														   ИсточникВнешнийСпискаОшибок);
	
																			
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаОшибокПоОтработал(ЗначениеКтоОтработал, ПостфиксПоляДействия="")
	
	Если ПостфиксПоляДействия = "Подразделение" Тогда
		ВидСравненияОтработал = ВидСравненияКОмпоновкиДанных.ВИерархии;
	Иначе
		ВидСравненияОтработал = ВидСравненияКОмпоновкиДанных.Равно;
	КонецЕсли;
	
	СписокДействийОтработал = СписокОтбораОтработал();
	
	Для Каждого Действие из СписокДействийОтработал Цикл
		
		ИспользоватьОтборПоДействию = Ложь;
		
		Если ЗначениеЗаполнено(ЗначениеКтоОтработал) Тогда
			ЭлементСпискаОтбора = СписокОтбораОтработалСпискаОшибок.НайтиПоЗначению(Действие);
			Если ЭлементСпискаОтбора <> Неопределено Тогда
				ИспользоватьОтборПоДействию = Истина;
			КонецЕсли;
		КонецЕсли;
		
		ПолеОтбора = Действие + ПостфиксПоляДействия;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			ПолеОтбора,
																			ЗначениеКтоОтработал,
																			ВидСравненияОтработал,
																			,
																			ИспользоватьОтборПоДействию);
																			
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененнииОтбораСпискаОшибокОтработал()

	УстановитьОтборСпискаОшибокПоОтработал(ОтработалПодразделениеСпискаОшибок, "Подразделение");
	УстановитьОтборСпискаОшибокПоОтработал(ОтработалПользовательСпискаОшибок);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовОтбораСпискаОшибокПоСтатусу()
	
	Элементы.СписокОтбораПоСтатусамСпискаОшибок.Доступность = (ВариантОтбораПоСтатусуСпискаОшибок=3);
	
КонецПроцедуры

#КонецОбласти

#Область ОтборыСпискаОшибокВВетках

&НаСервере
Процедура ПриИзмененииВариантаОтбораСпискаОшибокВВеткахПоСтатусу()

	УстановитьДоступностьЭлементовОтбораСпискаОшибокВВеткахПоСтатусу();
	УстановитьОтборСпискаОшибокВВеткахПоСтатусу();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаОшибокВВеткахПоСтатусу()
	
	Если ВариантОтбораПоСтатусуСпискаОшибокВВетках = 0 Тогда
		// Все, т.е. без отбора
		ВсеСтатусы = Новый СписокЗначений;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокОшибокВВетках,
																			"Статус",
																			ВсеСтатусы,
																			ВидСравненияКомпоновкиДанных.ВСписке,
																			,
																			Ложь);
																			
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокОшибокВВетках,
																			"Исправлена",
																			Ложь,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			Ложь);
																			
	ИначеЕсли ВариантОтбораПоСтатусуСпискаОшибокВВетках = 1 Тогда
		// В работе
		СтатусыВРаботе = Новый СписокЗначений;
		СтатусыВРаботе.Добавить(Перечисления.СтатусыОшибок.НеЗарегистрирована);
		СтатусыВРаботе.Добавить(Перечисления.СтатусыОшибок.Зарегистрирована);
		СтатусыВРаботе.Добавить(Перечисления.СтатусыОшибок.Признана);
		СтатусыВРаботе.Добавить(Перечисления.СтатусыОшибок.НеПризнана);
		СтатусыВРаботе.Добавить(Перечисления.СтатусыОшибок.Исправлена);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокОшибокВВетках,
																			"Статус",
																			СтатусыВРаботе,
																			ВидСравненияКомпоновкиДанных.ВСписке,
																			,
																			Истина);
																			
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокОшибокВВетках,
																			"Исправлена",
																			Ложь,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			Ложь);
																			
	ИначеЕсли ВариантОтбораПоСтатусуСпискаОшибокВВетках = 2 Тогда
		// Исправленные
		СтатусыИсправлена = Новый СписокЗначений;
		СтатусыИсправлена.Добавить(Перечисления.СтатусыОшибок.Исправлена);
		СтатусыИсправлена.Добавить(Перечисления.СтатусыОшибок.ПроверенаИсправлена);
		СтатусыИсправлена.Добавить(Перечисления.СтатусыОшибок.Закрыта);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокОшибокВВетках,
																			"Статус",
																			СтатусыИсправлена,
																			ВидСравненияКомпоновкиДанных.ВСписке,
																			,
																			Истина);
																			
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокОшибокВВетках,
																			"Исправлена",
																			Истина,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			Истина);
	ИначеЕсли ВариантОтбораПоСтатусуСпискаОшибокВВетках = 3 Тогда
		// Иное
		ИспользоватьОтбор = СписокОтбораПоСтатусамСпискаОшибокВВетках.Количество()>0;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокОшибокВВетках,
																			    "Статус",
		                                                                        СписокОтбораПоСтатусамСпискаОшибокВВетках,
																				ВидСравненияКомпоновкиДанных.ВСписке,
																				,
																				ИспользоватьОтбор);
																				
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокОшибокВВетках,
																			"Исправлена",
																			Ложь,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			Ложь);
																			
	КонецЕсли;
																		
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаОшибокВВеткахПоСрочностиИсправления()
	
	СписокСрочностьИсправления = Новый СписокЗначений;
	
	Если СрочностьНемедленноДляСпискаОшибокВВетках Тогда
		СписокСрочностьИсправления.Добавить(Перечисления.СрочностьИсправленияОшибок.Немедленно);
	КонецЕсли;
	
	Если СрочностьЖелательноБыстрееДляСпискаОшибокВВетках Тогда
		СписокСрочностьИсправления.Добавить(Перечисления.СрочностьИсправленияОшибок.ЖелательноБыстрее);
	КонецЕсли;
	
	Если СрочностьВПлановомПорядкеДляСпискаОшибокВВетках Тогда
		СписокСрочностьИсправления.Добавить(Перечисления.СрочностьИсправленияОшибок.ВПлановомПорядке);
	КонецЕсли;
	
	ИспользоватьОтбор = СписокСрочностьИсправления.Количество()>0;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокОшибокВВетках,
																			"СрочностьИсправления",
																			СписокСрочностьИсправления,
																			ВидСравненияКомпоновкиДанных.ВСписке,
																			,
																			ИспользоватьОтбор);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаОшибокВВеткахПоРелизнымВеткам()

	СписокВеток = Новый СписокЗначений;
	Для Каждого ЭлементСписка из СписокОтбораПоРелизнымВеткамСпискаОшибокВВетках Цикл
		Если ЭлементСписка.Пометка И ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда
			СписокВеток.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокОшибокВВетках,
																			"Ветка",
																			СписокВеток,
																			ВидСравненияКомпоновкиДанных.ВСписке,
																			,
																			СписокВеток.Количество()>0);
																			
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаОшибокВВеткахПоСтатусуВеткиИсправления()

	СписокСтатусовВеток = Новый СписокЗначений;
	
	Если ИсправительнаяВеткаСпискаОшибокВВеткахРазрабатывается Тогда
		СписокСтатусовВеток.Добавить(Перечисления.СтатусыВеток.Разрабатывается);
	КонецЕсли;
	
	Если ИсправительнаяВеткаСпискаОшибокВВеткахТестируется Тогда
		СписокСтатусовВеток.Добавить(Перечисления.СтатусыВеток.Тестируется);
	КонецЕсли;
	
	Если ИсправительнаяВеткаСпискаОшибокВВеткахЗаморожена Тогда
		СписокСтатусовВеток.Добавить(Перечисления.СтатусыВеток.Заморожена);
	КонецЕсли;
	
	Если ИсправительнаяВеткаСпискаОшибокВВеткахПомещена Тогда
		СписокСтатусовВеток.Добавить(Перечисления.СтатусыВеток.Помещена);
	КонецЕсли;
	
	Если ИсправительнаяВеткаСпискаОшибокВВеткахНеУказана Тогда
		СписокСтатусовВеток.Добавить(Перечисления.СтатусыВеток.ПустаяСсылка());
	КонецЕсли;
	
	ИспользоватьОтбор = СписокСтатусовВеток.Количество()>0;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокОшибокВВетках,
																			"СтатусВеткиИсправления",
																			СписокСтатусовВеток,
																			ВидСравненияКомпоновкиДанных.ВСписке,
																			,
																			ИспользоватьОтбор);
																			
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаОшибокПоСостояниюИсправления()

	СписокСостояний = Новый СписокЗначений;
	
	Если СостояниеВВеткеТребуетсяИсправление Тогда
		СписокСостояний.Добавить(Перечисления.СостоянияИсправленияОшибок.ТребуетсяИсправление);
	КонецЕсли;
	
	Если СостояниеВВеткеИсправлена Тогда
		СписокСостояний.Добавить(Перечисления.СостоянияИсправленияОшибок.Исправлена);
	КонецЕсли;
	
	Если СостояниеВВеткеНеПланируетсяИсправлять Тогда
		СписокСостояний.Добавить(Перечисления.СостоянияИсправленияОшибок.ИсправлениеНеПланируется);
	КонецЕсли;
	
	Если СостояниеВВеткеОшибкиНеБылоВЭтойВетке Тогда
		СписокСостояний.Добавить(Перечисления.СостоянияИсправленияОшибок.ОшибкиНеБылоВЭтойВетке);
	КонецЕсли;
	
	Если СостояниеВВеткеИсправляетсяВОтдельнойОШибке Тогда
		СписокСостояний.Добавить(Перечисления.СостоянияИсправленияОшибок.ИсправляетсяВОтдельнойОшибке);
	КонецЕсли;
	
	ИспользоватьОтбор = СписокСостояний.Количество()>0;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокОшибокВВетках,
																			"СостояниеИсправления",
																			СписокСостояний,
																			ВидСравненияКомпоновкиДанных.ВСписке,
																			,
																			ИспользоватьОтбор);
																			
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаОшибокВВеткахПоПодразделениюОтветственномуЗаВеткуИсправления()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокОшибокВВетках,
																			"ПодразделениеОтветственноеЗаВеткуИсправления",
																			ОтветственныйПодразделениеСпискаОшибокВВетках,
																			ВидСравненияКомпоновкиДанных.ВИерархии,
																			,
																			ЗначениеЗаполнено(ОтветственныйПодразделениеСпискаОшибокВВетках));
																			
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаОшибокВВеткахПоОтветственномуЗаВеткуИсправления()

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокОшибокВВетках,
																			"ОтветственныйЗаВеткуИсправления",
																			ОтветственныйПользовательСпискаОшибокВВетках,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ЗначениеЗаполнено(ОтветственныйПользовательСпискаОшибокВВетках));
																			
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовОтбораСпискаОшибокВВеткахПоСтатусу()
	
	Элементы.СписокОтбораПоСтатусамСпискаОшибокВВетках.Доступность = (ВариантОтбораПоСтатусуСпискаОшибокВВетках = 3);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция СписокОтбораОтработал()

	СписокДействий = Новый Массив;
	
	СписокДействий.Добавить("Автор");
	СписокДействий.Добавить("Зарегистрировал");
	СписокДействий.Добавить("Рассмотрел");
	СписокДействий.Добавить("Исправил");
	СписокДействий.Добавить("Проверил");
	СписокДействий.Добавить("Отозвал");
	СписокДействий.Добавить("Закрыл");
	СписокДействий.Добавить("НеПланируетИсправлять");
	СписокДействий.Добавить("УстановилОжидаетИсправленияПовторяемой");
	
	Возврат СписокДействий;
	
КонецФункции

&НаСервере
Процедура УстановитьПараметрыВыбораСпискаВерсийИсправленияСпискаОшибок(Проект)

	ПараметрыВыбораДляПоля = Новый Массив;
	
	Если ЗначениеЗаполнено(Проект) Тогда
		ПараметрВыбораПоПроекту = Новый ПараметрВыбора("Отбор.Владелец", Проект);
		ПараметрыВыбораДляПоля.Добавить(ПараметрВыбораПоПроекту);
	КонецЕсли;
		
	УстанавливаемыеПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораДляПоля);
	Элементы.СписокВерсийИсправленияДляСпискаОшибокЗначение.ПараметрыВыбора = УстанавливаемыеПараметрыВыбора;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораСпискаРелизныхВетокСпискаОшибокВВетках(Проект)
	
	НовыеПараметрыВыбора = Новый Массив;
	
	ТекущиеПараметрыВыбора = Элементы.СписокОтбораПоРелизнымВеткамСпискаОшибокВВеткахЗначение.ПараметрыВыбора;
	
	Для Каждого ТекущийПараметрВыбора из ТекущиеПараметрыВыбора Цикл
		Если ТекущийПараметрВыбора.Имя <> "Отбор.Владелец" Тогда
			НовыеПараметрыВыбора.Добавить(ТекущийПараметрВыбора);
		КонецЕсли;
	КонецЦикла;
			
	Если ЗначениеЗаполнено(Проект) Тогда
		ПараметрВыбораПоПроекту = Новый ПараметрВыбора("Отбор.Владелец", Проект);
		НовыеПараметрыВыбора.Добавить(ПараметрВыбораПоПроекту);
	КонецЕсли;
			
	УстанавливаемыеПараметрыВыбора = Новый ФиксированныйМассив(НовыеПараметрыВыбора);
	Элементы.СписокОтбораПоРелизнымВеткамСпискаОшибокВВеткахЗначение.ПараметрыВыбора = УстанавливаемыеПараметрыВыбора;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьАктуальныеВеткиДляОтбораСпискаОшибокВВеткахЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		ПодобратьАктуальныеВеткиПроектовУстановитьОтборОшибокВВетках(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодобратьАктуальныеВеткиПроектовУстановитьОтборОшибокВВетках(ВыбранныеПроекты)

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ветки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Ветки КАК Ветки
	|ГДЕ
	|	Ветки.Владелец В(&Проекты)
	|	И НЕ Ветки.ПометкаУдаления
	|	И Ветки.Тип В (ЗНАЧЕНИЕ(Перечисление.ТипыВеток.ОсновнаяВеткаПроекта), ЗНАЧЕНИЕ(Перечисление.ТипыВеток.ВеткаВерсии))
	|	И Ветки.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыВеток.Заморожена)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ветки.Владелец"
	;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Проекты", ВыбранныеПроекты);
	
	АктуальныеВетки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	СписокОтбораПоРелизнымВеткамСпискаОшибокВВетках.ЗагрузитьЗначения(АктуальныеВетки);
	СписокОтбораПоРелизнымВеткамСпискаОшибокВВетках.ЗаполнитьПометки(Истина);
	
	УстановитьОтборСпискаОшибокВВеткахПоРелизнымВеткам();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьАктуальныеВерсииИсправленияДляОтбораСпискаОшибокЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		ПодобратьАктуальныеВерсииПроектовУстановитьОтборОшибокВВетках(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодобратьАктуальныеВерсииПроектовУстановитьОтборОшибокВВетках(ВыбранныеПроекты)

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Версии.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВерсииПроекта КАК Версии
	|ГДЕ
	|	Версии.Владелец В(&Проекты)
	|	И НЕ Версии.ПометкаУдаления
	|	И (Версии.ДатаПрекращенияПоддержки = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ Версии.ДатаПрекращенияПоддержки > &ТекущаяДата)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Версии.Владелец,
	|	Версии.ПорядковыйНомер"
	;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Проекты", ВыбранныеПроекты);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	АктуальныеВерсии = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	СписокВерсийИсправленияДляСпискаОшибок.ЗагрузитьЗначения(АктуальныеВерсии);
	СписокВерсийИсправленияДляСпискаОшибок.ЗаполнитьПометки(Истина);
	
	УстановитьОтборСпискаОшибокПоВерсииИсправления();
	
КонецПроцедуры

#КонецОбласти
