#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ОтображаемаяДата) Тогда
		ОтображаемаяДата = Параметры.ОтображаемаяДата;
	Иначе
		ОтображаемаяДата = ТекущаяДата();
	КонецЕсли;
	
	Элементы.Календарь.ВыделенныеДаты.Очистить();
	Элементы.Календарь.ВыделенныеДаты.Добавить(ОтображаемаяДата);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КалендарьПриИзменении(Элемент)
	
	Закрыть(ОтображаемаяДата);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть(ОтображаемаяДата);
	
КонецПроцедуры

#КонецОбласти