#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПараметры() Экспорт
	
	Результат = Новый Структура("ИмяПользователя, ПарольПользователя", "", "");
	Параметры = Константы.ПараметрыПодключенияАПК.Получить().Получить();
	
	Если ЗначениеЗаполнено(Параметры) Тогда
		ЗаполнитьЗначенияСвойств(Результат, Параметры);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СохранитьПараметры(ИмяПользователя, ПарольПользователя) Экспорт
	
	Результат = Новый Структура("ИмяПользователя, ПарольПользователя", ИмяПользователя, ПарольПользователя);
	Хранилище = Новый ХранилищеЗначения(Результат);
	
	Константы.ПараметрыПодключенияАПК.Установить(Хранилище);
	
КонецФункции

#КонецОбласти

#КонецЕсли
