
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// Получить ссылку на элемент в котором хранятся расширенные свойства.
	Ключ = ОбщегоНазначенияСППР.СвойстваОбъектаРасширенногоХранения(ПараметрКоманды);
	
	Если Ключ = Неопределено Тогда
		
		ТекстПредупреждения = НСтр("ru = 'Не удалось получить ссылку на свойства объекта расширенного хранения!'");
		ВызватьИсключение(ТекстПредупреждения);
		
		Возврат;
		
	Иначе
		
		ПараметрыФормы = Новый Структура("Ключ", Ключ);
		
		// Получить имя формы объекта которую надо открыть.
		ИмяФормы = ОбщегоНазначенияСППР.ИмяФормыОбъектаРасширенногоХранения(ПараметрКоманды);
		
		ОткрытьФорму(
			ИмяФормы,
			ПараметрыФормы, 
			ПараметрыВыполненияКоманды.Источник, 
			ПараметрыВыполненияКоманды.Уникальность, 
			ПараметрыВыполненияКоманды.Окно
		);
		
	КонецЕсли;
	
КонецПроцедуры