#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВариантОбработки = "ОставитьБезИзменений";
	
	Для Каждого ЭлементСписка из Параметры.СписокДействий ЦИкл
		СписокДействий.Добавить(ЭлементСписка.Значение);
	КонецЦикла;
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ВариантОбработки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.ВариантОбработкиСократитьВремя.Видимость =
		(СписокДействий.НайтиПоЗначению("СократитьВремяПересекающихсяЭлементов") <> Неопределено);
		
	Элементы.ВариантОбработкиСдвинутьПоследующие.Видимость =
		(СписокДействий.НайтиПоЗначению("СдвинутьПоследующиеЭлементы") <> Неопределено);
		
	Элементы.ВариантОбработкиПоместитьМежду.Видимость =
		(СписокДействий.НайтиПоЗначению("РазместитьТекущийМеждуДругими") <> Неопределено);
		
КонецПроцедуры

#КонецОбласти
