
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РазделПроекта", ПараметрКоманды);
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "МетаданныеРазделаПроекта");
	
	ОткрытьФорму("Справочник.ОбъектыМетаданных.ФормаСписка",
					ПараметрыФормы,
					ПараметрыВыполненияКоманды.Источник,
					ПараметрыВыполненияКоманды.Уникальность,
					ПараметрыВыполненияКоманды.Окно,
					ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
