#Область ОбработчикиСобытийТаблицыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если Поле.Имя = "Тест" Тогда
		Структура = Новый Структура;
		Структура.Вставить("Ключ",Элемент.ТекущиеДанные.Тест);
		
		Если ТипЗнч(Элемент.ТекущиеДанные.Тест) = Тип("СправочникСсылка.НастройкиЗапускаСценариев") Тогда
			ОткрытьФорму("Справочник.НастройкиЗапускаСценариев.ФормаОбъекта",Структура);
		Иначе	
			ОткрытьФорму("Справочник.НастройкиЗапускаПроцессов.ФормаОбъекта",Структура);
		КонецЕсли;	 
	ИначеЕсли Поле.Имя = "Ошибка" ИЛИ Поле.Имя = "Код" Тогда
		Структура = Новый Структура;
		Структура.Вставить("Ключ",Элемент.ТекущиеДанные.Ошибка);
		ОткрытьФорму("Справочник.Ошибки.ФормаОбъекта",Структура);
	ИначеЕсли Поле.Имя = "ЗапускТестированияВетка" Тогда
		Структура = Новый Структура;
		Структура.Вставить("Ключ",Элемент.ТекущиеДанные.ЗапускТестированияВетка);
		ОткрытьФорму("Справочник.Ветки.ФормаОбъекта",Структура); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти