
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СписокОшибок") Тогда
		
		Для Каждого Ошибка Из Параметры.СписокОшибок Цикл
			Строка = ПовторяемыеОшибки.Добавить();
			Строка.Ошибка = Ошибка;
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("СписокОшибок", ПовторяемыеОшибки);
	Закрыть(СтруктураРезультата);
	
КонецПроцедуры

#КонецОбласти
