
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьПереданныеПараметры();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	СтандартнаяОбработка = Ложь;
	
	Для Каждого ЗначениеПодбора Из ВыбранноеЗначение Цикл
		
		Если ТипЗнч(ЗначениеПодбора) <> Тип("СправочникСсылка.ТехническиеПроекты") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПодобранныеТехПроекты.НайтиПоЗначению(ЗначениеПодбора) = Неопределено Тогда
			
			ПодобранныеТехПроекты.Добавить(ЗначениеПодбора);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Закрыть(ПодобранныеТехПроекты);
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВыборГруппИЭлементов", ГруппыИЭлементы.Элементы);
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе",   Ложь);
	ПараметрыОткрытия.Вставить("МножественныйВыбор",   Истина);
	
	ОткрытьФорму("Справочник.ТехническиеПроекты.ФормаВыбора", ПараметрыОткрытия, ЭтотОбъект,
	             ,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьПереданныеПараметры()

	ПодобранныеТехПроекты = Параметры.ОтборТехническиеПроекты;

КонецПроцедуры

#КонецОбласти

