#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
	                                                                        "Ссылка",
	                                                                        Параметры.СписокТехническихПроектов,
																			ВидСравненияКомпоновкиДанных.ВСписке,
																			,
																			Истина);
	 
КонецПроцедуры

#КонецОбласти