
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Список.Параметры.УстановитьЗначениеПараметра("Ссылка", Параметры.ОбъектМетаданных);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.ОбъектМетаданных) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", Элементы.Список.ТекущиеДанные.ОбъектМетаданных);
	ОткрытьФорму("Справочник.ОбъектыМетаданных.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИгнорироватьСсылкиИзРеквизитов(Команда)
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивРеквизитов = Новый Массив();
	Для Каждого Строка из Элементы.Список.ВыделенныеСтроки Цикл
		 МассивРеквизитов.Добавить(Элементы.Список.ДанныеСтроки(Строка).Реквизит);
	КонецЦикла;
		
	ИгнорироватьСсылкиИзРеквизитовСервер(МассивРеквизитов);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИгнорироватьСсылкиИзРеквизитовСервер(МассивРеквизитов)
	
	Для Каждого Реквизит из МассивРеквизитов Цикл
		
		Объект = Реквизит.ПолучитьОбъект();
		
		Попытка
			Объект.Заблокировать();
		Исключение
			СоставноеСообщение = НСтр(" ru= ""Не удалось установить признак для реквизита: %Ссылка% по причине: %ОписаниеОшибки%""; ");
			СоставноеСообщение = СтрЗаменить(СоставноеСообщение, "%Ссылка%", Реквизит);
			СоставноеСообщение = СтрЗаменить(СоставноеСообщение, "%ОписаниеОшибки%", ОписаниеОшибки());
			Сообщить(СоставноеСообщение);
		КонецПопытки;
		
		Попытка
			Объект.ИгнорироватьСсылкиИзРеквизита = Истина;
			Объект.Записать();
			Объект.Разблокировать();
		Исключение
			СоставноеСообщение = НСтр(" ru= ""Не удалось установить признак для реквизита: %Ссылка% по причине: %ОписаниеОшибки%""; "); 
			СоставноеСообщение = СтрЗаменить(СоставноеСообщение, "%Ссылка%", Реквизит);
			СоставноеСообщение = СтрЗаменить(СоставноеСообщение, "%ОписаниеОшибки%", ОписаниеОшибки());
			Сообщить(СоставноеСообщение);
		КонецПопытки;
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти
