#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Родитель") Тогда
			
			Если ДанныеЗаполнения.Родитель.ВидРеквизита = Перечисления.ВидыРеквизитов.СтандартныеРеквизиты Тогда
				ВидРеквизита = Перечисления.ВидыРеквизитов.СтандартныйРеквизит;
			ИначеЕсли ДанныеЗаполнения.Родитель.ВидРеквизита = Перечисления.ВидыРеквизитов.Реквизиты Тогда
				ВидРеквизита = Перечисления.ВидыРеквизитов.Реквизит;
			ИначеЕсли ДанныеЗаполнения.Родитель.ВидРеквизита = Перечисления.ВидыРеквизитов.РеквизитыАдресации Тогда
				ВидРеквизита = Перечисления.ВидыРеквизитов.РеквизитАдресации;
			ИначеЕсли ДанныеЗаполнения.Родитель.ВидРеквизита = Перечисления.ВидыРеквизитов.Измерения Тогда
				ВидРеквизита = Перечисления.ВидыРеквизитов.Измерение;
			ИначеЕсли ДанныеЗаполнения.Родитель.ВидРеквизита = Перечисления.ВидыРеквизитов.Ресурсы Тогда
				ВидРеквизита = Перечисления.ВидыРеквизитов.Ресурс;
			ИначеЕсли ДанныеЗаполнения.Родитель.ВидРеквизита = Перечисления.ВидыРеквизитов.ТабличнаяЧасть Тогда
				ВидРеквизита = Перечисления.ВидыРеквизитов.Реквизит;
			ИначеЕсли ДанныеЗаполнения.Родитель.ВидРеквизита = Перечисления.ВидыРеквизитов.ПризнакиУчета Тогда
				ВидРеквизита = Перечисления.ВидыРеквизитов.ПризнакУчета;
			ИначеЕсли ДанныеЗаполнения.Родитель.ВидРеквизита = Перечисления.ВидыРеквизитов.Графы Тогда
				ВидРеквизита = Перечисления.ВидыРеквизитов.Графа;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		ВидРеквизита = Перечисления.ВидыРеквизитов.ТабличнаяЧасть;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Заголовок = "Справочник ""Реквизиты объектов метаданных"":";

	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураОбязательныхПолей.Вставить("Имя");

	Универсальные.ПроверитьЗаполнениеРеквизитов(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Наименование = ?(ЗначениеЗаполнено(Родитель), СокрЛП(Родитель), СокрЛП(Владелец)) + "." + Имя;

	Если Не ЭтоГруппа Тогда
		ТекОписаниеТиповЗначения = "";

		Для Каждого СтрокаТипа Из ТипыЗначенияРеквизита Цикл
			ТекОписаниеТиповЗначения = ТекОписаниеТиповЗначения + СтрокаТипа.ТипЗначенияРеквизита + ", ";
		КонецЦикла;

		Если Не ПустаяСтрока(ТекОписаниеТиповЗначения) Тогда
			ТекОписаниеТиповЗначения = Лев(ТекОписаниеТиповЗначения, СтрДлина(ТекОписаниеТиповЗначения) - 2);
		КонецЕсли;

		ОписаниеТиповЗначения = ТекОписаниеТиповЗначения;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли