#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьПолей();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РезультатыТестаДетализируютсяПоОбъектамМетаданныхПриИзменении(Элемент)
	УстановитьВидимостьПолей();
КонецПроцедуры

&НаКлиенте
Процедура UIDНастройкиСценарияПриИзменении(Элемент)
	УстановитьВидимостьПолей();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СтатусТеста(Команда)
	ДанныеОтбор = Новый Структура;
	ДанныеОтбор.Вставить("Тест",Объект.Ссылка);
	
	ПараметрыФормы = Новый Структура("КлючВарианта, Отбор, ВидимостьКомандВариантовОтчетов, СформироватьПриОткрытии", 
		"СтатусПрохожденияТестовВВетке",
		ДанныеОтбор, 
		Истина,
		Истина);
		
	ОткрытьФорму(
		"Отчет.СтатусПрохожденияТестовВВетке.Форма",
		ПараметрыФормы, ,
		Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуЗапускаСценария(Команда)
	ПараметрыФормы = Новый Структура("Проект, Тест", Объект.Владелец, Объект.Ссылка);
	ТестированиеКлиент.ОткрытьНастройкуСценарияДляРедактированияВРепозитории(ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСценарий(Команда)
	ПараметрыФормы = Новый Структура("Проект, Тест", Объект.Владелец, Объект.Ссылка);
	ТестированиеКлиент.ОткрытьСценарийДляРедактированияВРепозитории(ПараметрыФормы);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьПолей()
	UIDУказан = ЗначениеЗаполнено(Объект.UIDНастройкиСценария);
	Элементы.ОткрытьСценарий.Видимость = UIDУказан;
	ВидимостьНастроек = НЕ (UIDУказан ИЛИ Объект.РезультатыТестаДетализируютсяПоОбъектамМетаданных);
	Элементы.НастройкаЗапускаСценария.Видимость = ВидимостьНастроек;
	Элементы.НастройкаЗапускаПроцесса.Видимость = ВидимостьНастроек;
КонецПроцедуры 

#КонецОбласти