
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ПараметрыВыполненияКоманды.Источник.ЭтоНовыйЭлемент И
		НЕ ПараметрыВыполненияКоманды.Источник.ЭлементУжеЗаписывался Тогда
		ВызватьИсключение 
			НСтр("ru = 'Сначала необходимо записать сценарий.'")
		КонецЕсли;	 
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("UIDСценария", ПараметрыВыполненияКоманды.Источник.UIDСценария);
	ПараметрыФормы.Вставить("ТокенПользователя", ПараметрыВыполненияКоманды.Источник.ТокенПользователя);
	ПараметрыФормы.Вставить("Проект", ПараметрыВыполненияКоманды.Источник.Проект);
	ПараметрыФормы.Вставить("Ветка", ПараметрыВыполненияКоманды.Источник.Ветка);
	ПараметрыФормы.Вставить("ИдентификаторКоммита", ПараметрыВыполненияКоманды.Источник.ИдентификаторКоммита);
	ПараметрыФормы.Вставить("АдресСлужебныеДанныеСценариев", ПараметрыВыполненияКоманды.Источник.АдресСлужебныеДанныеСценариев);
	ПараметрыФормы.Вставить("Код", ПараметрыВыполненияКоманды.Источник.Код);
	ПараметрыФормы.Вставить("НаименованиеСценария", ПараметрыВыполненияКоманды.Источник.Наименование);
	ОткрытьФорму("Справочник.СценарииРаботыПользователей.Форма.ПрисоединенныеФайлы",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
