#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец,"Владелец");	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыСостав

&НаКлиенте
Процедура СоставПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СоставПередНачаломДобавленияЗавершение", ЭтотОбъект);

	ОткрытьФорму("Справочник.КритерииОтбораСвойства.Форма.ФормаВыбораРеквизитов",,,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставПередНачаломДобавленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ВыбранноеЗначение = Результат;
    НоваяСтрока = Объект.Состав.Добавить();
    НоваяСтрока.Реквизит = ВыбранноеЗначение;
    
КонецПроцедуры

&НаКлиенте
Процедура СоставТипНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    ОписаниеОповещения = Новый ОписаниеОповещения("СоставТипНачалоВыбораЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.КритерииОтбораСвойства.Форма.ФормаВыбораРеквизитов",,,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставТипНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ВыбранноеЗначение = Результат;
    Элементы.Состав.ТекущиеДанные.Реквизит = ВыбранноеЗначение;

КонецПроцедуры

#КонецОбласти
