
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЭтоДвиженияДокумента(Параметры.ОбъектМетаданных) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("Ссылка", Параметры.ОбъектМетаданных);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененТекущийПроект" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(Неопределено, Элементы.Список.ТекущиеДанные.Регистр);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЭтоДвиженияДокумента(ОбъектМетаданных)
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(ОбъектМетаданных) Тогда
		
		ИмяКласса = РаботаСОбъектамиМетаданных.ИмяКлассаОбъектаМетаданных(ОбъектМетаданных);
		Если ИмяКласса = "Документы" Тогда
			Результат = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
