#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Проект = ПараметрыСеанса.ТекущийПроект;
	
	СписокВыбора = Новый СписокЗначений;
	
	Если Параметры.Свойство("СписокВыбора") Тогда
		СписокВыбора = Параметры.СписокВыбора;
	КонецЕсли;
	
	Ветки = СписокВыбора;
	ТипыВеток = Новый СписокЗначений;
	
	Если Параметры.Свойство("ТипыВеток", ТипыВеток) ИЛИ ЗначениеЗаполнено(Проект) Тогда
		УстановитьПараметрыВыбораВеток(ТипыВеток);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыВетки

&НаКлиенте
Процедура ВеткиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока И Не ОтменаРедактирования Тогда
		
		СтрокаТаблицы = Ветки.НайтиПоИдентификатору(Элемент.ТекущаяСтрока);
		Если СтрокаТаблицы <> Неопределено Тогда
			СтрокаТаблицы.Пометка = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВеткиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		СтандартнаяОбработка = Ложь;
		
		Для Каждого ЭлементМассива из ВыбранноеЗначение Цикл
			НоваяСтрока = Ветки.Добавить();
			НоваяСтрока.Значение = ЭлементМассива;
			НоваяСтрока.Пометка = Истина;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ОповеститьОВыборе(Ветки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыиФункции

&НаСервере
Процедура УстановитьПараметрыВыбораВеток(ТипыВеток)
	
	ПараметрыВыбораДляПоля = Новый Массив;
	
	ТипыВетокДляОграничения = Новый Массив;
	
	Если ТипЗнч(ТипыВеток) = Тип("СписокЗначений") Тогда
		ТипыВетокДляОграничения = ТипыВеток.ВыгрузитьЗначения();
	КонецЕсли;
	
	Если ТипыВетокДляОграничения.Количество()>0 Тогда
		ТипыВетокДляОтбора = Новый ФиксированныйМассив(ТипыВетокДляОграничения);
		ПараметрВыбораПоТипамВеток = Новый ПараметрВыбора("Отбор.Тип", ТипыВетокДляОтбора);
		ПараметрыВыбораДляПоля.Добавить(ПараметрВыбораПоТипамВеток);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Проект) Тогда
		ПараметрВыбораПоПроекту = Новый ПараметрВыбора("Отбор.Владелец", Проект);
		ПараметрыВыбораДляПоля.Добавить(ПараметрВыбораПоПроекту);
	КонецЕсли;
		
	УстанавливаемыеПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораДляПоля);
	Элементы.ВеткиЗначение.ПараметрыВыбора = УстанавливаемыеПараметрыВыбора;
	
КонецПроцедуры

#КонецОбласти
