////////////////////////////////////////////////////////////////////////////////
// Подсистема "Разработка конфигурации". Работа с ключевыми операциями.
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Значение важности ключевой операции по умолчанию (устанавливается для новых ключевых операций).
// 
// Возвращаемое значение:
//  Число(1) - важность ключевой операции по умолчанию.
//
Функция ВажностьПоУмолчанию() Экспорт
	
	Возврат 5;
	
КонецФункции

// Вид выгрузки ключевых операций для Центра контроля качества.
// 
// Возвращаемое значение:
//  Строка - значение константы для Центра контроля качества.
//
Функция ВидВыгрузкиДляЦентраКонтроляКачества() Экспорт
	
	Возврат "ДляЦентраКонтроляКачества";
	
КонецФункции

// Целевое время длительной ключевой операции по умолчанию.
//
// Возвращаемое значение:
//  Число - целевое время по умолчанию.
//
Функция ЦелевоеВремяДлительнойОперацииПоУмолчанию() Экспорт
	
	Возврат 1;
	
КонецФункции

// Целевое время интерактивой ключевой операции по умолчанию.
//
// Возвращаемое значение:
//  Число - целевое время по умолчанию.
//
Функция ЦелевоеВремяИнтерактивнойОперацииПоУмолчанию() Экспорт
	
	Возврат 1;
	
КонецФункции

#КонецОбласти
