#Область ПрограммныйИнтерфейс

Функция ИспользуемаяВерсияФорматаВыгрузки() Экспорт
	
	Возврат "2.0.14";
	
КонецФункции

Функция ПоддерживаемыеВерсииФормата() Экспорт
	
	МассивВерсий = Новый Массив;
	
	МассивВерсий.Добавить("2.0.14");
	
	Возврат МассивВерсий;
	
КонецФункции

Функция СтруктураОбязательныхДанных(Проект) Экспорт
	
	СтруктураОбязательныхДанных = Новый Структура;
	СтруктураОбязательныхДанных.Вставить("РольПолныеПрава");
	СтруктураОбязательныхДанных.Вставить("РольБазовыеПрава");
	СтруктураОбязательныхДанных.Вставить("РольРольНеНазначается");
	СтруктураОбязательныхДанных.Вставить("ВидДоступаПользователи");
	СтруктураОбязательныхДанных.Вставить("ВидДоступаВнешниеПользователи");
	СтруктураОбязательныхДанных.Вставить("ВидДоступаПоОбъектуДоступа");
	СтруктураОбязательныхДанных.Вставить("ВидДоступаПоУсловию");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбъектыМетаданных.Ссылка КАК Ссылка,
	|	ОбъектыМетаданных.Имя КАК Имя
	|ИЗ
	|	Справочник.ОбъектыМетаданных КАК ОбъектыМетаданных
	|ГДЕ
	|	ОбъектыМетаданных.Владелец = &Проект
	|	И (ОбъектыМетаданных.ЭтоГруппа)
	|	ИЛИ (ОбъектыМетаданных.Родитель.Имя = ""Роли"" И ОбъектыМетаданных.Имя = ""ПолныеПрава"")
	|	ИЛИ (ОбъектыМетаданных.Родитель.Имя = ""Роли"" И ОбъектыМетаданных.Имя = ""БазовыеПрава"")
	|	ИЛИ (ОбъектыМетаданных.Родитель.Имя = ""Роли"" И ОбъектыМетаданных.Имя = ""РольНеНазначается"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыДоступа.Ссылка,
	|	ВидыДоступа.Имя
	|ИЗ
	|	Справочник.ВидыДоступа КАК ВидыДоступа
	|ГДЕ
	|	ВидыДоступа.Владелец = &Проект
	|	И (ВидыДоступа.Имя = ""Пользователи"")
	|	ИЛИ (ВидыДоступа.Имя = ""ВнешниеПользователи"")
	|	ИЛИ (ВидыДоступа.Имя = ""ПоОбъектуДоступа"")
	|	ИЛИ (ВидыДоступа.Имя = ""ПоУсловию"")"
	;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Имя = "ПолныеПрава" Тогда
			СтруктураОбязательныхДанных.Вставить("РольПолныеПрава", Выборка.Ссылка);
		ИначеЕсли Выборка.Имя = "БазовыеПрава" Тогда
			СтруктураОбязательныхДанных.Вставить("РольБазовыеПрава", Выборка.Ссылка);
		ИначеЕсли Выборка.Имя = "РольНеНазначается" Тогда
			СтруктураОбязательныхДанных.Вставить("РольРольНеНазначается", Выборка.Ссылка);
		ИначеЕсли Выборка.Имя = "Пользователи" Тогда
			СтруктураОбязательныхДанных.Вставить("ВидДоступаПользователи", Выборка.Ссылка);
		ИначеЕсли Выборка.Имя = "ВнешниеПользователи" Тогда
			СтруктураОбязательныхДанных.Вставить("ВидДоступаВнешниеПользователи", Выборка.Ссылка);
		ИначеЕсли Выборка.Имя = "ПоОбъектуДоступа" Тогда
			СтруктураОбязательныхДанных.Вставить("ВидДоступаПоОбъектуДоступа", Выборка.Ссылка);
		ИначеЕсли Выборка.Имя = "ПоУсловию" Тогда
			СтруктураОбязательныхДанных.Вставить("ВидДоступаПоУсловию", Выборка.Ссылка);
		Иначе
			// Группы из дерева объектов метаданных
			СтруктураОбязательныхДанных.Вставить(Выборка.Имя, Выборка.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураОбязательныхДанных;
	
КонецФункции

#КонецОбласти