
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписок();
	
	СписокВыбора = Новый СписокЗначений;
	
	Если Параметры.Свойство("СписокВыбора") Тогда
		СписокВыбора = Параметры.СписокВыбора;
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из Список Цикл
		
		Если СписокВыбора.НайтиПоЗначению(ЭлементСписка.Значение)<>Неопределено Тогда
			ЭлементСписка.Пометка = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	СписокВыбора = Новый СписокЗначений;
	
	ИсключеныЗначения = Ложь;
	
	Для Каждого ЭлементСписка из Список Цикл
		Если ЭлементСписка.Пометка Тогда
			СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		Иначе
			ИсключеныЗначения = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ИсключеныЗначения Тогда
		СписокВыбора = Новый СписокЗначений;
	КонецЕсли;
	
	ОповеститьОВыборе(СписокВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписок()

	ДобавитьЗначениеСписка("Автор", НСтр("ru='Автор'"));
	ДобавитьЗначениеСписка("Зарегистрировал", НСтр("ru='Зарегистрировал'"));
	ДобавитьЗначениеСписка("Рассмотрел", НСтр("ru='Рассмотрел'"));
	ДобавитьЗначениеСписка("Исправил", НСтр("ru='Исправил'"));
	ДобавитьЗначениеСписка("Проверил", НСтр("ru='Проверил'"));
	ДобавитьЗначениеСписка("Отозвал", НСтр("ru='Отозвал'"));
	ДобавитьЗначениеСписка("Закрыл", НСтр("ru='Закрыл'"));
	ДобавитьЗначениеСписка("НеПланируетИсправлять", НСтр("ru='Установил <Не планируется исправлять>'"));
	ДобавитьЗначениеСписка("УстановилОжидаетИсправленияПовторяемой", НСтр("ru='Установил <Ожидает исправления повторяемой>'"));
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗначениеСписка(Значение, Представление)

	Список.Добавить(Значение, Представление);
	
КонецПроцедуры
	
#КонецОбласти