
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("ОбъектМетаданныхПоставщика", ПараметрКоманды);
	
	ОткрытьФорму("Справочник.Подсистемы.Форма.ФормаСпискаОбъектовНаПоддержке",
	             ПараметрыФормы,
	             ПараметрыВыполненияКоманды.Источник,
	             ПараметрыВыполненияКоманды.Уникальность,
	             ПараметрыВыполненияКоманды.Окно,
	             ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
