#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Сборки конфигурации ""%1""'"),
		Параметры.Конфигурация);
	
	Сборки = Параметры.Сборки.ВыгрузитьЗначения();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сборки", Сборки);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СборкиВерсии.Ссылка КАК Сборка,
		|	СборкиВерсии.ДатаСборки КАК ДатаСборки
		|ИЗ
		|	Справочник.СборкиВерсии КАК СборкиВерсии
		|ГДЕ
		|	СборкиВерсии.Ссылка В(&Сборки)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСборки";
	Результат = Запрос.Выполнить().Выгрузить();
	
	ЗначениеВРеквизитФормы(Результат, "Таблица");
КонецПроцедуры

#КонецОбласти