#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Проект") Тогда
		
		ПараметрВыбора = Новый ПараметрВыбора("Отбор.Владелец", Параметры.Проект);
		Массив = Новый Массив();
		Массив.Добавить(ПараметрВыбора);
		ПараметрыВыбораДляПоля = Новый ФиксированныйМассив(Массив);
		
		Элементы.ТехническийПроект.ПараметрыВыбора = ПараметрыВыбораДляПоля;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ТехническийПроект);
	
КонецПроцедуры

#КонецОбласти