
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект = Параметры.Объект;
	ДатаВерсии = Параметры.ДатаВерсии;
	
	Если Параметры.НеВыводитьОписаниеСхему Тогда
		Возврат;
	КонецЕсли;
	
	ВывестиОписаниеСхему();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОписаниеОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Значение = ПолучитьЗначениеПоВнутреннемуПредставлению(Расшифровка);
	ПоказатьЗначение(Неопределено, Значение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	
	НапечататьОписаниеСхему();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ВывестиОписаниеСхему();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НапечататьОписаниеСхему()
	
	Описание.Напечатать();
	
	Если Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.СтраницаСхема.Доступность Тогда
		Схема.Напечатать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиОписаниеСхему()
	
	Перем СхемаОбъекта, ЭлементыСхемы;
	
	Если НЕ ЗначениеЗаполнено(Объект) Тогда
		
		Схема = Новый ГрафическаяСхема();
		Описание = Новый ТабличныйДокумент();
		
		Возврат;
	КонецЕсли;
	
	Версионирование.ОписаниеСхемаВерсииОбъекта(Объект, ДатаВерсии, Описание, СхемаОбъекта);
	ОписаниеОбъектов.НастроитьОписаниеОбъекта(Описание);
	
	Если ТипЗнч(СхемаОбъекта) = Тип("ГрафическаяСхема") Тогда
		Схема = СхемаОбъекта;
		Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.СтраницаСхема.Доступность = Истина;
	Иначе
		Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.СтраницаСхема.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеПоВнутреннемуПредставлению(Представление)
	
	Возврат ЗначениеИзСтрокиВнутр(Представление);
	
КонецФункции

#КонецОбласти
