#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует массив статусов задач, которые не требуют внимания
//
// Возвращаемое значение:
//   Массив   - статусы не требуеющие внимания
//
Функция СтатусыНеТребуюющиеВнимания() Экспорт
	
	МассивСтатусов = Новый Массив;
	
	МассивСтатусов.Добавить(Перечисления.СтатусыЗадачПроцессов.Отменена);
	МассивСтатусов.Добавить(Перечисления.СтатусыЗадачПроцессов.Выполнена);
	
	Возврат МассивСтатусов;
	
КонецФункции

#КонецОбласти

#КонецЕсли