#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Пользователь", ПараметрКоманды);
	
	ПараметрыФормы = Новый Структура("КлючВарианта, Отбор, СформироватьПриОткрытии, ВидимостьКомандВариантовОтчетов", 
 		                             "ЗатратыВремениИРезультатыПользователейКонтекстный",
		                             СтруктураОтбора, 
		                             Ложь,
		                             Истина);
									 
	ОткрытьФорму("Отчет.ЗатратыВремениИРезультатыПользователей.Форма",
		ПараметрыФормы, ,
		Истина,
		ПараметрыВыполненияКоманды.Окно);
		
КонецПроцедуры

#КонецОбласти