#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОбъектМетаданных") Тогда
		ОбъектМетаданных = Параметры.ОбъектМетаданных;
	Иначе
		ОбъектМетаданных = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектМетаданных) Тогда
		Поле = "Владелец";
		Значение = ОбъектМетаданных;
	Иначе
		Поле = "Владелец.Владелец";
		Значение = ПараметрыСеанса.ТекущийПроект;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		Поле,
		Значение,
		ВидСравненияКомпоновкиДанных.Равно,,
		ЗначениеЗаполнено(Значение));
	
КонецПроцедуры

#КонецОбласти
