#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ОсновнойВидСогласуемогоРесурса() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВидыСогласуемыхРесурсов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыСогласуемыхРесурсов КАК ВидыСогласуемыхРесурсов
	|ГДЕ
	|	ВидыСогласуемыхРесурсов.Основной";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если  Выборка.Следующий() Тогда
	
		Возврат Выборка.Ссылка;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

Функция ЕдинственныйВидРесурса() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 2
	|	ВидыСогласуемыхРесурсов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыСогласуемыхРесурсов КАК ВидыСогласуемыхРесурсов
	|ГДЕ
	|	НЕ ВидыСогласуемыхРесурсов.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ВидРесурсаПоУмолчанию() Экспорт
	
	ОсновнойВидРесурса = ОсновнойВидСогласуемогоРесурса();
	
	Если ОсновнойВидРесурса <> Неопределено Тогда
		
		Возврат ОсновнойВидРесурса;
		
	КонецЕсли;
	
	Возврат ЕдинственныйВидРесурса();
	
КонецФункции

Функция ПредставлениеВидаРесурса(ВидРесурса) Экспорт
	
	ПредставлениеВида = "";
	
	Если Не ЗначениеЗаполнено(ВидРесурса) Тогда
		Возврат ПредставлениеВида;
	КонецЕсли;
	
	РеквизитыВида = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидРесурса, "Наименование, ЕдиницаИзмерения");
	
	Возврат ЗадачиПроцессовКлиентСервер.ПредставлениеВидаРесурса(РеквизитыВида.Наименование, РеквизитыВида.ЕдиницаИзмерения);
	
КонецФункции

#КонецОбласти

#КонецЕсли 

