////////////////////////////////////////////////////////////////////////////////
// Подсистема "Органайзер".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получить навигационную ссылку на указанный стандарт.
//
// Параметры:
//  Ссылка - СправочникСсылка.Стандарты - ссылка на стандарт.
//
// Возвращаемое значение:
//  Строка - навигационная ссылка на указанный стандарт.
//
Функция НавигационнаяСсылкаНаСтандарт(Ссылка) Экспорт
	
	ЕстьАдрес = Ложь;
	Стандарт = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Код, ЭтоГруппа, Внешний");
	
	Если Стандарт.Внешний <> Неопределено Тогда
		Если Стандарт.Внешний Тогда
			АдресСтандартов = Константы.АдресСтандартов.Получить();
			ЕстьАдрес = ЗначениеЗаполнено(АдресСтандартов);
		КонецЕсли;
		
		Если Стандарт.ЭтоГруппа Или Не Стандарт.Внешний Или Не ЕстьАдрес Тогда
			Возврат ПолучитьНавигационнуюСсылку(Ссылка);
		Иначе
			ПараметрыАдреса = Новый Структура;
			ПараметрыАдреса.Вставить("КодСтандарта", СокрЛП(Стандарт.Код));
			Возврат СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(АдресСтандартов, ПараметрыАдреса);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
