
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокВыбора = Новый СписокЗначений;
	
	Если Параметры.Свойство("СписокВыбора") Тогда
		СписокВыбора = Параметры.СписокВыбора;
	КонецЕсли;
	
	ИсключитьСтатусы = Новый Массив;
	Если Параметры.Свойство("ИсключитьСтатусы") Тогда
		ИсключеныСтатусы = Истина;
		ИсключитьСтатусы = Параметры.ИсключитьСтатусы;
	КонецЕсли;

	Для Каждого Значение Из Метаданные.Перечисления.СтатусыВеток.ЗначенияПеречисления Цикл
		
		ЗначениеСсылка = Перечисления.СтатусыВеток[Значение.Имя];
		Если ИсключитьСтатусы.Найти(ЗначениеСсылка) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЭлементСписка = Список.Добавить(ЗначениеСсылка);
		
		Если СписокВыбора.НайтиПоЗначению(ЗначениеСсылка)<>Неопределено Тогда
			ЭлементСписка.Пометка = Истина;
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	СписокВыбора = Новый СписокЗначений;
	
	ИсключеныЗначения = Ложь;
	
	Для Каждого ЭлементСписка из Список Цикл
		Если ЭлементСписка.Пометка Тогда
			СписокВыбора.Добавить(ЭлементСписка.Значение);
		Иначе
			ИсключеныЗначения = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ИсключеныЗначения И НЕ ИсключеныСтатусы Тогда
		СписокВыбора = Новый СписокЗначений;
	КонецЕсли;
	
	ОповеститьОВыборе(СписокВыбора);
	
КонецПроцедуры

#КонецОбласти
