#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ЗначениеЗаполнено(ПараметрКоманды) И НЕ ОбъектЯвляетсяГруппой(ПараметрКоманды) Тогда
		
		ПараметрыФормы = Новый Структура("Ссылка", ПараметрКоманды);
		ОткрытьФорму("ОбщаяФорма.ИнформацияДляХранилища",
		             ПараметрыФормы,
					 ПараметрыВыполненияКоманды.Источник,
					 ПараметрКоманды,
					 ПараметрыВыполненияКоманды.Окно);

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОбъектЯвляетсяГруппой(Ссылка)
	
	КоллекцияРеквизитов = Универсальные.ЗначенияРеквизитовСправочника(Ссылка, "ЭтоГруппа");
	
	Возврат КоллекцияРеквизитов.ЭтоГруппа;
	
КонецФункции

#КонецОбласти