#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ВЫБОР КОГДА ТипЗначения(КонтролируемыйОбъект) = Тип(Справочник.ВидыДоступа) ИЛИ ТипЗначения(КонтролируемыйОбъект) = Тип(Справочник.ОбработчикиОбновленияИнформационнойБазы) ИЛИ ТипЗначения(КонтролируемыйОбъект) = Тип(Справочник.ОбъектыМетаданных) ИЛИ ТипЗначения(КонтролируемыйОбъект) = Тип(Справочник.Ошибки) ИЛИ ТипЗначения(КонтролируемыйОбъект) = Тип(Справочник.Подсистемы) ИЛИ ТипЗначения(КонтролируемыйОбъект) = Тип(Справочник.ПрофилиПользователей) ИЛИ ТипЗначения(КонтролируемыйОбъект) = Тип(Справочник.Процессы) ИЛИ ТипЗначения(КонтролируемыйОбъект) = Тип(Справочник.ТехническиеПроекты) ИЛИ ТипЗначения(КонтролируемыйОбъект) = Тип(Справочник.Идеи) ТОГДА ЗначениеРазрешено(КонтролируемыйОбъект.Владелец)
	|	КОГДА ТипЗначения(КонтролируемыйОбъект) = Тип(Справочник.ШагиПроцесса) ТОГДА ЗначениеРазрешено(ВЫРАЗИТЬ(КонтролируемыйОбъект КАК Справочник.ШагиПроцесса).Владелец.Владелец)
	|	ИНАЧЕ КонтролируемыйОбъект <> Неопределено КОНЕЦ ";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли