// Установка текущей страницы (закладки) для форм, имеющих
// несколько закладок
Процедура УстановитьТекущуюСтраницу(ИмяОбъекта, ГруппаСтраниц, ИмяСохраненнногоЗначения) Экспорт

	СохраненноеЗначение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяОбъекта, ИмяСохраненнногоЗначения);
	
	Если СохраненноеЗначение <> Неопределено Тогда
		
		Страница = ГруппаСтраниц.ПодчиненныеЭлементы.Найти(СохраненноеЗначение);
		
		Если Страница <> Неопределено Тогда
			Если Страница.Видимость Тогда
				ГруппаСтраниц.ТекущаяСтраница = Страница;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Сохранение текущей закладки для форм, имеющих несколько закладок
Процедура СохранитьТекущуюСтраницу(ИмяОбъекта, ГруппаСтраниц, ИмяСохраненнногоЗначения) Экспорт
	
	Если ГруппаСтраниц.ТекущаяСтраница <> Неопределено Тогда
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяОбъекта, ИмяСохраненнногоЗначения, ГруппаСтраниц.ТекущаяСтраница.Имя);
	КонецЕсли;
	
КонецПроцедуры