
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбработатьПереданныеПараметры();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ПриоритетРаботы"
		И ЗначениеЗаполнено(Проект) Тогда
		
		Если Не ОповещениеОЗаписиПриоритетаОтработано Тогда 
		
			ОповещениеОЗаписиПриоритетаОтработано = Истина;
			ПриИзмененииПроектаСервер();
			
		Иначе
			
			ОповещениеОЗаписиПриоритетаОтработано = Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	ПриИзмененииПроектаСервер();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриИзмененииПроектаСервер()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
	                                                                        "Владелец", 
	                                                                        Проект, 
	                                                                        ВидСравненияКомпоновкиДанных.Равно,
	                                                                        НСтр("ru = 'Отбор по проекту'"),
	                                                                        Истина, 
	                                                                        РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	Если ЗначениеЗаполнено(Проект) Тогда
		ДанныеЗаголовка = Справочники.ПриоритетыРабот.ДанныеЗаголовкаНастроеныПриоритеты(Проект);
		Если Не ДанныеЗаголовка.ЕстьПроблемы Тогда
			Элементы.ДекорацияИнформацияОКорректностиЗаполнения.Заголовок = "";
			Элементы.ДекорацияИнформацияОКорректностиЗаполнения.Видимость = Ложь;
		Иначе
			Элементы.ДекорацияИнформацияОКорректностиЗаполнения.Заголовок = Новый ФорматированнаяСтрока(ДанныеЗаголовка.ТекстЗаголовка,,ДанныеЗаголовка.ЦветЗаголовка);
			Элементы.ДекорацияИнформацияОКорректностиЗаполнения.Видимость = Истина;
		КонецЕсли;
	Иначе
		Элементы.ДекорацияИнформацияОКорректностиЗаполнения.Заголовок = "";
		Элементы.ДекорацияИнформацияОКорректностиЗаполнения.Видимость = Ложь;
	
	КонецЕсли;
	
	ОбновитьУсловноеОформлениеЦветаПриоритета();
	
КонецПроцедуры 

&НаСервере
Процедура ОбработатьПереданныеПараметры()

	Проект = Параметры.Владелец;
	ПриИзмененииПроектаСервер();

КонецПроцедуры

&НаСервере
Процедура ОбновитьУсловноеОформлениеЦветаПриоритета()
	
	ПриоритетыОчередиРабот.УстановитьУсловноеОформлениеСписка(Список, Неопределено, "Наименование", "Ссылка");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	Если Не ОповещениеОЗаписиПриоритетаОтработано Тогда
	
		ВыделенныеСтроки = Элементы.Список.ПолучитьСтрокиДляОбработки();
		Если ВыделенныеСтроки.Количество() <> 1 Тогда
			Возврат;
		КонецЕсли;
		ТекущиеДанные = Элементы.Список.ДанныеСтроки(ВыделенныеСтроки[0]);
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("Владелец", Проект);
		Оповестить("Запись_ПриоритетРаботы", ПараметрыОповещения , ТекущиеДанные.Ссылка); 
		
		ОповещениеОЗаписиПриоритетаОтработано = Истина;
		
	Иначе
		
		ОповещениеОЗаписиПриоритетаОтработано = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
