#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Владелец)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

Функция ЭтоТестДляСценарияРаботыПользователя(Тест) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Значения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Тест,"НастройкаЗапускаСценария,НастройкаЗапускаПроцесса,UIDНастройкиСценария");
	
	Результат = ЗначениеЗаполнено(Значения.НастройкаЗапускаСценария) 
			ИЛИ ЗначениеЗаполнено(Значения.НастройкаЗапускаПроцесса) 
			ИЛИ ЗначениеЗаполнено(Значения.UIDНастройкиСценария);
			
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
