#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("Проект", Параметры.Проект);
	Список.Параметры.УстановитьЗначениеПараметра("СписокХеш", Параметры.СписокХеш);
	Если Параметры.Свойство("ДатаРегистрации") Тогда
		ДатаРегистрации = Параметры.ДатаРегистрации;
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("ДатаРегистрации", ДатаРегистрации);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	 
	
	ПараметрыФормы = Новый Структура("Ключ", Элемент.ТекущиеДанные.Ссылка);
	ОткрытьФорму("Справочник.Ошибки.ФормаОбъекта", ПараметрыФормы); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаРегистрацииПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ДатаРегистрации", ДатаРегистрации);
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти