#Область ПрограммныйИнтерфейс

// Определяет, доступна указанная роль в разрезе проекта, или нет
//
// Параметры:
//  ИмяРоли Строка. Имя роли, наличие которой проверяется
//  Проект - СправочникСсылка.Проекты. Проект, в разрезе которого проверяется наличие роли
//
// Возвращаемое значение:
//  РольДоступна - Булево. Истина- роль доступна, Ложь - в противном случае.
//
Функция РольДоступнаПоПроекту(ИмяРоли, Проект) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Проект) Тогда
		РольДоступна = Пользователи.ЭтоПолноправныйПользователь();
	Иначе
		Наборы = УправлениеДоступом.ТаблицаНаборыЗначенийДоступа();
		Строка = Наборы.Добавить();
		Строка.ЗначениеДоступа = Проект;
		
		РольДоступна = УправлениеДоступом.ЕстьРоль(ИмяРоли, Наборы);
	КонецЕсли;
		
	Возврат РольДоступна;
	
КонецФункции

#КонецОбласти