#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Проект = Неопределено;
	
	Если НЕ ДанныеПринадлежатОдномуПроекту(ПараметрКоманды, Проект) Тогда
		ТекстСообщения = НСтр("ru='Выбранные данные относятся к разным проектам.
		|Создание технического проекта невозможно.'");
		ПоказатьПредупреждение(Неопределено, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ДобавляемыеИдеи", ПараметрКоманды);
	ЗначенияЗаполнения.Вставить("Проект", Проект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Справочник.ТехническиеПроекты.ФормаОбъекта",
				ПараметрыФормы,
				ПараметрыВыполненияКоманды.Источник,
				ПараметрыВыполненияКоманды.Уникальность,
				ПараметрыВыполненияКоманды.Окно,
				ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ДанныеПринадлежатОдномуПроекту(Ссылки, Проект)
	
	Возврат Справочники.ТехническиеПроекты.ДанныеПринадлежатОдномуПроекту(Ссылки, Проект);
	
КонецФункции

#КонецОбласти
