#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ЭтоНовый() Тогда
		Если ДанныеЗаполнения <> Неопределено Тогда
			Если ДанныеЗаполнения.Свойство("Владелец") Тогда
				Наименование = НаименованиеПроцесса(ДанныеЗаполнения.Владелец);
			КонецЕсли;	 
		КонецЕсли;	 
	КонецЕсли;	 
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НаименованиеПроцесса(Процесс)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Процессы.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Процессы КАК Процессы
		|ГДЕ
		|	Процессы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Процесс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Наименование; 
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции	 

#КонецОбласти

#КонецЕсли