
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		
		ИмяКласса = РаботаСОбъектамиМетаданных.ИмяКлассаОбъектаМетаданных(Параметры.Отбор.Владелец);
		
		Если ИмяКласса = "Перечисления" Тогда
			Элементы.КодПоУмолчанию.Видимость = Ложь;
			Элементы.НаименованиеПоУмолчанию.Видимость = Ложь;
			
			Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		Иначе
			Элементы.Синоним.Видимость = Ложь;
			Элементы.Комментарий.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти
