
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ВариантИспользования = Объект.ИспользуетсяДляВсехОбъектов;
		Элементы.ГруппаИспользованиеДляОбъектов.Доступность = НЕ ВариантИспользования;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ВариантИспользования = Объект.ИспользуетсяДляВсехОбъектов;
	Элементы.ГруппаИспользованиеДляОбъектов.Доступность = НЕ ВариантИспользования;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантИспользованияПриИзменении(Элемент)
	
	Если ВариантИспользования = 1 Тогда
		
		Объект.ИспользуетсяДляВсехОбъектов = Истина;
		
		Объект.ИспользуетсяДляЗадач = Ложь;
		Объект.ИспользуетсяДляОшибок = Ложь;
		Объект.ИспользуетсяДляОбъектовМетаданных = Ложь;
		Объект.ИспользуетсяДляПроектов = Ложь;
		Объект.ИспользуетсяДляПрофилейПользователей = Ложь;
		Объект.ИспользуетсяДляПроцессов = Ложь;
		Объект.ИспользуетсяДляТехническихПроектов = Ложь;
		Объект.ИспользуетсяДляИдей = Ложь;
		Объект.ИспользуетсяДляФункций = Ложь;
	Иначе
		Объект.ИспользуетсяДляВсехОбъектов = Ложь;
	КонецЕсли;
	
	Элементы.ГруппаИспользованиеДляОбъектов.Доступность = НЕ ВариантИспользования;
	
КонецПроцедуры

#КонецОбласти
