
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)	
	
	Если НЕ ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("ФормаКлиентскогоПриложения") Тогда
		
		КомандаОбработана = Ложь;
		
		ФормаИсточник = ПараметрыВыполненияКоманды.Источник;
		
		Если ФормаИсточник.Параметры.Свойство("Ключ")
			И ФормаИсточник.Параметры.Ключ = ПараметрКоманды Тогда
			
			Если ФормаИсточник.Модифицированность Тогда
				
				ТекстВопроса = НСтр("ru='Для выполнения операции нужно сохранить изменения.
				|Сохранить и продолжить?'");
				
				Структура = Новый Структура("Форма, Ссылка", ФормаИсточник, ПараметрКоманды);
				ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьИзмененияЗавершение", ЭтотОбъект, Структура);
				ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
				
				КомандаОбработана = Истина;
			
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ КомандаОбработана Тогда
			ОбщегоНазначенияСППРКлиент.ОткрытьОписаниеСхемуВерсииОбъекта(ПараметрКоманды);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзмененияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
	Попытка
		ДополнительныеПараметры.Форма.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	ОбщегоНазначенияСППРКлиент.ОткрытьОписаниеСхемуВерсииОбъекта(ДополнительныеПараметры.Ссылка);

КонецПроцедуры