
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьПереданныеПараметры();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Ок(Команда)
	
	Закрыть(РезультатРедактирования());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьПереданныеПараметры()

	Для Каждого ДанныеНастройки Из Параметры.ДанныеНастроек Цикл
		
		НоваяСтрока = НастройкиГруппировкиОшибокВПодборе.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеНастройки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция РезультатРедактирования() 
	
	Возврат ПоместитьВоВременноеХранилище(НастройкиГруппировкиОшибокВПодборе.Выгрузить());
	
КонецФункции


#КонецОбласти

