#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Назначить(Команда)
	
	ОчиститьСообщения();
	
	Если НЕ ЗначениеЗаполнено(СогласующийИзменения)
		И НЕ ЗначениеЗаполнено(Ответственный) Тогда
		
		ТекстСообщения = НСтр("ru='Для назначения укажите согласующего/ответственного'");
		
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("СогласующийПоУмолчанию", СогласующийИзменения);
	Результат.Вставить("Ответственный", Ответственный);
	
	Закрыть(Результат);
		
КонецПроцедуры

#КонецОбласти