///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет виды доступа, используемые в ограничениях прав доступа.
// Примечание: виды доступа Пользователи и ВнешниеПользователи предопределены,
// но их можно удалить из списка ВидыДоступа, если они не требуются для ограничения прав доступа.
//
// Параметры:
//  ВидыДоступа - ТаблицаЗначений - с колонками:
//   * Имя                    - Строка - имя используемое в описании поставляемых
//                                       профилей групп доступа и текстах ОДД.
//   * Представление          - Строка - представляет вид доступа в профилях и группах доступа.
//   * ТипЗначений            - Тип    - тип ссылки значений доступа,
//                                       например, Тип("СправочникСсылка.Номенклатура").
//   * ТипГруппЗначений       - Тип    - тип ссылки групп значений доступа,
//                                       например, Тип("СправочникСсылка.ГруппыДоступаНоменклатуры").
//   * НесколькоГруппЗначений - Булево - Истина указывает, что для значения доступа (Номенклатуры), можно
//                                       выбрать несколько групп значений (Групп доступа номенклатуры).
//
// Пример:
//  1. Для настройки прав доступа в разрезе организаций:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "Организации";
//  ВидДоступа.Представление = НСтр("ru = 'Организации'");
//  ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");
//
//  2. Для настройки прав доступа в разрезе групп партнеров:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "ГруппыПартнеров";
//  ВидДоступа.Представление    = НСтр("ru = 'Группы партнеров'");
//  ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Партнеры");
//  ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаПартнеров");
//
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Проекты";
	ВидДоступа.Представление = НСтр("ru = 'Проекты'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Проекты");
	
КонецПроцедуры

// Позволяет указать списки, у которых объекты метаданных содержат описание логики ограничения
// доступа в модулях менеджеров или переопределяемом модуле.
//
// В модулях менеджеров указанных списков должна быть размещена процедура обработчика,
// в которую передаются следующие параметры.
// 
//  Ограничение - Структура - со свойствами:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                            Если пустая строка, значит доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                            Если пустая строка, значит доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                            если Истина, тогда не записывать ключи доступа,
//                                            а использовать ключи доступа владельца (требуется,
//                                            чтобы ограничение было строго по объекту-владельцу).
///   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - см.
//                                            описание предыдущего параметра.
//
// Далее пример процедуры для модуля менеджера.
//
//// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
//	
//	Ограничение.Текст =
//	"РазрешитьЧтениеИзменение
//	|ГДЕ
//	|	ЗначениеРазрешено(Организация)
//	|	И ЗначениеРазрешено(Контрагент)";
//	
//КонецПроцедуры
//
// Параметры:
//  Списки - Соответствие - списки с ограничением доступа:
//             * Ключ     - ОбъектМетаданных - список с ограничением доступа.
//             * Значение - Булево - Истина - текст ограничения в модуле менеджера.
//                                 - Ложь   - текст ограничения в этом переопределяемом
//                модуле в процедуре ПриЗаполненииОграниченияДоступа.
//
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Справочники.WebСервисыСвойства, Истина);
	Списки.Вставить(Метаданные.Справочники.WSСсылкиСвойства, Истина);
	Списки.Вставить(Метаданные.Справочники.ВерсииПроекта, Истина);
	Списки.Вставить(Метаданные.Справочники.Ветки, Истина);
	Списки.Вставить(Метаданные.Справочники.ВидыДоступа, Истина);
	Списки.Вставить(Метаданные.Справочники.ГруппыКомандСвойства, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗадачиПроцесса, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗадачиШаблонаПроцесса, Истина);
	Списки.Вставить(Метаданные.Справочники.Идеи, Истина);
	Списки.Вставить(Метаданные.Справочники.КартинкиСправки, Истина);
	Списки.Вставить(Метаданные.Справочники.КлючевыеОперации, Истина);
	Списки.Вставить(Метаданные.Справочники.КомандыОбъектовМетаданных, Истина);
	Списки.Вставить(Метаданные.Справочники.КритерииОтбораСвойства, Истина);
	Списки.Вставить(Метаданные.Справочники.МакетыОбъектовМетаданных, Истина);
	Списки.Вставить(Метаданные.Справочники.МестаИсправленияОшибок, Истина);
	Списки.Вставить(Метаданные.Справочники.НастройкиЗапускаПроцессов, Истина);
	Списки.Вставить(Метаданные.Справочники.НастройкиЗапускаСценариев, Истина);
	Списки.Вставить(Метаданные.Справочники.НастройкиЗапускаТестирования, Истина);
	Списки.Вставить(Метаданные.Справочники.ОбработчикиОбновленияИнформационнойБазы, Истина);
	Списки.Вставить(Метаданные.Справочники.ОбщиеКомандыСвойства, Истина);
	Списки.Вставить(Метаданные.Справочники.ОбщиеМакетыСвойства, Истина);
	Списки.Вставить(Метаданные.Справочники.ОбщиеМодулиСвойства, Истина);
	Списки.Вставить(Метаданные.Справочники.ОбщиеРеквизитыСвойства, Истина);
	Списки.Вставить(Метаданные.Справочники.ОбъектыМетаданных, Истина);
	Списки.Вставить(Метаданные.Справочники.Ошибки, Истина);
	Списки.Вставить(Метаданные.Справочники.ПакетыXDTOСвойства, Истина);
	Списки.Вставить(Метаданные.Справочники.Патчи, Истина);
	Списки.Вставить(Метаданные.Справочники.ПодпискиНаСобытияСвойства, Истина);
	Списки.Вставить(Метаданные.Справочники.Подсистемы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПоследовательностиСвойства, Истина);
	Списки.Вставить(Метаданные.Справочники.ПредопределенныеДанные, Истина);
	Списки.Вставить(Метаданные.Справочники.ПричиныОсобогоПорядкаРазработкиОбработчиковОбновления, Истина);
	Списки.Вставить(Метаданные.Справочники.Проекты, Истина);
	Списки.Вставить(Метаданные.Справочники.ПрофилиПользователей, Истина);
	Списки.Вставить(Метаданные.Справочники.Процессы, Истина);
	Списки.Вставить(Метаданные.Справочники.РазделыПроекта, Истина);
	Списки.Вставить(Метаданные.Справочники.РегламентныеЗаданияСвойства, Истина);
	Списки.Вставить(Метаданные.Справочники.Регламенты, Истина);
	Списки.Вставить(Метаданные.Справочники.РеквизитыОбъектовМетаданных, Истина);
	Списки.Вставить(Метаданные.Справочники.СборкиВерсии, Истина);
	Списки.Вставить(Метаданные.Справочники.СценарииРаботыПользователей, Истина);
	Списки.Вставить(Метаданные.Справочники.Тесты, Истина);
	Списки.Вставить(Метаданные.Справочники.ТехническиеПроекты, Истина);
	Списки.Вставить(Метаданные.Справочники.ФормыОбъектовМетаданных, Истина);
	Списки.Вставить(Метаданные.Справочники.ФункцииМеханизмов, Истина);
	Списки.Вставить(Метаданные.Справочники.ФункцииСистемы, Истина);
	Списки.Вставить(Метаданные.Справочники.ФункциональныеОпцииСвойства, Истина);
	Списки.Вставить(Метаданные.Справочники.ЦелевыеЗадачи, Истина);
	Списки.Вставить(Метаданные.Справочники.ШаблоныПроцесса, Истина);
	Списки.Вставить(Метаданные.Справочники.ШагиПроцесса, Истина);
	Списки.Вставить(Метаданные.Справочники.ЭлементыСправки, Истина);
	Списки.Вставить(Метаданные.Справочники.ЭталонныеБазыТестирования, Истина);
	Списки.Вставить(Метаданные.Документы.ЗапускТестирования, Истина);
	Списки.Вставить(Метаданные.Документы.УчетВремени, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ВерсииОбъектов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ВыполнениеОбщихЗадач, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДатыИзмененияОбъектов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЗамещениеПользователейПоРаботеСОшибками, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ИзмененияВВетках, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ИспользованиеОбъектов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.КонтрольИзменений, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.КалендариПользователей, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкиАвторизацииВ1СДокументообороте, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкиПоддержки, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкиУведомленийПользователей, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ВерсииПатчей, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПерсональныеНастройкиУведомленийПользователей, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПраваДоступаКОбъектамМетаданных, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПриоритетыВыполненияОбработчиковОбновления, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПроблемыОбработчиковОбновленияИнформационнойБазы, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РезультатыВыполненияТестов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РезультатыРегистрацииОшибок, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СостояниеТестированияВеток, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СостояниеЗагрузкиМетаданныхВВетках, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.КоличествоЗапусковТестирования, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РезультатыПроверкиОбъектов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СтатусыВстраиванияМеханизмов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЭтапыПроцесса, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.УчетВремени, Истина);
	
КонецПроцедуры

// Заполняет описания поставляемых профилей групп доступа и
// переопределяет параметры обновления профилей и групп доступа.
//
// Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  ОписанияПрофилей    - Массив - добавить описания профилей групп доступа (Структура).
//                        Состав свойств структуры см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа.
//
//  ПараметрыОбновления - Структура - содержит свойства:
//   * ОбновлятьИзмененныеПрофили - Булево - начальное значение Истина.
//   * ЗапретитьИзменениеПрофилей - Булево - начальное значение Истина.
//       Если установить Ложь, тогда поставляемые профили можно не только просматривать, но и редактировать.
//   * ОбновлятьГруппыДоступа     - Булево - начальное значение Истина.
//   * ОбновлятьГруппыДоступаСУстаревшимиНастройками - Булево - начальное значение Ложь.
//       Если установить Истина, то настройки значений, выполненные администратором для
//       вида доступа который был удален из профиля, будут также удалены из групп доступа.
//
// Пример:
//  ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
//  ОписаниеПрофиля.Имя           = "Менеджер";
//  ОписаниеПрофиля.Идентификатор = "75fa0ecb-98aa-11df-b54f-e0cb4ed5f655";
//  ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по продажам'", Метаданные.ОсновнойЯзык.КодЯзыка);
//  ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
//  ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
//  ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
//  ОписаниеПрофиля.Роли.Добавить("Подсистема_Продажи");
//  ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПокупателей");
//  ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаКнигаПокупок");
//  ОписанияПрофилей.Добавить(ОписаниеПрофиля);
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	ПараметрыОбновления.ЗапретитьИзменениеПрофилей = Ложь;
	
	// Профиль "Администратор проекта".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "fb2dfb81-409c-11e3-a957-000b0d4caf68";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Администратор проекта'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = ''");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБИД");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваСППР");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ВыгрузкаДанныхПроекта");
	ОписаниеПрофиля.Роли.Добавить("ВыгрузкаПроверкаСправки");
	ОписаниеПрофиля.Роли.Добавить("ВыгрузкаСценариевПользователей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВеток");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВерсийОбъектовИнформацииОКонтроле");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВерсийПроекта");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовДоступа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовПланов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовУчетВремени");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗадачПроцессов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаписейКонтроля");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаписейПланов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапусковТестирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИдей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнформацииОбИспользованииОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКартинокСправки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлючевыхОпераций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМестИсправленияОшибок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекЗапускаПроцессов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекЗапускаТестирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТестированияСценариев");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбработчиковОбновленияИнформационнойБазы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъектовМетаданных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОшибок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПатчей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистем");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПравилПроверки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПричинОсобогоПорядкаРазработкиОбработчиковОбновления");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПрофилейПользователей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроцессов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРазделовПроекта");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРассылокОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРегламентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСборокВерсииПроекта");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписковКонтроля");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСтатусовВстраиванияМеханизмов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСценариевРаботыПользователей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТестов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТехническихПроектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФункцийМеханизмов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФункцийСистемы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЦелевыхЗадач");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновЗадачПроцессов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаговСценариевПользователя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭталонныхБазТестирования");
	ОписаниеПрофиля.Роли.Добавить("ЗакрытиеОшибок");
	ОписаниеПрофиля.Роли.Добавить("ЗаписьИзмененийМетаданныхЗаДругихСогласующих");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВнешнегоСоединения");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанныхОбИзмененииВВетках");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанныхХронометража");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДатыЗавершенияЗадач");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеЗадачБезКонтроля");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеКалендарейПользователей");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеНастроекУведомленийПользователя");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеМестаОбнаруженияОшибок");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеПодразделенияВОшибках");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеПометкиУдаленияОшибок");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеПометкиУдаленияПатчей");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеПометкиУдаленияТехническихПроектов");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеПроектов");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеРезультатовПроверкиОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСобственныхНастроекЗамещенияПользователя");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСтатусаПубликацииОшибок");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеУчастниковГруппДоступа");
	ОписаниеПрофиля.Роли.Добавить("ИнтеграцияФункциональнойМодели");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеHTTPСервисаПоЗагрузкеСборок");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеИнтеграцииС1СДокументооборотом");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиНастройкиЛокальногоЗапускаСценариев");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиТекущиеДела");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРабочегоМестаПланирования");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРабочихМестКонтроля");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСинхронизацииКалендарей");
	ОписаниеПрофиля.Роли.Добавить("ОтзывОшибок");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыМоделированиеСистемы");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыНачальнаяСтраница");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыОрганайзер");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыРазработка");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыТестирование");
	ОписаниеПрофиля.Роли.Добавить("ПланированиеВыполнениеОбщихЗадачПоПроектам");
	ОписаниеПрофиля.Роли.Добавить("ПланированиеИУправлениеТехническимиПроектами");
	ОписаниеПрофиля.Роли.Добавить("ПланированиеОтработкиОшибок");
	ОписаниеПрофиля.Роли.Добавить("ПодключениеКХранилищу");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("ПубликацияПатчей");
	ОписаниеПрофиля.Роли.Добавить("РазделАдминистрирование");
	ОписаниеПрофиля.Роли.Добавить("РазделМоделированиеСистемы");
	ОписаниеПрофиля.Роли.Добавить("РазделНачальнаяСтраница");
	ОписаниеПрофиля.Роли.Добавить("РазделОрганайзер");
	ОписаниеПрофиля.Роли.Добавить("РазделРазработка");
	ОписаниеПрофиля.Роли.Добавить("РазделРазработкаКонфигурации");
	ОписаниеПрофиля.Роли.Добавить("РазделТестирование");
	ОписаниеПрофиля.Роли.Добавить("РазделТехническиеПроекты");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("РежимТехническогоСпециалиста");
	ОписаниеПрофиля.Роли.Добавить("СогласованиеТрудозатратПоЗадачам");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("СравнениеВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("УправлениеАвтотестированием");
	ОписаниеПрофиля.Роли.Добавить("УправлениеВетками");
	ОписаниеПрофиля.Роли.Добавить("УправлениеСтатусамиИдей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовДеятельности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовПланов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхУчетаВремени");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсточниковИдей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлючевыхОпераций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНСИСостоянийЗадачПроцессов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщихЗадач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОчередейРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРазделовОбщихЗадач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРезультатовВыполненияТестов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРезультатовРегистрацииОшибок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийТестированияВеток");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКоличестваЗапусковТестирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтандартовРазработки");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Проекты");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "Предустановленный");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Ведение регламентов".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "a1b08bf6-4c66-11e3-ad4f-e0cb4ed5f3d1";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ведение регламентов'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = ''");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРегламентов");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Проекты");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Выгрузка, проверка справки".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "6ed08842-4c63-11e3-ad4f-e0cb4ed5f3d1";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Выгрузка, проверка справки'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = ''");
	ОписаниеПрофиля.Роли.Добавить("ВыгрузкаПроверкаСправки");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Проекты");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Добавление, изменение сборок версии проекта".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "6ed08841-4c63-11e3-ad4f-e0cb4ed5f3d1";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Добавление, изменение сборок версии проекта'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = ''");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСборокВерсииПроекта");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Проекты");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Использование интеграции с АПК".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "b7e97e33-c474-11e3-bd85-e0cb4ed5f6da";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Использование интеграции с АПК'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = ''");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваСППР");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеИнтеграцииСАПК");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Использование интеграции с внешними системами".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "04773b20-b288-4d8d-a839-22761dacd44a";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Использование интеграции с внешними системами'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = ''");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваСППР");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеИнтеграцииСВнешнимиСистемами");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Планирование и управление техническими проектами".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "6ed08843-4c63-11e3-ad4f-e0cb4ed5f3d1";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Планирование и управление техническими проектами'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = ''");
	ОписаниеПрофиля.Роли.Добавить("ПланированиеИУправлениеТехническимиПроектами");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Проекты");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Планирование отработки ошибок".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "6ed08844-4c63-11e3-ad4f-e0cb4ed5f3d1";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Планирование отработки ошибок'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = ''");
	ОписаниеПрофиля.Роли.Добавить("ПланированиеОтработкиОшибок");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Проекты");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Пользователь (только просмотр)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "621b49b7-58fc-11e3-a963-e0cb4ed5f3d1";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Пользователь (только просмотр)'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = ''");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБИД");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваСППР");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиТекущиеДела");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыМоделированиеСистемы");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыНачальнаяСтраница");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыОрганайзер");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыРазработка");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыТестирование");
	ОписаниеПрофиля.Роли.Добавить("ПодключениеКХранилищу");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("РазделМоделированиеСистемы");
	ОписаниеПрофиля.Роли.Добавить("РазделНачальнаяСтраница");
	ОписаниеПрофиля.Роли.Добавить("РазделОрганайзер");
	ОписаниеПрофиля.Роли.Добавить("РазделРазработка");
	ОписаниеПрофиля.Роли.Добавить("РазделРазработкаКонфигурации");
	ОписаниеПрофиля.Роли.Добавить("РазделТестирование");
	ОписаниеПрофиля.Роли.Добавить("РазделТехническиеПроекты");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийОбъектовИнформацииОКонтроле");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийПроекта");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВеток");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовДеятельности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовДоступа");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыполненияОбщихЗадачПоПроектам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхОбИзмененииВВетках");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхОСостоянииЗагрузкиМетаданных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхУчетаВремени");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхХронометража");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовУчетВремени");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗадачПроцессов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапусковТестирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИдей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииОбИспользованииОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсточниковИдей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКалендарейПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКартинокСправки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлючевыхОпераций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМестИсправленияОшибок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЗамещенияПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЗапускаПроцессов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЗапускаТестирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекТестированияСценариев");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНСИСостоянийЗадачПроцессов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбработчиковОбновленияИнформационнойБазы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщихЗадач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъектовМетаданных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОчередейРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОшибок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПатчей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодсистем");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПравилПроверки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОсобогоПорядкаРазработкиОбработчиковОбновления");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрофилейПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроцессов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРазделовОбщихЗадач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРезультатовВыполненияТестов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегламетнов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРезультатовПроверкиОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРезультатовРегистрацииОшибок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийТестированияВеток");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКоличестваЗапусковТестирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокВерсииПроекта");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтандартовРазработки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтатусовВстраиванияМеханизмов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевРаботыПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТестов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТехническихПроектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФункцийМеханизмов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФункцийСистемы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦелевыхЗадач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаговСценариевПользователя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭталонныхБазТестирования");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Проекты");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "Предустановленный");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

	// Профиль "Пользователь, имеющий доступ".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "621b49b4-58fc-11e3-a963-e0cb4ed5f3d1";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Пользователь, имеющий доступ'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = ''");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБИД");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваСППР");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВерсийОбъектовИнформацииОКонтроле");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВеток");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовУчетВремени");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗадачПроцессов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОшибок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИдей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПатчей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанныхХронометража");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеКалендарейПользователей");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеНастроекУведомленийПользователя");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСобственныхНастроекЗамещенияПользователя");
	ОписаниеПрофиля.Роли.Добавить("ИнтеграцияФункциональнойМодели");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеИнтеграцииС1СДокументооборотом");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиТекущиеДела");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСинхронизацииКалендарей");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыМоделированиеСистемы");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыНачальнаяСтраница");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыОрганайзер");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыРазработка");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыТестирование");
	ОписаниеПрофиля.Роли.Добавить("ПодключениеКХранилищу");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("РазделМоделированиеСистемы");
	ОписаниеПрофиля.Роли.Добавить("РазделНачальнаяСтраница");
	ОписаниеПрофиля.Роли.Добавить("РазделОрганайзер");
	ОписаниеПрофиля.Роли.Добавить("РазделРазработка");
	ОписаниеПрофиля.Роли.Добавить("РазделРазработкаКонфигурации");
	ОписаниеПрофиля.Роли.Добавить("РазделТестирование");
	ОписаниеПрофиля.Роли.Добавить("РазделТехническиеПроекты");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("СравнениеВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийОбъектовИнформацииОКонтроле");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийПроекта");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВеток");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовДеятельности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовДоступа");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыполненияОбщихЗадачПоПроектам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхОбИзмененииВВетках");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхОСостоянииЗагрузкиМетаданных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхУчетаВремени");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапусковТестирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИдей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииОбИспользованииОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсточниковИдей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКартинокСправки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлючевыхОпераций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМестИсправленияОшибок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНСИСостоянийЗадачПроцессов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбработчиковОбновленияИнформационнойБазы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщихЗадач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъектовМетаданных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОчередейРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОшибок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПатчей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодсистем");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПравилПроверки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОсобогоПорядкаРазработкиОбработчиковОбновления");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрофилейПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроцессов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРазделовОбщихЗадач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегламетнов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРезультатовВыполненияТестов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРезультатовПроверкиОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРезультатовРегистрацииОшибок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийТестированияВеток");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКоличестваЗапусковТестирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокВерсииПроекта");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтандартовРазработки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевРаботыПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТестов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТехническихПроектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФункцийМеханизмов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФункцийСистемы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦелевыхЗадач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаговСценариевПользователя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭталонныхБазТестирования");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Проекты");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "Предустановленный");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Поручение изучения стандартов разработки".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "537b71c6-184d-4915-b842-8ab0f7de03a4";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Поручение изучения стандартов разработки'");
	ОписаниеПрофиля.Описание = НСтр("ru = 'Возможность установки состояния ""Требует изучения"" для стандартов разработки другим пользователям.'");
	ОписаниеПрофиля.Роли.Добавить("ПоручениеИзученияСтандартовРазработки");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Разработчик".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "621b49ba-58fc-11e3-a963-e0cb4ed5f3d1";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Разработчик'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = ''");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБИД");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваСППР");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ВыгрузкаСценариевПользователей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВерсийОбъектовИнформацииОКонтроле");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВеток");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовДоступа");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовПланов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовУчетВремени");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗадачПроцессов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаписейКонтроля");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаписейПланов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИдей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКартинокСправки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлючевыхОпераций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекЗапускаПроцессов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекЗапускаТестирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТестированияСценариев");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбработчиковОбновленияИнформационнойБазы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъектовМетаданных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбработчиковОбновленияИнформационнойБазы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОшибок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПатчей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистем");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПрофилейПользователей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроцессов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписковКонтроля");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСтатусовВстраиванияМеханизмов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСценариевРаботыПользователей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТестов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТехническихПроектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФункцийМеханизмов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФункцийСистемы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаговСценариевПользователя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭталонныхБазТестирования");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВнешнегоСоединения");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанныхОбИзмененииВВетках");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанныхХронометража");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеКалендарейПользователей");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеНастроекУведомленийПользователя");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРабочегоМестаПланирования");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРабочихМестКонтроля");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеРезультатовПроверкиОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСобственныхНастроекЗамещенияПользователя");
	ОписаниеПрофиля.Роли.Добавить("ИнтеграцияФункциональнойМодели");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеИнтеграцииС1СДокументооборотом");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиНастройкиЛокальногоЗапускаСценариев");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиТекущиеДела");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСинхронизацииКалендарей");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыМоделированиеСистемы");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыНачальнаяСтраница");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыОрганайзер");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыРазработка");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыТестирование");
	ОписаниеПрофиля.Роли.Добавить("ПодключениеКХранилищу");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("РазделМоделированиеСистемы");
	ОписаниеПрофиля.Роли.Добавить("РазделНачальнаяСтраница");
	ОписаниеПрофиля.Роли.Добавить("РазделОрганайзер");
	ОписаниеПрофиля.Роли.Добавить("РазделРазработка");
	ОписаниеПрофиля.Роли.Добавить("РазделРазработкаКонфигурации");
	ОписаниеПрофиля.Роли.Добавить("РазделТестирование");
	ОписаниеПрофиля.Роли.Добавить("РазделТехническиеПроекты");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("СравнениеВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("УправлениеСтатусамиИдей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийПроекта");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовДеятельности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовПланов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыполненияОбщихЗадачПоПроектам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхУчетаВремени");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапусковТестирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииОбИспользованииОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсточниковИдей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлючевыхОпераций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМестИсправленияОшибок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНСИСостоянийЗадачПроцессов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщихЗадач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОчередейРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПравилПроверки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОсобогоПорядкаРазработкиОбработчиковОбновления");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРазделовОбщихЗадач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегламетнов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРезультатовВыполненияТестов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРезультатовРегистрацииОшибок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийТестированияВеток");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКоличестваЗапусковТестирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокВерсииПроекта");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтандартовРазработки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦелевыхЗадач");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Проекты");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "Предустановленный");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Синхронизация стандартов разработки".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "779cf7de-6a03-4aeb-b24b-9a54d8b4e1a2";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Синхронизация стандартов разработки'");
	ОписаниеПрофиля.Описание = НСтр("ru = 'Профиль пользователя, обновляющего стандарты из внешней базы через OData.'");
	ОписаниеПрофиля.Роли.Добавить("ПоручениеИзученияСтандартовРазработки");
	ОписаниеПрофиля.Роли.Добавить("СинхронизацияСтандартовРазработки");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Тестер".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
	ОписаниеПрофиля.Идентификатор = "621b49b2-58fc-11e3-a963-e0cb4ed5f3d1";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Тестер'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = ''");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБИД");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваСППР");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ВыгрузкаСценариевПользователей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВерсийОбъектовИнформацииОКонтроле");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВеток");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовПланов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовУчетВремени");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗадачПроцессов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаписейКонтроля");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаписейПланов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекЗапускаПроцессов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекЗапускаТестирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТестированияСценариев");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОшибок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПатчей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСценариевРаботыПользователей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТестов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаговСценариевПользователя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭталонныхБазТестирования");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДанныхХронометража");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеКалендарейПользователей");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеНастроекУведомленийПользователя");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСобственныхНастроекЗамещенияПользователя");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписковКонтроля");
	ОписаниеПрофиля.Роли.Добавить("ИнтеграцияФункциональнойМодели");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеИнтеграцииС1СДокументооборотом");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиНастройкиЛокальногоЗапускаСценариев");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиТекущиеДела");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРабочегоМестаПланирования");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРабочихМестКонтроля");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСинхронизацииКалендарей");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыМоделированиеСистемы");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыНачальнаяСтраница");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыОрганайзер");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыРазработка");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыТестирование");
	ОписаниеПрофиля.Роли.Добавить("ПодключениеКХранилищу");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("РазделМоделированиеСистемы");
	ОписаниеПрофиля.Роли.Добавить("РазделНачальнаяСтраница");
	ОписаниеПрофиля.Роли.Добавить("РазделОрганайзер");
	ОписаниеПрофиля.Роли.Добавить("РазделРазработка");
	ОписаниеПрофиля.Роли.Добавить("РазделРазработкаКонфигурации");
	ОписаниеПрофиля.Роли.Добавить("РазделТестирование");
	ОписаниеПрофиля.Роли.Добавить("РазделТехническиеПроекты");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("СравнениеВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийОбъектовИнформацииОКонтроле");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийПроекта");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовДеятельности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовДоступа");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовПланов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыполненияОбщихЗадачПоПроектам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхОбИзмененииВВетках");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхОСостоянииЗагрузкиМетаданных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхУчетаВремени");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапусковТестирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИдей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииОбИспользованииОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсточниковИдей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКартинокСправки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлючевыхОпераций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМестИсправленияОшибок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНСИСостоянийЗадачПроцессов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбработчиковОбновленияИнформационнойБазы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщихЗадач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъектовМетаданных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОчередейРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодсистем");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПравилПроверки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОсобогоПорядкаРазработкиОбработчиковОбновления");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрофилейПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроцессов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРазделовОбщихЗадач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегламетнов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРезультатовВыполненияТестов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРезультатовПроверкиОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРезультатовРегистрацииОшибок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийТестированияВеток");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКоличестваЗапусковТестирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокВерсииПроекта");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтандартовРазработки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТехническихПроектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФункцийМеханизмов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФункцийСистемы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦелевыхЗадач");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Проекты");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "Предустановленный");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Управление стандартами разработки".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "c8622462-e439-46a4-93ee-21cd407f0490";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Управление стандартами разработки'");
	ОписаниеПрофиля.Описание = НСтр("ru = 'Редактирование и настройка синхронизации стандартов.'");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСтандартовРазработки");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Добавление, изменение общих задач".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "e370ba68-2f7e-48d5-b9b8-30e830079ca2";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Управление общими задачами'");
	ОписаниеПрофиля.Описание = НСтр("ru = 'Добавление, изменение общих задач.'");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбщихЗадач");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРазделовОбщихЗадач");
	ОписаниеПрофиля.Роли.Добавить("ПланированиеВыполнениеОбщихЗадачПоПроектам");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Управление ключевыми операциями".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "eeae6dae-b5a9-4c48-b0ac-6b91256c858d";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Управление ключевыми операциями'");
	ОписаниеПрофиля.Описание = НСтр("ru = 'Управление важностью ключевых операций.'");
	ОписаниеПрофиля.Роли.Добавить("УправлениеКлючевымиОперациями");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Проекты");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Управление ветками".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "03c591eb-0120-4ab5-bdc6-25e37f86143e";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Управление ветками'");
	ОписаниеПрофиля.Описание = НСтр("ru = 'Управление ветками.'");
	ОписаниеПрофиля.Роли.Добавить("УправлениеВетками");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Проекты");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Профиль "Управление автотестированием".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "bcc25eae-d2d7-4a83-bc77-5cc119b5eb2a";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Управление автотестированием'");
	ОписаниеПрофиля.Описание = НСтр("ru = 'Управление автотестированием.'");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапусковТестирования");
	ОписаниеПрофиля.Роли.Добавить("УправлениеАвтотестированием");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Проекты");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

// Заполняет зависимости прав доступа "подчиненного" объекта (например, задачи ЗадачаИсполнителя),
// от "ведущего" объекта (например,  бизнес-процесса Задание), которые отличаются от стандартных.
//
// Зависимости прав используются в стандартном шаблоне ограничения доступа для вида доступа "Объект".
// 1. Стандартно при чтении "подчиненного" объекта
//    проверяется наличие права чтения "ведущего" объекта и
//    проверяется отсутствие ограничения чтения "ведущего" объекта.
// 2. Стандартно при добавлении, изменении, удалении "подчиненного" объекта
//    проверяется наличие права изменения "ведущего" объекта и
//    проверяется отсутствие ограничения изменения "ведущего" объекта.
//
// Допускается только одно переназначение по сравнению со стандартным -
// в пункте 2 вместо проверки права изменения "ведущего" объекта установить
// проверку права чтения "ведущего" объекта.
//
// Параметры:
//  ЗависимостиПрав - ТаблицаЗначений:
//   * ВедущаяТаблица     - Строка - например Метаданные.БизнесПроцессы.Задание.ПолноеИмя().
//   * ПодчиненнаяТаблица - Строка - например Метаданные.Задачи.ЗадачаИсполнителя.ПолноеИмя().
//
Процедура ПриЗаполненииЗависимостейПравДоступа(ЗависимостиПрав) Экспорт
	
	
	
КонецПроцедуры

// Заполняет описания возможных прав, назначаемых для объектов указанных типов.
//
// Параметры:
//  ВозможныеПрава - ТаблицаЗначений:
//   * ВладелецПрав - Строка - полное имя таблицы значения доступа.
//
//   * Имя          - Строка - идентификатор права, например ИзменениеПапок. Право с именем УправлениеПравами
//                  должно быть обязательно определено для общей формы настройки прав "Права доступа".
//                  УправлениеПравами - это право на изменение прав по владельцу прав, которое проверяется
//                  при открытии ОбщаяФорма.НастройкиПравОбъектов.
//
//   * Заголовок    - Строка - заголовок права, например в форме НастройкиПравОбъектов:
//                  "Изменение.
//                  |папок".
//
//   * Подсказка    - Строка - подсказка к заголовку права,
//                  например "Добавление, изменение и пометка удаления папок".
//
//   * НачальноеЗначение - Булево - начальное значение флажка права при добавлении новой строки
//                  в форме "Права доступа".
//
//   * ТребуемыеПрава - Массив из Строка - имена прав, требуемых для этого права -
//                  например, право "ДобавлениеФайлов" требует права "ИзменениеФайлов".
//
//   * ЧтениеВТаблицах - Массив из Строка - полные имена таблиц, для которых это право обозначает право Чтение.
//                  Возможно использование символа "*", который обозначает "для всех остальных таблиц",
//                  т.к. право Чтение может зависеть только от права Чтение, то имеет смысл только символ "*"
//                  (требуется для работы шаблонов ограничения доступа).
//
//   * ИзменениеВТаблицах - Массив из Строка - полные имена таблиц, для которых это право обозначает право Изменение.
//                  Возможно использование символа "*", который обозначает "для всех остальных таблиц"
//                  (требуется для работы шаблонов ограничения доступа).
//
Процедура ПриЗаполненииВозможныхПравДляНастройкиПравОбъектов(ВозможныеПрава) Экспорт
	
КонецПроцедуры

// Определяет вид используемого интерфейса пользователя для настройки доступа.
//
// Параметры:
//  УпрощенныйИнтерфейс - Булево - начальное значение Ложь.
//
Процедура ПриОпределенииИнтерфейсаНастройкиДоступа(УпрощенныйИнтерфейс) Экспорт
	
КонецПроцедуры

// Заполняет использование видов доступа в зависимости от функциональных опций конфигурации,
// например, ИспользоватьГруппыДоступаНоменклатуры.
//
// Параметры:
//  ВидДоступа    - Строка - имя вида доступа, заданное в процедуре ПриЗаполненииВидовДоступа.
//  Использование - Булево - начальное значение Истина.
// 
Процедура ПриЗаполненииИспользованияВидаДоступа(ВидДоступа, Использование) Экспорт
	
	
	
КонецПроцедуры

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Список - ОбъектМетаданных - список, для которого нужно вернуть текст ограничения.
//                              В процедуре ПриЗаполненииСписковСОграничениемДоступа нужно
//                              указать для списка значение Ложь, иначе вызова не будет.
//
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Список, Ограничение) Экспорт
	
	
	
КонецПроцедуры

// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые в шаблонах ограничения доступа
// явно, а виды доступа, используемые в наборах значений доступа могут быть получены из текущего
// состояния регистра сведений НаборыЗначенийДоступа.
//
//  Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  Описание     - Строка - многострочная строка формата <Таблица>.<Право>.<ВидДоступа>[.Таблица объекта],
//                 например, "Документ.ПриходнаяНакладная.Чтение.Организации",
//                           "Документ.ПриходнаяНакладная.Чтение.Контрагенты",
//                           "Документ.ПриходнаяНакладная.Изменение.Организации",
//                           "Документ.ПриходнаяНакладная.Изменение.Контрагенты",
//                           "Документ.ЭлектронныеПисьма.Чтение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.ЭлектронныеПисьма.Изменение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.Файлы.Чтение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Чтение.Объект.Документ.ЭлектронноеПисьмо",
//                           "Документ.Файлы.Изменение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Изменение.Объект.Документ.ЭлектронноеПисьмо".
//                 Вид доступа Объект предопределен, как литерал. Этот вид доступа используется в
//                 шаблонах ограничений доступа, как "ссылка" на другой объект, по которому
//                 ограничивается текущий объект таблицы.
//                 Когда вид доступа "Объект" задан, также требуется задать типы таблиц,
//                 которые используются для этого вида доступа. Т.е. перечислить типы,
//                 которые соответствуют полю, использованному в шаблоне ограничения доступа
//                 в паре с видом доступа "Объект". При перечислении типов по виду доступа "Объект"
//                 нужно перечислить только те типы поля, которые есть
//                 у поля РегистрыСведений.НаборыЗначенийДоступа.Объект, остальные типы лишние.
// 
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
	|Справочник.WebСервисыСвойства.Чтение.Проекты
	|Справочник.WebСервисыСвойства.Изменение.Проекты
	|Справочник.WSСсылкиСвойства.Чтение.Проекты
	|Справочник.WSСсылкиСвойства.Изменение.Проекты
	|Справочник.ВерсииПроекта.Чтение.Проекты
	|Справочник.ВерсииПроекта.Изменение.Проекты
	|Справочник.ВерсииФайлов.Чтение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Чтение.Проекты
	|Справочник.ВерсииФайлов.Изменение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Изменение.Проекты
	|Справочник.Ветки.Чтение.Проекты
	|Справочник.Ветки.Изменение.Проекты
	|Справочник.ВидыДоступа.Чтение.Проекты
	|Справочник.ВидыДоступа.Изменение.Проекты
	|Справочник.ГруппыКомандСвойства.Чтение.Проекты
	|Справочник.ГруппыКомандСвойства.Изменение.Проекты
	|Справочник.ЗадачиПроцесса.Чтение.Объект.Справочник.ЗадачиПроцесса
	|Справочник.ЗадачиПроцесса.Изменение.Объект.Справочник.ЗадачиПроцесса
	|Справочник.ЗадачиШаблонаПроцесса.Изменение.Проекты
	|Справочник.Идеи.Чтение.Проекты
	|Справочник.Идеи.Изменение.Проекты
	|Справочник.КартинкиСправки.Чтение.Проекты
	|Справочник.КартинкиСправки.Изменение.Проекты
	|Справочник.КлючевыеОперации.Чтение.Проекты
	|Справочник.КлючевыеОперации.Изменение.Проекты
	|Справочник.КомандыОбъектовМетаданных.Чтение.Проекты
	|Справочник.КомандыОбъектовМетаданных.Изменение.Проекты
	|Справочник.КритерииОтбораСвойства.Чтение.Проекты
	|Справочник.КритерииОтбораСвойства.Изменение.Проекты
	|Справочник.МакетыОбъектовМетаданных.Чтение.Проекты
	|Справочник.МакетыОбъектовМетаданных.Изменение.Проекты
	|Справочник.МестаИсправленияОшибок.Чтение.Проекты
	|Справочник.МестаИсправленияОшибок.Изменение.Проекты
	|Справочник.НастройкиЗапускаПроцессов.Чтение.Проекты
	|Справочник.НастройкиЗапускаПроцессов.Изменение.Проекты
	|Справочник.НастройкиЗапускаСценариев.Чтение.Проекты
	|Справочник.НастройкиЗапускаСценариев.Изменение.Проекты
	|Справочник.НастройкиЗапускаТестирования.Чтение.Проекты
	|Справочник.НастройкиЗапускаТестирования.Изменение.Проекты
	|Справочник.ОбработчикиОбновленияИнформационнойБазы.Чтение.Проекты
	|Справочник.ОбработчикиОбновленияИнформационнойБазы.Изменение.Проекты
	|Справочник.ОбщиеКомандыСвойства.Чтение.Проекты
	|Справочник.ОбщиеКомандыСвойства.Изменение.Проекты
	|Справочник.ОбщиеМакетыСвойства.Чтение.Проекты
	|Справочник.ОбщиеМакетыСвойства.Изменение.Проекты
	|Справочник.ОбщиеМодулиСвойства.Чтение.Проекты
	|Справочник.ОбщиеМодулиСвойства.Изменение.Проекты
	|Справочник.ОбщиеРеквизитыСвойства.Чтение.Проекты
	|Справочник.ОбщиеРеквизитыСвойства.Изменение.Проекты
	|Справочник.ОбъектыМетаданных.Чтение.Проекты
	|Справочник.ОбъектыМетаданных.Изменение.Проекты
	|Справочник.Ошибки.Чтение.Проекты
	|Справочник.Ошибки.Изменение.Проекты
	|Справочник.ПакетыXDTOСвойства.Чтение.Проекты
	|Справочник.ПакетыXDTOСвойства.Изменение.Проекты
	|Справочник.Патчи.Чтение.Проекты
	|Справочник.Патчи.Изменение.Проекты
	|Справочник.ПодпискиНаСобытияСвойства.Чтение.Проекты
	|Справочник.ПодпискиНаСобытияСвойства.Изменение.Проекты
	|Справочник.Подсистемы.Чтение.Проекты
	|Справочник.Подсистемы.Изменение.Проекты
	|Справочник.ПоследовательностиСвойства.Чтение.Проекты
	|Справочник.ПоследовательностиСвойства.Изменение.Проекты
	|Справочник.ПредопределенныеДанные.Чтение.Проекты
	|Справочник.ПредопределенныеДанные.Изменение.Проекты
	|Справочник.ПричиныОсобогоПорядкаРазработкиОбработчиковОбновления.Чтение.Проекты
	|Справочник.ПричиныОсобогоПорядкаРазработкиОбработчиковОбновления.Изменение.Проекты
	|Справочник.Проекты.Чтение.Проекты
	|Справочник.Проекты.Изменение.Проекты
	|Справочник.ПрофилиПользователей.Чтение.Проекты
	|Справочник.ПрофилиПользователей.Изменение.Проекты
	|Справочник.Процессы.Чтение.Проекты
	|Справочник.Процессы.Изменение.Проекты
	|Справочник.РазделыПроекта.Чтение.Проекты
	|Справочник.РазделыПроекта.Изменение.Проекты
	|Справочник.РегламентныеЗаданияСвойства.Чтение.Проекты
	|Справочник.РегламентныеЗаданияСвойства.Изменение.Проекты
	|Справочник.Регламенты.Чтение.Проекты
	|Справочник.Регламенты.Изменение.Проекты
	|Справочник.РеквизитыОбъектовМетаданных.Чтение.Проекты
	|Справочник.РеквизитыОбъектовМетаданных.Изменение.Проекты
	|Справочник.СборкиВерсии.Чтение.Проекты
	|Справочник.СборкиВерсии.Изменение.Проекты
	|Справочник.СценарииРаботыПользователей.Чтение.Проекты
	|Справочник.СценарииРаботыПользователей.Изменение.Проекты
	|Справочник.Тесты.Чтение.Проекты
	|Справочник.Тесты.Изменение.Проекты
	|Справочник.ТехническиеПроекты.Чтение.Проекты
	|Справочник.ТехническиеПроекты.Изменение.Проекты
	|Справочник.Файлы.Чтение.ВнешниеПользователи
	|Справочник.Файлы.Чтение.Проекты
	|Справочник.Файлы.Изменение.ВнешниеПользователи
	|Справочник.Файлы.Изменение.Проекты
	|Справочник.ФормыОбъектовМетаданных.Чтение.Проекты
	|Справочник.ФормыОбъектовМетаданных.Изменение.Проекты
	|Справочник.ФункцииМеханизмов.Чтение.Проекты
	|Справочник.ФункцииМеханизмов.Изменение.Проекты
	|Справочник.ФункцииСистемы.Чтение.Проекты
	|Справочник.ФункцииСистемы.Изменение.Проекты
	|Справочник.ФункциональныеОпцииСвойства.Чтение.Проекты
	|Справочник.ФункциональныеОпцииСвойства.Изменение.Проекты
	|Справочник.ЦелевыеЗадачи.Чтение.Проекты
	|Справочник.ЦелевыеЗадачи.Изменение.Проекты
	|Справочник.ШаблоныПроцесса.Изменение.Проекты
	|Справочник.ШагиПроцесса.Чтение.Проекты
	|Справочник.ШагиПроцесса.Изменение.Проекты
	|Справочник.ЭлементыСправки.Чтение.Проекты
	|Справочник.ЭлементыСправки.Изменение.Проекты
	|Справочник.ЭталонныеБазыТестирования.Чтение.Проекты
	|Справочник.ЭталонныеБазыТестирования.Изменение.Проекты
	|Документ.ЗапускТестирования.Чтение.Проекты
	|Документ.ЗапускТестирования.Изменение.Проекты
	|Документ.УчетВремени.Чтение.Пользователи
	|Документ.УчетВремени.Изменение.Пользователи
	|РегистрСведений.ВерсииОбъектов.Чтение.Проекты
	|РегистрСведений.ВерсииОбъектов.Изменение.Проекты
	|РегистрСведений.ВыполнениеОбщихЗадач.Чтение.Проекты
	|РегистрСведений.ВыполнениеОбщихЗадач.Изменение.Проекты
	|РегистрСведений.ДатыИзмененияОбъектов.Чтение.Проекты
	|РегистрСведений.ДатыИзмененияОбъектов.Изменение.Проекты
	|РегистрСведений.ЗамещениеПользователейПоРаботеСОшибками.Изменение.Пользователи
	|РегистрСведений.ИзмененияВВетках.Чтение.Проекты
	|РегистрСведений.ИзмененияВВетках.Изменение.Проекты
	|РегистрСведений.ИспользованиеОбъектов.Чтение.Проекты
	|РегистрСведений.КалендариПользователей.Чтение.Пользователи
	|РегистрСведений.КалендариПользователей.Изменение.Пользователи
	|РегистрСведений.КонтрольИзменений.Изменение.Пользователи
	|РегистрСведений.НастройкиПоддержки.Чтение.Проекты
	|РегистрСведений.НастройкиПоддержки.Изменение.Проекты
	|РегистрСведений.НастройкиУведомленийПользователей.Чтение.Пользователи
	|РегистрСведений.НастройкиУведомленийПользователей.Чтение.Проекты
	|РегистрСведений.НастройкиУведомленийПользователей.Изменение.Пользователи
	|РегистрСведений.НастройкиУведомленийПользователей.Изменение.Проекты
	|РегистрСведений.ВерсииПатчей.Чтение.Проекты
	|РегистрСведений.ВерсииПатчей.Изменение.Проекты
	|РегистрСведений.ПерсональныеНастройкиУведомленийПользователей.Чтение.Пользователи
	|РегистрСведений.ПерсональныеНастройкиУведомленийПользователей.Изменение.Пользователи
	|РегистрСведений.ПраваДоступаКОбъектамМетаданных.Чтение.Проекты
	|РегистрСведений.ПраваДоступаКОбъектамМетаданных.Изменение.Проекты
	|РегистрСведений.ПриоритетыВыполненияОбработчиковОбновления.Чтение.Проекты
	|РегистрСведений.ПриоритетыВыполненияОбработчиковОбновления.Изменение.Проекты
	|РегистрСведений.ПроблемыОбработчиковОбновленияИнформационнойБазы.Чтение.Проекты
	|РегистрСведений.ПроблемыОбработчиковОбновленияИнформационнойБазы.Изменение.Проекты
	|РегистрСведений.РезультатыВыполненияТестов.Чтение.Проекты
	|РегистрСведений.РезультатыПроверкиОбъектов.Чтение.Проекты
	|РегистрСведений.РезультатыПроверкиОбъектов.Изменение.Проекты
	|РегистрСведений.РезультатыРегистрацииОшибок.Чтение.Проекты
	|РегистрСведений.СостояниеЗагрузкиМетаданныхВВетках.Чтение.Проекты
	|РегистрСведений.СостояниеТестированияВеток.Чтение.Проекты
	|РегистрСведений.КоличествоЗапусковТестирования.Чтение.Проекты
	|РегистрСведений.СтатусыВстраиванияМеханизмов.Чтение.Проекты
	|РегистрСведений.СтатусыВстраиванияМеханизмов.Изменение.Проекты
	|РегистрСведений.ЭтапыПроцесса.Чтение.Проекты
	|РегистрНакопления.УчетВремени.Чтение.Проекты
	|РегистрНакопления.УчетВремени.Чтение.Пользователи"
	;
	
КонецПроцедуры

// Позволяет реализовать перезапись зависимых наборов значений доступа других объектов.
//
// Вызывается из процедур
//  УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа,
//  УправлениеДоступомСлужебный.ЗаписатьЗависимыеНаборыЗначенийДоступа.
//
// Параметры:
//  Ссылка       - СправочникСсылка, ДокументСсылка, ... - ссылка на объект, для которого
//                 записаны наборы значений доступа.
//
//  СсылкиНаЗависимыеОбъекты - Массив - массив элементов типа СправочникСсылка, ДокументСсылка, ...
//                 Содержит ссылки на объекты с зависимыми наборами значений доступа.
//                 Начальное значение - пустой массив.
//
Процедура ПриИзмененииНаборовЗначенийДоступа(Ссылка, СсылкиНаЗависимыеОбъекты) Экспорт
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ОбработчикиОбновленияИнформационнойБазы")
	  Или ТипЗнч(Ссылка) = Тип("СправочникСсылка.ОбъектыМетаданных")
	  Или ТипЗнч(Ссылка) = Тип("СправочникСсылка.ПрофилиПользователей")
	  Или ТипЗнч(Ссылка) = Тип("СправочникСсылка.Процессы")
	  Или ТипЗнч(Ссылка) = Тип("СправочникСсылка.ТехническиеПроекты")
	  Или ТипЗнч(Ссылка) = Тип("СправочникСсылка.ФункцииСистемы")
	  Или ТипЗнч(Ссылка) = Тип("СправочникСсылка.ФункцииМеханизмов") Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЗадачиПроцесса.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЗадачиПроцесса КАК ЗадачиПроцесса
		|ГДЕ
		|	ЗадачиПроцесса.Предмет = &Предмет");
		
		Запрос.УстановитьПараметр("Предмет", Ссылка);
		СсылкиНаЗависимыеОбъекты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти