#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.РежимРазработки.БезИзменений);
	ДанныеВыбора.Добавить(Перечисления.РежимРазработки.ВGitРепозитории);
	ДанныеВыбора.Добавить(Перечисления.РежимРазработки.ВХранилище);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

