#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтруктураОтбора = Новый Структура;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ОбъектыМетаданных")
		ИЛИ ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Подсистемы") Тогда
		СтруктураОтбора.Вставить("ОбъектМетаданных", ПараметрКоманды);
	Иначе
		СтруктураОтбора.Вставить("ПодчиненныйОбъект", ПараметрКоманды);
	КонецЕсли;
	
	СтруктураБыстрогоОтбора = Новый Структура;
	
	СтруктураБыстрогоОтбора.Вставить("СтатусСогласования", Неопределено);
	СтруктураБыстрогоОтбора.Вставить("Согласующий", Неопределено);
	СтруктураБыстрогоОтбора.Вставить("СтатусВетки", Неопределено);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Отбор", СтруктураОтбора);
	ПараметрыОткрытия.Вставить("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	ПараметрыОткрытия.Вставить("КлючНазначенияИспользования", "ИзмененияОбъектовВВетках");
	
	ОткрытьФорму("РегистрСведений.ИзмененияВВетках.Форма.ИзмененияВВетках",
	             ПараметрыОткрытия,
				 ПараметрыВыполненияКоманды.Источник,
				 ПараметрыВыполненияКоманды.Уникальность,
				 ПараметрыВыполненияКоманды.Окно,
				 ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти
