#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокИБДерево = ОбщегоНазначенияСППР.СформироватьСписокЗарегистрированныхБаз(Параметры);
	
	ЗначениеВРеквизитФормы(СписокИБДерево, "СписокИБ");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура СписокИБВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбратьБазуИЗакрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьБазу(Команда)
	
	ВыбратьБазуИЗакрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьБазуИЗакрыть()

	ВыбраннаяСтрока = Элементы.СписокИБ.ТекущиеДанные;
	
	Если ВыбраннаяСтрока = Неопределено ИЛИ ВыбраннаяСтрока.Folder Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ФайловыйРежим", ВыбраннаяСтрока.ФайловыйРежим);
	Результат.Вставить("ИмяСервера", ВыбраннаяСтрока.ИмяСервера);
	Результат.Вставить("КаталогИБ", ВыбраннаяСтрока.КаталогИБ);
	Результат.Вставить("ИмяИБ", ВыбраннаяСтрока.ИмяИБ);
	Результат.Вставить("НаименованиеБазы", ВыбраннаяСтрока.ИнформационнаяБаза);
	Результат.Вставить("СтрокаСоединения", ВыбраннаяСтрока.СтрокаСоединения);
	Результат.Вставить("Version", ВыбраннаяСтрока.Version);
	
	Закрыть(Результат);
	
КонецПроцедуры
 
#КонецОбласти
