
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Проект = Параметры.Проект;
	ВидОписания = Параметры.ВидОписания;
	
	Если ВидОписания = "ОписаниеТехническогоПроекта" Тогда
		Заголовок = НСтр("ru='Шаблон описания технического проекта'");
	КонецЕсли;
	
	ФорматированноеОписание = Параметры.ШаблонОписания;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ФорматированноеОписание);
	
КонецПроцедуры

#КонецОбласти
