
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Автор = Параметры.Автор;
	Дата = Параметры.Дата;
	Статус = Параметры.Статус;
	ВерсияМсправления = Параметры.ВерсияИсправления;
	СрочностьИсправления = Параметры.СрочностьИсправления;
	КомуНаправлена = Параметры.КомуНаправлена;
	Комментарий = Параметры.Комментарий;
	
	ОбработатьВозможностьРедактирования(Параметры.ДоступноРедактирование);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(Комментарий);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьВозможностьРедактирования(ДоступноРедактирование)
	
	Элементы.Комментарий.ТолькоПросмотр = НЕ ДоступноРедактирование;
	Элементы.Комментарий.РедактированиеТекста = ДоступноРедактирование;
	
	Если Элементы.Найти("ФормаОК") <> Неопределено Тогда
		Элементы.ФормаОК.Видимость = ДоступноРедактирование;
		
		Если ДоступноРедактирование Тогда
			Элементы.ФормаОК.КнопкаПоУмолчанию = Истина;
		Иначе
			Элементы.ФормаЗакрыть.КнопкаПоУмолчанию = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти