#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокСвязей = Новый Массив;
	
	Если Параметры.Свойство("СписокСвязей") Тогда
		СписокСвязей = Параметры.СписокСвязей;
	КонецЕсли;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Список.Параметры.УстановитьЗначениеПараметра("СписокСвязей", СписокСвязей);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Ключ", Элемент.ТекущиеДанные.Ссылка);
	
	Если Элемент.ТекущиеДанные.ЭтоГруппа Тогда
		ОткрытьФорму("Справочник.ФункцииСистемы.ФормаГруппы", ПараметрыФормы);
	Иначе
		ОткрытьФорму("Справочник.ФункцииСистемы.ФормаОбъекта", ПараметрыФормы);
	КОнецЕсли;
	
КонецПроцедуры

#КонецОбласти
