
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		МассивДопустимыхКлассов = МассивКлассовИмеющихТабличнуюЧасть();
		
		ИмяКласса = РаботаСОбъектамиМетаданных.ИмяКлассаОбъектаМетаданных(Объект.Владелец);
		
		Если МассивДопустимыхКлассов.Найти(ИмяКласса) = Неопределено Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ВеткаИсточник.Видимость = (Объект.ВидРеквизита = Перечисления.ВидыРеквизитов.ТабличнаяЧасть);
	Элементы.ПрисутствуетВОсновномХранилище.Видимость = (Объект.ВидРеквизита = Перечисления.ВидыРеквизитов.ТабличнаяЧасть);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МассивКлассовИмеющихТабличнуюЧасть()
	
	Массив = Новый Массив();
	
		Массив.Добавить("Справочники");
		Массив.Добавить("Документы");
		Массив.Добавить("Отчеты");
		Массив.Добавить("Обработки");
		Массив.Добавить("ПланыВидовХарактеристик");
		Массив.Добавить("ПланыСчетов");
		Массив.Добавить("ПланыВидовРасчета");
		Массив.Добавить("БизнесПроцессы");
		Массив.Добавить("Задачи");
		Массив.Добавить("ПланыОбмена");
		 
	Возврат Массив;
	
КонецФункции

#КонецОбласти
