#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаписатьНаборПоПредмету(Предмет, ТаблицаСогласующих) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Предмет.Установить(Предмет);
	
	Для Каждого СтрокаТаблицы Из ТаблицаСогласующих Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Согласующий) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Предмет           = Предмет;
		НоваяЗапись.СогласуемыйРесурс = СтрокаТаблицы.СогласуемыйРесурс;
		НоваяЗапись.Согласующий       = СтрокаТаблицы.Согласующий;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();

КонецПроцедуры

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий


#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции


#КонецОбласти

#КонецЕсли