
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Список.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ТекущийПользователь);
	Список.Параметры.УстановитьЗначениеПараметра("ВидОбъекта", Версионирование.ВидВерсионируемогоОбъекта(Справочники.ПрофилиПользователей.ПустаяСсылка()));
	
	Если Параметры.Свойство("ЗаголовокФормы") Тогда
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок     = Параметры.ЗаголовокФормы;
	КонецЕсли;
	
	УстановитьУсловноеОформлениеСписка();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьПрограммуНачальногоЗаполненияПрофилей(Команда)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ОписаниеНачальногоЗаполненияПрофилей());
	ТекстЗаголовка = НСтр("ru='Описание начального заполнения имеющихся профилей групп доступа'");
	ТекстовыйДокумент.Показать(ТекстЗаголовка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеСписка()
	
	УсловноеОформлениеСписка = Список.КомпоновщикНастроек.Настройки.УсловноеОформление;
	УсловноеОформлениеСписка.Элементы.Очистить();
	
	ОбщегоНазначенияСППР.УстановитьУсловноеОформлениеСпискаОтветственный(УсловноеОформлениеСписка);
	КонтрольИзменений.УстановитьУсловноеОформлениеСпискаСостояниеКонтроля(УсловноеОформлениеСписка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОписаниеНачальногоЗаполненияПрофилей()
	
	ТекущийПроект = ПараметрыСеанса.ТекущийПроект;
	Возврат Справочники.ПрофилиПользователей.ОписаниеНачальногоЗаполненияПрофилейНаВстроенномЯзыке(ТекущийПроект);
	
КонецФункции

#КонецОбласти