#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ОбработчикПисатель", Запись.ОбработчикПисатель);
	ПараметрыОповещения.Вставить("ОбработчикЧитательИлиПисатель", Запись.ОбработчикЧитательИлиПисатель);
	ПараметрыОповещения.Вставить("ОбъектМетаданных", Запись.ОбъектМетаданных);
	ПараметрыОповещения.Вставить("Статус", Запись.Статус);
	
	Оповестить("Запись_КонфликтыОбработчиковОбновленияИнформационнойБазы", ПараметрыОповещения); 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти