#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТабДок              = Параметры.Макет;
	ИсходныйНомерСтроки = Параметры.ИсходныйНомерСтроки;
	ИмяТЧ               = Параметры.ИмяТЧ;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	Структура = Новый Структура;
	Структура.Вставить("Макет",ТабДок);
	Структура.Вставить("ИсходныйНомерСтроки",ИсходныйНомерСтроки);
	Структура.Вставить("ИмяТЧ",ИмяТЧ);
	Структура.Вставить("ЗавершеноРедактированиеМакетаНастройкиТеста",Истина);
	ОповеститьОВыборе(Структура);
КонецПроцедуры

#КонецОбласти