
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПодключенияАПК = Константы.ПараметрыПодключенияАПК.СоздатьМенеджерЗначения().ПолучитьПараметры();
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ПараметрыПодключенияАПК);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	СохранитьПараметрыПодключения();
	ОбновитьПовторноИспользуемыеЗначения();
	
	Модифицированность = Ложь;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьПараметрыПодключения()
	
	Константы.ПараметрыПодключенияАПК.СоздатьМенеджерЗначения().СохранитьПараметры(ИмяПользователя, ПарольПользователя);
	
КонецПроцедуры

#КонецОбласти
