
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтруктураОтбора = Новый Структура("Владелец", ПараметрКоманды);
	
	ПараметрыФормы = Новый Структура("КлючВарианта, Отбор, СформироватьПриОткрытии, ВидимостьКомандВариантовОтчетов", 
		"ТрудоемкостьЗадачКонтекстный",
		СтруктураОтбора, 
		Истина,
		Ложь);
		
	ОткрытьФорму(
		"Отчет.ТрудоемкостьЗадач.Форма",
		ПараметрыФормы, ,
		Истина,
		ПараметрыВыполненияКоманды.Окно);
		
КонецПроцедуры

#КонецОбласти