#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить(Перечисления.СостоянияИсправленияОшибок.ТребуетсяИсправление);
	СписокВыбора.Добавить(Перечисления.СостоянияИсправленияОшибок.Исправлена);
	СписокВыбора.Добавить(Перечисления.СостоянияИсправленияОшибок.ИсправлениеНеПланируется);
	СписокВыбора.Добавить(Перечисления.СостоянияИсправленияОшибок.ОшибкиНеБылоВЭтойВетке);
		
	ДанныеВыбора = СписокВыбора;
	
	СтандартнаяОбработка = Ложь;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
