Функция Узел() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", "Сборки");
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОбменДаннымиССервисомПубликации.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.ОбменДаннымиССервисомПубликации КАК ОбменДаннымиССервисомПубликации
		|ГДЕ
		|	ОбменДаннымиССервисомПубликации.Наименование = &Наименование
		|	И НЕ ОбменДаннымиССервисомПубликации.ЭтотУзел";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Узел = Выборка.Ссылка;
	Иначе
		НачатьТранзакцию();
		
		Попытка
			УзелОбъект = СоздатьУзел();
			УзелОбъект.УстановитьНовыйКод("1");
			УзелОбъект.Наименование = "Сборки";
			УзелОбъект.Записать();
			Узел = УзелОбъект.Ссылка;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЕсли;
	
	Возврат Узел;
	
КонецФункции
