#Область ПрограммныйИнтерфейс

// Возвращает строковое представление для типа редактора с обычным текстом
Функция ТипРедактораОбычныйТекст() Экспорт
	Возврат "ОбычныйТекст";
КонецФункции	

// Возвращает строковое представление для типа редактора форматированный документ
Функция ТипРедактораФорматированныйДокумент() Экспорт
	Возврат "ФорматированныйДокумент";
КонецФункции	

// Возвращает строковое представление для типа редактора Основной
Функция ТипРедактораОсновной() Экспорт
	Возврат "Основной";
КонецФункции	

// Возвращает версию встроенного редактора
Функция ВерсияРедактора() Экспорт
	Возврат "1.3.6.8";
КонецФункции	

// Проверяет, что текст ошибки соответствует ошибке отстутствия ветки в репозитории
// Параметры:
//  ТекстОшибкиВеткаНеНайдена - Строка
//
Функция ТекстОшибкиВеткаНеНайдена(ТекстОшибки) Экспорт
	
	Если Найти(НРег(ТекстОшибки), НРег("Branch Not Found")) > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции	

#КонецОбласти