#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ОчиститьСообщения();
	
	Если НЕ НеПризнавать И НЕ Отозвать И НЕ Закрыть Тогда
		ТекстСообщения = НСтр("ru='Не выбраны действия по обработке ошибок. Установите соответствующие флажки для выполнения требуемых действий'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСОобщения);
		Возврат;
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("ПричиныНепризнания", ПричиныНепризнания);
	Структура.Вставить("ПубликуемоеОписание", ПубликуемоеОписание);
	Структура.Вставить("КомуНаправлена", КомуНаправить);
	Структура.Вставить("Комментарий", Комментарий);
	Структура.Вставить("НеПризнавать", НеПризнавать);
	Структура.Вставить("Отозвать", Отозвать);
	Структура.Вставить("Закрыть", Закрыть);
	
	Если Открыта() Тогда
		Закрыть(Структура);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти