#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ПередВыполнениемКоманды(
		ПараметрыВыполненияКоманды.Источник);
	
	ПараметрыОткрытия = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ПараметрыОткрытияСпискаФайлов(
		ПараметрыВыполненияКоманды.Источник);
	ПараметрыОткрытия.Уникальность = ПараметрыВыполненияКоманды.Уникальность;
	ПараметрыОткрытия.Окно = ПараметрыВыполненияКоманды.Окно;
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОткрытьФормуПрисоединенныеФайлы(
		ПараметрКоманды,
		ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти