#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец,"Владелец");	
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбъектыМетаданных.Ссылка
	|ИЗ
	|	Справочник.ОбъектыМетаданных КАК ОбъектыМетаданных
	|ГДЕ
	|	ОбъектыМетаданных.Имя = ""Константы""
	|	И ОбъектыМетаданных.ЭтоГруппа = ИСТИНА
	|	И ОбъектыМетаданных.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Проект);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ГруппаКонстанты = Выборка.Ссылка;	
	Иначе
		ГруппаКонстанты = Справочники.ОбъектыМетаданных.ПустаяСсылка();		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ХранениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Тип("Тип") = ТипЗнч(ВыбранноеЗначение) Тогда
		
		Если Тип("СправочникСсылка.РеквизитыОбъектовМетаданных") = ВыбранноеЗначение Тогда
			
			ПараметрыОтбор = Новый Структура; 
			ПараметрыОтбор.Вставить("ЭтоГруппа", Ложь);
			ПараметрыОтбор.Вставить("ВидРеквизита", ПредопределенноеЗначение("Перечисление.ВидыРеквизитов.Реквизит"));
			
			ПараметрыФормыВыбора = Новый Структура("Отбор", ПараметрыОтбор);
			ПараметрыФормыВыбора.Вставить("Проект",Проект);
			
			ОткрытьФорму("Справочник.РеквизитыОбъектовМетаданных.ФормаВыбора",ПараметрыФормыВыбора,,,,, Неопределено);
			
		ИначеЕсли Тип("СправочникСсылка.ОбъектыМетаданных") = ВыбранноеЗначение Тогда
			ПараметрыФормыВыбора = Новый Структура;
			ПараметрыОтбор = Новый Структура;
			ПараметрыОтбор.Вставить("Владелец",Проект);
			ПараметрыОтбор.Вставить("Родитель",ГруппаКонстанты);
			ПараметрыФормыВыбора.Вставить("Отбор", ПараметрыОтбор);
			
			ОткрытьФорму("Справочник.ОбъектыМетаданных.ФормаВыбора", ПараметрыФормыВыбора,,,,, Неопределено); 
		Иначе	
			СтандартнаяОбработка = Истина;		
		КонецЕсли;
		
	Иначе
		
		Объект.Хранение = ВыбранноеЗначение; 
		
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыСостав

&НаКлиенте
Процедура СоставТипОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Тип("Тип") = ТипЗнч(ВыбранноеЗначение) Тогда
		
		Если Тип("СправочникСсылка.РеквизитыОбъектовМетаданных") = ВыбранноеЗначение Тогда
			
			ПараметрыОтбор = Новый Структура; 
			ПараметрыОтбор.Вставить("ЭтоГруппа", Ложь);
			ПараметрыОтбор.Вставить("ВидРеквизита", ПредопределенноеЗначение("Перечисление.ВидыРеквизитов.Реквизит"));
			
			ПараметрыФормыВыбора = Новый Структура("Отбор", ПараметрыОтбор);
			ПараметрыФормыВыбора.Вставить("Проект",Проект);
			
			ОткрытьФорму("Справочник.РеквизитыОбъектовМетаданных.ФормаВыбора",ПараметрыФормыВыбора,,,,, Неопределено);
			
		ИначеЕсли Тип("СправочникСсылка.ОбъектыМетаданных") = ВыбранноеЗначение Тогда
			
			ПараметрыФормыВыбора = Новый Структура;
			ПараметрыОтбор = Новый Структура;
			ПараметрыОтбор.Вставить("Владелец",Проект);
			ПараметрыФормыВыбора.Вставить("Отбор", ПараметрыОтбор);
			
			ОткрытьФорму("Справочник.ОбъектыМетаданных.ФормаВыбора", ПараметрыФормыВыбора,,,,, Неопределено); 
			
		ИначеЕсли Тип("СправочникСсылка.Подсистемы") = ВыбранноеЗначение Тогда
			ПараметрыФормыВыбора = Новый Структура;
			ПараметрыОтбор = Новый Структура;
			ПараметрыОтбор.Вставить("Владелец",Проект);
			ПараметрыФормыВыбора.Вставить("Отбор", ПараметрыОтбор);
			
			ОткрытьФорму("Справочник.Подсистемы.ФормаВыбора", ПараметрыФормыВыбора,,,,, Неопределено); 
		ИначеЕсли Тип("СправочникСсылка.КомандыОбъектовМетаданных") = ВыбранноеЗначение Тогда
			
			ПараметрыФормыВыбора = Новый Структура;
			ПараметрыФормыВыбора.Вставить("Проект",Проект);
	
			ОткрытьФорму("Справочник.КомандыОбъектовМетаданных.ФормаВыбора", ПараметрыФормыВыбора,,,,, Неопределено); 	
		Иначе		
			СтандартнаяОбработка = Истина;		
		КонецЕсли;
		
	Иначе
		
		Объект.Хранение = ВыбранноеЗначение; 
		
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти