
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СписокПроцессов") Тогда
		
		СписокПроцессов = Параметры.СписокПроцессов;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", СписокПроцессов, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
		Элементы.Процесс.СписокВыбора.ЗагрузитьЗначения(СписокПроцессов.ВыгрузитьЗначения());
		
		Если СписокПроцессов.Количество()=1 Тогда
			Процесс = СписокПроцессов.Получить(0);
		КонецЕсли;
	Иначе
		Элементы.Процесс.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПроцессПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Процесс) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", Процесс, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	ИначеЕсли ТипЗнч(СписокПроцессов) = Тип("СписокЗначений") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", СписокПроцессов, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", Процесс, ВидСравненияКомпоновкиДанных.Равно,,Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
