
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТекстЗаголовка = НСтр("ru='Применение правил'");
	ТекстСостояния = НСтр("ru='Выполняется применение правил проверки'");
	Состояние(ТекстЗаголовка,,ТекстСостояния);
	
	ПрименитьПравилаСервер(ПараметрКоманды);
	
	Оповестить("Запись_РезультатыПроверкиОбъектов");
	
	ТекстЗаголовка = НСтр("ru='Применение правил'");
	ТекстПояснения = НСтр("ru='Выполнено применение указанных правил'");
	
	ПоказатьОповещениеПользователя(ТекстЗаголовка,,ТекстПояснения, БиблиотекаКартинок.Информация32);
	
	Оповестить("ПрименениеПравилПроверки");
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьПравилаСервер(МассивПравил)
	
	МассивПримененныхПравил = Новый Массив();
	
	Для Каждого Правило из МассивПравил Цикл
		Если МассивПримененныхПравил.Найти(Правило) = Неопределено Тогда
			ПроверкаОбъектов.ВыполнитьПроверкуПоПравилу(Правило);
			МассивПримененныхПравил.Добавить(Правило);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
