
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	  
	Если ТипЗнч(Параметры.Отбор.Гиперссылка) <> Тип("СправочникСсылка.ОбъектыМетаданных") Тогда
		Элементы.СписокПоказатьОписание.Видимость = Ложь;
	Иначе
		ОбъектМетаданных = Параметры.Отбор.Гиперссылка;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение(,Элемент.ТекущиеДанные.ТехническийПроект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьОписание(Команда)
	
	Если Элементы.Список.ТекущиеДанные<>Неопределено Тогда
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(Элементы.Список.ТекущиеДанные.ОписаниеИзмененийИзОтчетаОСравнении);
		ТекстовыйДокумент.ТолькоПросмотр = Истина;
		
		ЗаголовокДокумента = НСтр("ru = 'Изменения по объекту %ОбъектМетаданных%'");
		Если ЗначениеЗаполнено(ОбъектМетаданных) Тогда
			ЗаголовокДокумента = СтрЗаменить(ЗаголовокДокумента, "%ОбъектМетаданных%",ОбъектМетаданных);
		Иначе
			ЗаголовокДокумента = СтрЗаменить(ЗаголовокДокумента, "%ОбъектМетаданных%","");
		КонецЕсли;
		
		ТекстовыйДокумент.Показать(ЗаголовокДокумента);
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти