
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ФормаСписка = ПолучитьФорму("РегистрСведений.РезультатыРегистрацииОшибок.ФормаСписка",,ПараметрыВыполненияКоманды.Окно,
								Истина,ПараметрыВыполненияКоманды.Окно);
	
	ГруппаОтборПОшибкам = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ФормаСписка.Список.Отбор, 
																					"Отбор по ошибкам", 
																					ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтборПОшибкам, 
															"Ошибка", 
															ВидСравненияКомпоновкиДанных.Равно, 
															ПараметрКоманды,
															,
															Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтборПОшибкам, 
															"Ошибка.ПовторяемаяОшибка", 
															ВидСравненияКомпоновкиДанных.Равно, 
															ПараметрКоманды,
															,
															Истина);
															
	ЭлементПорядка = ФормаСписка.Список.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("Дата регистрации");
	ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
	ЭлементПорядка.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	ЭлементПорядка.Использование = Истина;    

	ОткрытьФорму(ФормаСписка,,
				ПараметрыВыполненияКоманды.Источник,
				ПараметрыВыполненияКоманды.Уникальность,
				ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
